Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/ipv6/_index.po
Languages: fa

source: Authentication model for AH tunnel must be revisited. We will need to improve the policy management engine, eventually.
fa: طرح اعتباربخشی برای تونل AH باید بازبینی شود. در نهایت، باید موتور مدیریت خط مشی را بهبود ببخشیم.

source: Conformance to RFCs and IDs
fa: سازگاری با RFC ها و ID ها

source: The IPsec code in the kernel conforms (or, tries to conform) to the following standards:
fa: کد IPSec در هسته سازگار (یا، سعی بر سازگاری) با استانداردهای پیش رو است:

source: Currently supported algorithms are:
fa: الگوریتم‌هایی که در حال حاضر پشتیبانی می‌شوند:

source: null crypto checksum (no document, just for debugging)
fa: null crypto checksum (فاقد مستند، فقط برای اشکال‌زدایی)

source: keyed SHA1 with 128bit crypto checksum (no document)
fa: keyed SHA1 with 128bit crypto checksum (فاقد مستند)

source: HMAC SHA1 with 128bit crypto checksum (no document)
fa: HMAC SHA1 with 128bit crypto checksum (فاقد مستند)

source: keyed MD5 with 96bit crypto checksum (no document)
fa: keyed MD5 with 96bit crypto checksum (فاقد مستند)

source: keyed SHA1 with 96bit crypto checksum (no document)
fa: keyed SHA1 with 96bit crypto checksum (فاقد مستند)

source: each of the above can be combined with:
fa: هر کدام از موارد بالا را می‌توان با موارد زیر ترکیب کرد:

source: ESP authentication with HMAC-MD5(96bit)
fa: اعتباربخشیِ ESP با HMAC-MD5(96bit)

source: ESP authentication with HMAC-SHA1(96bit)
fa: اعتباربخشیِ ESP با HMAC-SHA1(96bit)

source: The following algorithms are NOT supported:
fa: الگوریتم‌های پیش رو پشتیبانی نمی‌شوند:

source: ECN Consideration on IPsec Tunnels
fa: ملاحظهٔ ECN بر روی تونل‌های IPsec

source: IPsec tunnel implementation can give you three behaviors, by setting net.inet.ipsec.ecn (or net.inet6.ipsec6.ecn) to some value:
fa: پیاده‌سازی تونل IPsec با تنظیم مقدار net.inet.ipsec.ecn (یا net.inet6.ipsec6.ecn) ممکن است به شما سه رفتار را نشان دهد:

source: RFC2401: no consideration for ECN (sysctl value -1)
fa: RFC2401: هیچ ملاحظه‌ای برای ECN (sysctl value -1) نیست

source: ECN forbidden (sysctl value 0)
fa: ECN ممنوع (sysctl value 0)

source: ECN allowed (sysctl value 1)
fa: ECN مجاز (sysctl value 1)

source: Note that the behavior is configurable in per-node manner, not per-SA manner (draft-ipsec-ecn-00 wants per-SA configuration, but it looks too much for me).
fa: توجه داشته باشید که این رفتارها به روش هر گره قابل تنظیم هستند، نه به روش هر SA (draft-ipsec-ecn-00 خواهان تنظیم کردن به روش هر SA است، اما به‌نظر خیلی زیاد است).

source: The behavior is summarized as follows (see source code for more detail):
fa: این رفتارها بدین شکل خلاصه شده‌اند (کد منبع را برای جزئیات بیشتر ببینید):

source: General strategy for configuration is as follows:
fa: راهبرد کلی برای پیکربندی چنین است:

source: if the other end is very strict about TOS bit, use "RFC2401" (sysctl value -1).
fa: چنانچه پایانهٔ دیگر در مورد بیت TOS بسیار سخت‌گیرانه است، از "RFC2401" (sysctl value -1) استفاده کنید.

source: in other cases, use "ECN forbidden" (sysctl value 0).
fa: در سایر موارد، از "ECN ممنوع" (sysctl value 0) استفاده کنید.

source: The default behavior is "ECN forbidden" (sysctl value 0).
fa: رفتار پیش‌فرض "ECN ممنوع" است (sysctl value 0).

source: For more information, please refer to:
fa: برای اطلاعات بیشتر، لطفاً مراجعه کنید به:

source: Interoperability
fa: هم‌کنش‌پذیری
