Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/ipv6/_index.po
Languages: fa

source: To summarize the sysctl knob:
fa: برای خلاصه کردن sysctl knob:

source: RFC2462 has validation rule against incoming RA prefix information option, in 5.5.3 (e). This is to protect hosts from malicious (or misconfigured) routers that advertise very short prefix lifetime. There was an update from Jim Bound to ipngwg mailing list (look for "(ipng 6712)" in the archive) and it is implemented Jim's update.
fa: RFC2462 دارای قوانین اعتبارسنجی در برابر گزینهٔ اطلاعات پیشوند RA ورودی، در 5.5.3 (e) است. این بدین منظور است که میزبان‌‌‌ها را از مسیریاب‌های مخرب (یا بد پیکربندی شده) ای که طول عمر پیشوند بسیار کوتاه را اعلان می‌کنند محافظت ‌کند. به‌ روز رسانی‌ای توسط Jim Bound در فهرست پست‌سپاریِ ipngwg ایجاد شده است (بنگرید به "(ipng 6712)" در بایگانی) و به روز رسانیِ Jim پیاده‌سازی شده است.

source: Generic Tunnel Interface
fa: رابط تونل عمومی

source: GIF (Generic InterFace) is a pseudo interface for configured tunnel. Details are described in man:gif[4]. Currently
fa: GIF (Generic InterFace) یک شبه رابط برای تونل پیکربندی شده است. جزئیات در man:gif[4] تشریح شده‌اند. در حال حاضر

source: v6 in v6
fa: v6 در v6

source: v6 in v4
fa: v6 در v4

source: v4 in v6
fa: v4 در v6

source: v4 in v4
fa: v4 در v4

source: are available. Use man:gifconfig[8] to assign physical (outer) source and destination address to gif interfaces. Configuration that uses same address family for inner and outer IP header (v4 in v4, or v6 in v6) is dangerous. It is very easy to configure interfaces and routing tables to perform infinite level of tunneling. _Please be warned_.
fa: در دسترس هستند. از man:gifconfig[8] برای تخصیص منبع فیزیکی (خارجی) و نشانی مقصد در رابط‌های gif استفاده کنید. پیکربندی‌ای که از یک خانواده از نشانی برای سرآیند‌ IP داخلی و خارجی (v4 در v4، یا v6 در v6) استفاده می‌کند خطرناک است. پیکربندی رابط‌ها و مسیرگزینی جدول‌ها جهت اجرای بی‌نهایت مرحله از تونل‌زنی بسیار آسان است. _لطفاً آگاه باشید_.

source: If you would like to configure an IPv4-in-IPv6 tunnel with gif interface, read man:gif[4] carefully. You will need to remove IPv6 link-local address automatically assigned to the gif interface.
fa: چنانچه علاقه‌مند به پیکربندی یک تونل IPv4 به‌همراه رابط gif در IPv6 هستید، man:gif[4] را با دقت بخوانید. لازم خواهد شد تا نشانی IPv6 link-local را که به‌طور خودکار به رابط gif تخصیص داده شده است را حذف کنید.

source: Source Address Selection
fa: انتخاب نشانی منبع

source: Current source selection rule is scope oriented (there are some exceptions - see below). For a given destination, a source IPv6 address is selected by the following rule:
fa: قانون انتخاب منبع فعلی محدوده‌محور است (برخی استثناها وجود دارد - قسمت پایین را ببینید). برای یک مقصد مشخص، نشانی IPv6 منبع توسط قوانین پیش رو انتخاب شده است:

source: If the source address is explicitly specified by the user (e.g., via the advanced API), the specified address is used.
fa: چناچه نشانی منبع به‌صراحت توسط کاربر تعیین شود (برای مثال، توسط یک API پیشرفته)، آن نشانی تعیین شده به‌کار برده می‌شود.

source: If there is an address assigned to the outgoing interface (which is usually determined by looking up the routing table) that has the same scope as the destination address, the address is used.
fa: چنانچه نشانی‌ای به رابط بیرونی تخصیص داده شده باشد (که معمولاً‌ با بررسی جدول مسیرگزینی معین می‌شود) که همان محدودهٔ نشانی مقصد را داراست، نشانی استفاده شده است.

source: This is the most typical case.
fa: این معمول‌ترین حالت است.

source: If there is no address that satisfies the above condition, choose a global address assigned to one of the interfaces on the sending node.
fa: چنانچه هیچ نشانی‌ای نباشد که شرط بالا را برآورده سازد، یک نشانی جهانی که به یکی از رابط‌های موجود در گره‌های در حال ارسال اختصاص یافته است را انتخاب کنید.

source: If there is no address that satisfies the above condition, and destination address is site local scope, choose a site local address assigned to one of the interfaces on the sending node.
fa: چنانچه هیچ نشانی‌ای نباشد که شرط بالا را برآورده سازد، و نشانی مقصد در محدودهٔ site local است، یک نشانی site local که به یکی از رابط‌ها در گرهٔ در حال ارسال تخصیص داده شده است را انتخاب کنید.

source: If there is no address that satisfies the above condition, choose the address associated with the routing table entry for the destination. This is the last resort, which may cause scope violation.
fa: چنانچه هیچ نشانی‌ای نباشد که شرط بالا را برآورده سازد، نشانی‌ای را که مرتبط با ورودی جدول مسیرگزینیِ مقصد است انتخاب کنید. این آخرین چاره است، که ممکن است باعث نقض محدوده شود.

source: Note that the above rule is not documented in the IPv6 spec. It is considered "up to implementation" item. There are some cases where we do not use the above rule. One example is connected TCP session, and we use the address kept in tcb as the source. Another example is source address for Neighbor Advertisement. Under the spec (RFC2461 7.2.2) NA's source should be the target address of the corresponding NS's target. In this case we follow the spec rather than the above longest-match rule.
fa: توجه داشته باشید که قاعدهٔ بالا در مشخصات IPv6 مستند نشده است. این مورد "در صدد پیاده‌سازی" در نظر گرفته شده است. مواردی وجود دارند که ما قاعدهٔ فوق را در آنها اجرا نمی‌کنیم. یک مثال جلسهٔ TCP متصل است، و ما نشانی نگه داشته شده در tcb را به‌عنوان منبع استفاده می‌کنیم. مثال دیگر نشانی منبع برای اعلان همسایه است. تحت مشخصاتِ (RFC2461 7.2.2)، منبعِ NA (اعلان همسایه) باید نشانی هدف برای هدفِ NS (درخواست همسایهٔ) مربوطه باشد. در این مورد ما به‌ جای قاعدهٔ طولانی‌ترین تطابق از مشخصات پیروی می‌کنیم.

source: For new connections (when rule 1 does not apply), deprecated addresses (addresses with preferred lifetime = 0) will not be chosen as source address if other choices are available. If no other choices are available, deprecated address will be used as a last resort. If there are multiple choice of deprecated addresses, the above scope rule will be used to choose from those deprecated addresses. If you would like to prohibit the use of deprecated address for some reason, configure net.inet6.ip6.use_deprecated to 0. The issue related to deprecated address is described in RFC2462 5.5.4 (NOTE: there is some debate underway in IETF ipngwg on how to use "deprecated" address).
fa: برای اتصال‌های جدید (زمانی‌که قاعدهٔ 1 اعمال نمی‌شود)، چنانچه سایر گزینه‌ها مطرح باشند نشانی‌های منسوخ شده (نشانی‌هایی با طول عمر ترجیح داده شده = 0) به‌عنوان نشانی منبع انتخاب نمی‌شوند. اگر هیچ گزینهٔ دیگری نباشد، نشانی‌های منسوخ شده به‌عنوان آخرین گزینه استفاده می‌شوند. چنانچه گزینه‌های مختلف برای نشانی‌های منسوخ شده وجود دارند، قاعدهٔ محدودهٔ بالا برای انتخاب از بین نشانی‌های منسوخ شده مورد استفاده قرار می‌گیرد. اگر می‌خواهید استفادهٔ نشانی‌های‌ منسوخ شده را به هر دلیلی ممنوع کنید، مقدار net.inet6.ip6.use_deprecated را روی 0 تنظیم کنید. مسائل مرتبط با نشانی منسوخ شده در RFC2462 5.5.4 تشریح شده‌اند (توجه: در IETF ipngwg بحث‌هایی در مورد چگونگی به‌کار بردن نشانی "منسوخ شده" در جریان است).

source: Jumbo Payload
fa: پایه‌بارِ Jumbo

source: The Jumbo Payload hop-by-hop option is implemented and can be used to send IPv6 packets with payloads longer than 65,535 octets. But currently no physical interface whose MTU is more than 65,535 is supported, so such payloads can be seen only on the loopback interface (i.e., lo0).
fa: گزینهٔ پایه‌بارِ hop-by-hop در Jumbo پیاده‌سازی شده است و می‌توان به‌منظور ارسال بسته‌های IPv6 با پایه‌بارهایی طولانی‌تر از ۶۵٫۵۳۵ اکتاو از آن استفاده کرد. اما در حال حاضر هیچ رابط فیزیکی‌ای که MTU در آن بیشتر از ۶۵٫۵۳۵ باشد را پشتیبانی نمی‌کند، در نتیجه چنین بارهایی را تنها می‌توان در رابط loopback (برای مثال، lo0) دید.

source: If you want to try jumbo payloads, you first have to reconfigure the kernel so that the MTU of the loopback interface is more than 65,535 bytes; add the following to the kernel configuration file:
fa: چنانچه می‌خواهید پایه‌بارهای Jumbo را امتحان کنید، اول باید هستهٔ خود را طوری پیکربندی کنید تا MTU در رابط loopback بیش از ۶۵٫۵۳۵ بایت باشد؛ خط پیش رو را به پروندهٔ پیکربندی هسته اضافه کنید:

source: `options "LARGE_LOMTU" #To test jumbo payload`
fa: `options "LARGE_LOMTU" #جهت آزمودن پایه‌بارِ jumbo`

source: and recompile the new kernel.
fa: و هستهٔ جدید را دوباره همگردانی کنید.

source: The IPv6 specification requires that the Jumbo Payload option must not be used in a packet that carries a fragment header. If this condition is broken, an ICMPv6 Parameter Problem message must be sent to the sender. specification is followed, but you cannot usually see an ICMPv6 error caused by this requirement.
fa: مشخصات IPv6 ایجاب می‌کند که گزینهٔ پایه‌بارِ Jumbo نباید در بسته‌ای که حامل یک سرآیند شکننده است استفاده شود. چنانچه این شرط فراهم نشود، یک پیغام مبتنی بر مشکلِ پارامترِ ICMPv6 باید به فرستنده ارسال شود. مشخصات به دنبال آن می‌آیند، اما معمولاً نمی‌توانید خطای ICMPv6 که توسط این نیازمندی ایجاد شده باشد را مشاهده کنید.

source: When an IPv6 packet is received, the frame length is checked and compared to the length specified in the payload length field of the IPv6 header or in the value of the Jumbo Payload option, if any. If the former is shorter than the latter, the packet is discarded and statistics are incremented. You can see the statistics as output of man:netstat[8] command with `-s -p ip6' option:
fa: زمانی‌که یک بستهٔ IPv6 دریافت شد، طول چارچوب بررسی می‌شود و اگر موردی باشد، با طول تعیین شده در قسمت طول پایه‌بارِ سرآیندِ IPv6 یا در مقدارِ گزینهٔ پایه‌بارِ Jumbo مقایسه می‌شود. اگر اولی کوتاه‌تر از دومی باشد، بسته حذف می‌شود و آمار افزایش می‌یابند. می‌توانید آمار را در خروجی دستور man:netstat[8] با گزینهٔ `-s -p ip6' ببینید:

source: So, kernel does not send an ICMPv6 error unless the erroneous packet is an actual Jumbo Payload, that is, its packet size is more than 65,535 bytes. As described above, currently no physical interface with such a huge MTU is supported, so it rarely returns an ICMPv6 error.
fa: در نتیجه، هسته خطای ICMPv6 را ارسال نمی‌کند مگر آنکه بستهٔ اشتباه واقعاً یک پایه‌بارِ Jumbo باشد، بدین معنا که اندازهٔ بستهٔ آن بیش از ۶۵٫۵۳۵ بایت است. همانطور که در بالا توضیح داده شد، در حال حاضر هیچ رابط فیزیکی‌ای با این اندازه MTU پشتیبانی نمی‌شود، از این رو به‌ندرت خطای ICMPv6 را برمی‌گرداند.

source: TCP/UDP over jumbogram is not supported at this moment. This is because we have no medium (other than loopback) to test this. Contact us if you need this.
fa: در حال حاضر TCP/UDP بر روی jumbogram پشتیبانی نمی‌شود. این بدین خاطر است که ما هیچ وسیله‌ای (به غیر از loopback) برای آزمودن آن ندارم . چنانچه به چنین چیزی نیاز داشتید ما را در جریان بگذارید.

source: IPsec does not work on jumbograms. This is due to some specification twists in supporting AH with jumbograms (AH header size influences payload length, and this makes it real hard to authenticate inbound packet with jumbo payload option as well as AH).
fa: IPsec با jumbogram ها کار نمی‌کند. این به‌خاطر برخی پیچیدگی‌های مشخصاتی در پشتیبانی از AH با jumbogram هاست (اندازهٔ سرآیندِ AH طولِ پایه‌بار را تحت تاثیر قرار می‌دهد، و این مسئله اعتبارسنجی بستهٔ درونی را با گزینهٔ پایه‌بارِ jumbo و همچنین AH بسیار سخت می‌کند).

source: There are fundamental issues in *BSD support for jumbograms. We would like to address those, but we need more time to finalize these. To name a few:
fa: در پشتیبانی از jumbogram ها در *BSD مشکلات اساسی‌ای وجود دارد. دوست داریم آنها را درست کنیم، اما نیاز به زمان بیشتر جهت نهایی کردن آنها داریم. برخی از آنها عبارتند از:

source: mbuf pkthdr.len field is typed as "int" in 4.4BSD, so it will not hold jumbogram with len > 2G on 32bit architecture CPUs. If we would like to support jumbogram properly, the field must be expanded to hold 4G + IPv6 header + link-layer header. Therefore, it must be expanded to at least int64_t (u_int32_t is NOT enough).
fa: بخش pkthdr.len در mbuf در 4.4BSD به شکل "int" نوشته می‌شود، در نتیجه در پردازنده‌های با معماری ۳۲ بیت jumbogram با طول بیش از 2G را نگه نمی‌دارد. اگر تمایلی به پشتیبانی صحیح jumbogram داشته باشیم، این بخش باید گسترش یابد تا بتواند 4G را همراه با سرآیند IPv6 و سرآیندِ link-layer نگه‌داری کند. از این رو، باید حداقل به int64_t گسترش یابد (u_int32_t کافی نیست).

source: We mistakingly use "int" to hold packet length in many places. We need to convert them into larger integral type. It needs a great care, as we may experience overflow during packet length computation.
fa: ما به اشتباه از "int" برای نگه‌داری طول بسته‌ها در بسیاری از مکان‌ها استفاده می‌کنیم. لازم است آنها را به حالت انتگرال بزرگتر تبدیل کنیم. از آنجا که ممکن است هنگام محاسبهٔ طول بسته دچار سرریز میان‌گیر شویم، نیاز به مراقبت فراوان دارد.

source: We mistakingly check for ip6_plen field of IPv6 header for packet payload length in various places. We should be checking mbuf pkthdr.len instead. ip6_input() will perform sanity check on jumbo payload option on input, and we can safely use mbuf pkthdr.len afterwards.
fa: ما به‌اشتباه بخش ip6_plen از سرآیند IPv6 را برای طول پایه‌بار بسته در مکان‌های مختلف بررسی می‌کنیم. در عوض باید mbuf pkthdr.len را بررسی کنیم. ip6_input() سلامتی گزینهٔ بارِ jumbo در ورودی را بررسی می‌کند، و پس از آن می‌توانیم با اطمینان از mbuf pkthdr.len استفاده کنیم.

source: TCP code needs a careful update in bunch of places, of course.
fa: البته، کد TCP نیاز به یک به‌روزرسانی محتاطانه در چندین بخش دارد.

source: Loop Prevention in Header Processing
fa: اجتناب از حلقه در پردازش سرآیند

source: IPv6 specification allows arbitrary number of extension headers to be placed onto packets. If we implement IPv6 packet processing code in the way BSD IPv4 code is implemented, kernel stack may overflow due to long function call chain. sys/netinet6 code is carefully designed to avoid kernel stack overflow, so sys/netinet6 code defines its own protocol switch structure, as "struct ip6protosw" (see [.filename]#netinet6/ip6protosw.h#). There is no such update to IPv4 part (sys/netinet) for compatibility, but small change is added to its pr_input() prototype. So "struct ipprotosw" is also defined. As a result, if you receive IPsec-over-IPv4 packet with massive number of IPsec headers, kernel stack may blow up. IPsec-over-IPv6 is okay. (Of-course, for those all IPsec headers to be processed, each such IPsec header must pass each IPsec check. So an anonymous attacker will not be able to do such an attack.)
fa: مشخصات IPv6 این امکان را فراهم می‌کند تا اعداد اختیاریِ سرآیند‌های پسوند در داخل بسته‌ها قرار گیرند. اگر ما کد پردازش بستهٔ IPv6 را همانطور که کد IPv4 را در BSD پیاده‌سازی کردیم پیاده‌سازی کنیم، ممکن است پشتهٔ هسته به‌علت زنجیرهٔ فراخوانی توابعِ طولانی سرریز کند. کد sys/netinet6 با دقت طراحی شده است تا سرریز پشتهٔ هسته رخ ندهد. به‌همین خاطر، کد sys/netinet6 ساختار تغییرِ قرارداد خودش را تعریف می‌کند، مانند "struct ip6protosw" ([.filename]#netinet6/ip6protosw.h# را ببینید). چنین به روز رسانی‌ای در قسمت IPv4 ((sys/netinet) برای سازگاری وجود ندارد، اما تغییر کوچکی در نمونهٔ اصلیِ its pr_input() آن اضافه شده است. در نتیجه "struct ipprotosw" نیز تعریف شده است. از این رو، اگر بستهٔ IPsec بر روی IPv4 را با تعداد زیادی از سرآیندهای IPsec دریافت کردید، پشتهٔ هسته ممکن است متوقف شود. IPsec بر روی IPv6 مشکلی ندارد. (البته، برای تمام آن سرآیندهای IPsec که قرار است پردازش شوند، هرکدام از سرآیندهای IPsec باید بررسی‌های IPsec را بگذرانند. بنابراین یک حمله‌کنندهٔ ناشناس نمی‌تواند چنین حمله‌ای را صورت دهد.)

source: After RFC2463 was published, IETF ipngwg has decided to disallow ICMPv6 error packet against ICMPv6 redirect, to prevent ICMPv6 storm on a network medium. This is already implemented into the kernel.
fa: پس از آنکه RFC2463 منتشر شد، IETF ipngwg تصمیم گرفته است تا بستهٔ خطای ICMPv6 را در مقابل تغییر مسیرِ ICMPv6 نادیده بگیرد، تا از طوفان ICMPv6 در یک رسانهٔ شبکه‌ای جلوگیری شود. این امکان از قبل در هسته پیاده‌سازی شده است.

source: Applications
fa: برنامه‌های کاربردی

source: For userland programming, we support IPv6 socket API as specified in RFC2553, RFC2292 and upcoming Internet drafts.
fa: برای برنامه‌نویسی در محیط کاربری، ما رابط‌ برنامه‌نویسی کاربردی سوکت IPv6 را همانطور که در RFC2553، RFC2292 و پیش‌نویس‌های اینترنت در آینده مشخص شده است پشتیبانی می‌کنیم.

source: TCP/UDP over IPv6 is available and quite stable. You can enjoy man:telnet[1], man:ftp[1], man:rlogin[1], man:rsh[1], man:ssh[1], etc. These applications are protocol independent. That is, they automatically chooses IPv4 or IPv6 according to DNS.
fa: TCP/UDP بر روی IPv6 در دسترس است و کاملاً پایدار است. می‌توانید از برنامه‌های man:telnet[1]، man:ftp[1]، man:rlogin[1]، man:rsh[1]، man:ssh[1] و ... بهره جویید. این برنامه‌ها مستقل از قرارداد هستند. از این رو، آنها به‌طور خودکار IPv4 یا IPv6 را مطابق با DNS انتخاب می‌کنند.

source: Kernel Internals
fa: داخلی‌های هسته

source: While ip_forward() calls ip_output(), ip6_forward() directly calls if_output() since routers must not divide IPv6 packets into fragments.
fa: در حالی‌که ip_forward() فراخوانیِ ip_output() را انجام می‌دهد، ip6_forward() مستقیماً if_output() را فراخوانی می‌کند زیرا مسیریاب‌ها نباید بسته‌های IPv6 را به قطعات تقسیم کنند.

source: ICMPv6 should contain the original packet as long as possible up to 1280. UDP6/IP6 port unreach, for instance, should contain all extension headers and the *unchanged* UDP6 and IP6 headers. So, all IP6 functions except TCP never convert network byte order into host byte order, to save the original packet.
fa: ICMPv6 باید تا جای ممکن بستهٔ اصلی را تا حد 1280 شامل شود. برای مثال، درگاه خارج از دسترسِ UDP6/IP6، باید تمام سرآیند‌های پسوند و سرآیند‌های *بدون تغییرِ* UDP6 و IP6 را دارا باشد. در نتیجه، تمامی کارکردهای IP6 به‌غیر از TCP هرگز ترتیب بایتِ شبکه را به ترتیب بایتِ میزبان تبدیل نمی‌کنند تا بستهٔ اصلی را ذخیره کند.

source: Both IP and IP6 reassemble functions never call m_pullup().
fa: هردو توابعِ جمع‌آوریِ IP و IP6 هرگز m_pullup() را فراخوانی نمی‌کنند.

source: IPv4 Mapped Address and IPv6 Wildcard Socket
fa: نشانی نگاشت‌شدهٔ IPv4 و سوکت IPv6 Wildcard

source: Accept IPv4 connections by AF_INET6 wildcard bind socket.
fa: ارتباطات IPv4 را توسط سوکت AF_INET6 wildcard bind بپذیرید.

source: Transmit IPv4 packet over AF_INET6 socket by using special form of the address like ::ffff:10.1.1.1.
fa: بستهٔ IPv4 را از طریق قالب ویژه‌ای از نشانی مانند ::ffff:10.1.1.1 بر روی سوکت AF_INET6 منتقل کنید.

source: You can perform wildcard bind on both of the address families, on the same port.
fa: می‌توانید اتصال wildcard را بر روی هر دو خانوادهٔ نشانی اجر کنید، بر روی یک پورت.

source: The following table show the behavior of FreeBSD 4.x.
fa: جدول پیش رو رفتار FreeBSD 4.x را نشان می‌دهد.

source: The following sections will give you more details, and how you can configure the behavior.
fa: بخش‌های پیش رو، جزئیات بیشتر و چگونگی پیکربندی رفتار را به شما نشان می‌دهد.

source: Comments on listening side:
fa: توضیحاتی در باب سمت شنونده:

source: If a server application would like to accept IPv4 and IPv6 connections, there will be two alternatives.
fa: اگر یک برنامهٔ کارساز بخواهد ارتباطات IPv4 و IPv6 را بپذیرد، دو گزینه وجود خواهد داشت.

source: When this call succeed, then this socket only receive IPv6 packets.
fa: هنگامی‌که این فراخوان موفق می‌شود، سپس این سوکت تنها بسته‌های IPv6 را دریافت می‌کند.

source: Comments on initiating side:
fa: توضیحاتی در باب سمت آغازگر:

source: Advise to application implementers: to implement a portable IPv6 application (which works on multiple IPv6 kernels), we believe that the following is the key to the success:
fa: توصیه برای افرادی که پیاده‌سازی برنامه انجام می‌دهند‌: برای پیاده‌سازی یک برنامهٔ قابل‌حملِ IPv6 (که در هسته‌های IPv6 مختلف کار کند)، باور داریم موارد پیش رو کلید موفقیت هستند:

source: NEVER hardcode AF_INET nor AF_INET6.
fa: هرگز AF_INET یا AF_INET6 را سخت‌نویسی نکنید.

source: unified tcp and inpcb code
fa: کد tcp و inpcb یکپارچه

source: By default, AF_INET6 socket will grab IPv4 connections in certain condition, and can initiate connection to IPv4 destination embedded in IPv4 mapped IPv6 address.
fa: به‌طور پیش‌فرض، سوکت AF_INET6 اتصالات IPv4 را در شرایط خاصی می‌رباید، و می‌تواند اتصال به مقصد IPv4 جاسازی شده در نشانی IPv6 نگاشت‌شدهٔ IPv4 را آغاز کند.

source: You can disable it on entire system with sysctl like below.
fa: می‌توانید آن را بدین شکل با sysctl در کل سامانه غیرفعال کنید.

source: Wildcard AF_INET6 socket grabs IPv4 connection if and only if the following conditions are satisfied:
fa: سوکت Wildcard AF_INET6 اتصال IPv4 را می‌رباید چنانچه تنها شرایط پیش رو برآورده شده باشد:

source: there is no AF_INET socket that matches the IPv4 connection
fa: هیچ سوکت AF_INET نباشد که متناسب با اتصال IPv4 باشد

source: the AF_INET6 socket is configured to accept IPv4 traffic, i.e., getsockopt(IPV6_BINDV6ONLY) returns 0.
fa: سوکت AF_INET6 پیکربندی شده باشد تا ترافیک IPv4 را بپذیرد، برای مثال: getsockopt(IPV6_BINDV6ONLY) مقدار 0 را بازگرداند.

source: There is no problem with open/close ordering.
fa: مشکلی با ترتیب باز/بسته نیست.

source: FreeBSD 4.x supports outgoing connection to IPv4 mapped address (::ffff:10.1.1.1), if the node is configured to support IPv4 mapped address.
fa: چنانچه گره به‌گونه‌ای پیکربندی شده باشد تا نشانی نگاشت‌شدهٔ IPv4 را پشتیبانی کند، FreeBSD 4.x اتصال خروجی به نشانی‌های نگاشت‌شدهٔ IPv4 مانند (::ffff:10.1.1.1) را پشتیبانی می‌کند.

source: As a result, RFC2553 defines struct sockaddr_storage as follows:
fa: در نتیجه، RFC2553 مقدار struct sockaddr_storage را چنین تعریف می‌کند:

source: On the contrary, XNET draft defines as follows:
fa: برعکس، پیش‌نویس XNET بدین ترتیب تعریف می‌شود:

source: In December 1999, it was agreed that RFC2553bis should pick the latter (XNET) definition.
fa: در تاریخ دسامبر ۱۹۹۹، پذیرفته شد که RFC2553bis باید تعریف دومِ (XNET) را انتخاب کند.

source: Current implementation conforms to XNET definition, based on RFC2553bis discussion.
fa: پیاده‌سازی فعلی منطبق با تعریف XNET است، برپایهٔ مباحث RFC2553bis.

source: ensure ss_family and/or ss_len are available on the platform, by using GNU autoconf,
fa: مطمئن شوید ss_family و/یا ss_len در بستر در دسترس باشند، با استفاده از GNU autoconf،

source: have -Dss_family=__ss_family to unify all occurrences (including header file) into __ss_family, or
fa: -Dss_family=__ss_family تمام موارد را در __ss_family یکپارچه کند (شامل پروندهٔ سرآیند)، یا

source: never touch __ss_family. cast to sockaddr * and use sa_family like:
fa: هرگز __ss_family را دست نزنید. بریزید داخل sockaddr * و sa_family را اینگونه به‌کار ببرید:

source: Network Drivers
fa: گرداننده‌های شبکه

source: Now following two items are required to be supported by standard drivers:
fa: حال نیاز است تا دو مورد پیش رو توسط گرداننده‌های استاندارد پشتیبانی شوند:

source: mbuf clustering requirement. In this stable release, we changed MINCLSIZE into MHLEN+1 for all the operating systems in order to make all the drivers behave as we expect.
fa: نیازمندی mbuf clustering. در این نسخهٔ پایدار، ما MINCLSIZE را برای تمام سامانه‌های عامل به MHLEN تغییر دادیم تا تمام گرداننده‌ها را مجاب به رفتاری کنیم که انتظار داریم.

source: Translator
fa: مترجم

source: We categorize IPv4/IPv6 translator into 4 types:
fa: ما مترجم IPv4/IPv6 را به ۴ نوع دسته‌بندی می‌کنیم:

source: IPsec is mainly organized by three components.
fa: IPsec به‌طور کلی توسط سه بخش تشکیل شده است.

source: Policy Management
fa: مدیریت خط مشی

source: Key Management
fa: مدیریت کلید

source: AH and ESP handling
fa: مدیریت AH و ESP

source: The policy entry is not re-ordered with its indexes, so the order of entry when you add is very significant.
fa: ورودی خط مشی با فهرست‌های خود مرتب نمی‌شود، در نتیجه ترتیب ورودی که شما اضافه می‌کنید بسیار مهم است.

source: AH and ESP Handling
fa: مدیریت AH و ESP

source: Tunnel mode is partially supported in this release, with the following restrictions:
fa: حالت تونل تا اندازه‌ای در این نسخه پشتیبانی می‌شود، با این محدودیت‌ها:

source: MTU and Don't Fragment bit (IPv4) considerations need more checking, but basically works fine.
fa: ملاحظات MTU و بیت Don't Fragment (IPv4) نیاز به بررسی بیشتری دارند، اما اساساً درست کار می‌کنند.
