Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/ipv6/_index.po
Languages: fa

source: IPv6 Internals
fa: داخلی‌های IPv6

source: Chapter 8. IPv6 Internals
fa: فصل ۸. اجزای داخلی IPv6

source: IPv6/IPsec Implementation
fa: پیاده‌سازی IPv6/IPsec

source: This section should explain IPv6 and IPsec related implementation internals. These functionalities are derived from http://www.kame.net/[KAME project]
fa: این بخش باید اجزای داخلی مرتبط با پیاده‌سازی IPv6 و IPsec را توضیح دهد. این کارکردها از http://www.kame.net/[پروژهٔ KAME] مشتق شده‌اند

source: Conformance
fa: انطباق

source: The IPv6 related functions conforms, or tries to conform to the latest set of IPv6 specifications. For future reference we list some of the relevant documents below (_NOTE_: this is not a complete list - this is too hard to maintain...).
fa: کارکردهای مرتبط با IPv6 منطبق با، یا سعی بر تطابق با آخرین مجموعه از مشخصات IPv6 را دارند. برای ارجاعات بعدی برخی مستندات مرتبط را در قسمت پایین فهرست می‌کنیم (توجه: این یک فهرست کامل نیست - حفظ آن بسیار دشوار است...).

source: For details please refer to specific chapter in the document, RFCs, manual pages, or comments in the source code.
fa: برای جزئیات خواهشمند است به فصل مشخص شده در مستندات، RFC ها، صفحات راهنما، یا توضیحات موجود در کد منبع رجوع کنید.

source: Conformance tests have been performed on the KAME STABLE kit at TAHI project. Results can be viewed at http://www.tahi.org/report/KAME/[http://www.tahi.org/report/KAME/]. We also attended University of New Hampshire IOL tests (http://www.iol.unh.edu/[http://www.iol.unh.edu/]) in the past, with our past snapshots.
fa: آزمون‌های انطباق در پروژهٔ TAHI بر روی کیت KAME STABLE اجرا شده‌اند. نتایج آن در http://www.tahi.org/report/KAME/[http://www.tahi.org/report/KAME/] قابل مشاهده است. ما همچنین در گذشته، با تصاویر لحظه‌ایِ پیشین خود در آزمون‌های IOL در دانشگاه نیوهمپشر (http://www.iol.unh.edu/[http://www.iol.unh.edu/]) شرکت کردیم.

source: RFC2428 is preferred over RFC1639. FTP clients will first try RFC2428, then RFC1639 if failed.
fa: RFC2428 به RFC1639 ترجیح داده می‌شود. کارخواهان FTP ابتدا RFC2428 را امتحان می‌کنند، سپس چنانچه ناموفق بود به سراغ RFC1639 می‌روند.

source: RFC1886: DNS Extensions to support IPv6
fa: RFC1886: پسوندهای سامانهٔ نام دامنه (DNS) برای پشتیبانی از IPv6

source: RFC1933: Transition Mechanisms for IPv6 Hosts and Routers
fa: RFC1933: سازوکارهای انتقال برای میزبان‌ها و مسیریاب‌های IPv6

source: IPv4 compatible address is not supported.
fa: نشانی سازگار با IPv4 پشتیبانی نمی‌شود.

source: automatic tunneling (described in 4.3 of this RFC) is not supported.
fa: تونل‌زنی خودکار (توصیف شده در 4.3 از همین RFC) پشتیبانی نمی‌شود.

source: RFC1981: Path MTU Discovery for IPv6
fa: RFC1981: Path MTU Discovery برای IPv6

source: RFC2080: RIPng for IPv6
fa: RFC2080: RIPng برای IPv6

source: usr.sbin/route6d support this.
fa: usr.sbin/route6d این را پشتیبانی می‌کند.

source: RFC2292: Advanced Sockets API for IPv6
fa: RFC2292: رابط‌ برنامه‌نویسی کاربردی سوکت‌های پیشرفته برای IPv6

source: For supported library functions/kernel APIs, see [.filename]#sys/netinet6/ADVAPI#.
fa: برای توابع کتابخانه یا رابط‌‌های برنامه‌نویسی کاربردیِ هستهٔ پشتیبانی‌شده، بنگرید به [.filename]#sys/netinet6/ADVAPI#.

source: RFC2362 defines packet formats for PIM-SM. [.filename]#draft-ietf-pim-ipv6-01.txt# is written based on this.
fa: RFC2362 قالب‌های بسته برای PIM-SM را تعیین می‌کند. [.filename]#draft-ietf-pim-ipv6-01.txt# بر همین اساس نوشته شده است.

source: RFC2373: IPv6 Addressing Architecture
fa: RFC2373: معماری نشانی‌دهی IPv6

source: supports node required addresses, and conforms to the scope requirement.
fa: نشانی‌های نیازمند گره را پشتیبانی می‌کند، و با مطابق با نیازمندی حوزه است.

source: RFC2374: An IPv6 Aggregatable Global Unicast Address Format
fa: RFC2374: یک قالب نشانی یونیکست جهانی قابل تجمیع IPv6

source: supports 64-bit length of Interface ID.
fa: شناسهٔ رابط با طول ۶۴ بیت را پشتیبانی می‌کند.

source: RFC2375: IPv6 Multicast Address Assignments
fa: RFC2375: تخصیص نشانی مالتی‌کست IPv6

source: Userland applications use the well-known addresses assigned in the RFC.
fa: برنامه‌های محیط کاربری از نشانی‌های شناخته‌شدهٔ اختصاص داده شده در RFC استفاده می‌کنند.

source: RFC2428: FTP Extensions for IPv6 and NATs
fa: RFC2428: پسوندهای FTP برای IPv6 و NAT ها

source: RFC2460: IPv6 specification
fa: RFC2460: مشخصات IPv6

source: RFC2461: Neighbor discovery for IPv6
fa: RFC2461: کشف همسایه برای IPv6

source: RFC2462: IPv6 Stateless Address Autoconfiguration
fa: RFC2462: پیکربندی خودکار نشانی بی‌حالت IPv6

source: RFC2463: ICMPv6 for IPv6 specification
fa: RFC2463: ICMPv6 برای مشخصات IPv6

source: RFC2464: Transmission of IPv6 Packets over Ethernet Networks
fa: RFC2464: انتقال بسته‌های IPv6 بر روی شبکه‌های Ethernet

source: RFC2465: MIB for IPv6: Textual Conventions and General Group
fa: RFC2465: MIB برای IPv6: قراردادهای متنی و گروه‌های عمومی

source: Necessary statistics are gathered by the kernel. Actual IPv6 MIB support is provided as a patchkit for ucd-snmp.
fa: مقادیر لازم توسط هسته جمع‌آوری شده‌اند. پشتیبانی فعلی برای MIB در IPv6 به‌عنوان یک patchkit برای ucd-snmp ارائه شده است.

source: RFC2466: MIB for IPv6: ICMPv6 group
fa: RFC2466: MIB برای IPv6: گروه ICMPv6

source: Necessary statistics are gathered by the kernel. Actual IPv6 MIB support is provided as patchkit for ucd-snmp.
fa: مقادیر لازم توسط هسته جمع‌آوری شده‌اند. پشتیبانی فعلی برای MIB در IPv6 به‌عنوان یک patchkit برای ucd-snmp ارائه شده است.

source: RFC2467: Transmission of IPv6 Packets over FDDI Networks
fa: RFC2467: انتقال بسته‌‌های IPv6 بر روی شبکه‌های FDDI

source: RFC2497: Transmission of IPv6 packet over ARCnet Networks
fa: RFC2464: انتقال بسته‌های IPv6 بر روی شبکه‌های ARCnet

source: RFC2553: Basic Socket Interface Extensions for IPv6
fa: RFC2553: پسوندهای رابط سوکت پایه‌ای برای IPv6

source: RFC2675: IPv6 Jumbograms
fa: RFC2675: Jumbogram های IPv6

source: RFC2710: Multicast Listener Discovery for IPv6
fa: RFC2710: کشف شنوندهٔ مالتی‌کست برای IPv6

source: RFC2711: IPv6 router alert option
fa: RFC2711: گزینهٔ هشدار مسیریابِ IPv6

source: [.filename]#draft-ietf-ipngwg-router-renum-08#: Router renumbering for IPv6
fa: [.filename]#draft-ietf-ipngwg-router-renum-08#: تجدید شماره‌گذاری مسیریاب برای IPv6

source: [.filename]#draft-ietf-ipngwg-icmp-namelookups-02#: IPv6 Name Lookups Through ICMP
fa: [.filename]#draft-ietf-ipngwg-icmp-namelookups-02#: جستجوی نام IPv6 از طریق ICMP

source: [.filename]#draft-ietf-ipngwg-icmp-name-lookups-03#: IPv6 Name Lookups Through ICMP
fa: [.filename]#draft-ietf-ipngwg-icmp-name-lookups-03#: جستجوی نام IPv6 از طریق ICMP

source: man:pim6dd[8] implements dense mode. man:pim6sd[8] implements sparse mode.
fa: man:pim6dd[8] حالت متراکم را پیاده‌سازی می‌کند. man:pim6sd[8] حالت پراکنده را پیاده‌سازی می‌کند.

source: [.filename]#draft-itojun-ipv6-tcp-to-anycast-00#: Disconnecting TCP connection toward IPv6 anycast address
fa: [.filename]#draft-itojun-ipv6-tcp-to-anycast-00#: اتصال TCP را سمت نشانی anycast در IPv6 قطع می‌کند

source: [.filename]#draft-ietf-ipngwg-scopedaddr-format-00.txt#: An Extension of Format for IPv6 Scoped Addresses
fa: [.filename]#draft-ietf-ipngwg-scopedaddr-format-00.txt#: پسوند قالب برای نشانی‌های محدود IPv6

source: Neighbor Discovery
fa: کشف همسایه

source: Neighbor Discovery is fairly stable. Currently Address Resolution, Duplicated Address Detection, and Neighbor Unreachability Detection are supported. In the near future we will be adding Proxy Neighbor Advertisement support in the kernel and Unsolicited Neighbor Advertisement transmission command as admin tool.
fa: کشف همسایه نسبتاً پایدار است. در حال حاضر تفکیک نشانی، تشخیص نشانی تکراری، و تشخیص دسترسی‌ناپذیری همسایه پشتیبانی می‌شوند. در آیندهٔ نزدیک پشتیبانی از اعلان همسایهٔ پراکسی در هسته و دستور انتقال اعلان همسایهٔ ناخواسته به‌عنوان ابزار سرپرست را اضافه می‌کنیم.

source: If DAD fails, the address will be marked "duplicated" and message will be generated to syslog (and usually to console). The "duplicated" mark can be checked with man:ifconfig[8]. It is administrators' responsibility to check for and recover from DAD failures. The behavior should be improved in the near future.
fa: چنانچه DAD (تشخیص نشانی تکراری) کار نکند، نشانی به‌عنوان "تکراری" علامت‌گذاری می‌شود و پیام در syslog (و معمولاً در پیشانه) ایجاد می‌شود. علامت "تکراری" می‌تواند توسط man:ifconfig[8] بررسی شود. این وظیفهٔ سرپرستان است که نارسایی‌های DAD را بررسی و از آنها بهبود یابند. این رفتار باید در آیندهٔ نزدیک اصلاح شود.

source: Some of the network driver loops multicast packets back to itself, even if instructed not to do so (especially in promiscuous mode). In such cases DAD may fail, because DAD engine sees inbound NS packet (actually from the node itself) and considers it as a sign of duplicate. You may want to look at #if condition marked "heuristics" in sys/netinet6/nd6_nbr.c:nd6_dad_timer() as workaround (note that the code fragment in "heuristics" section is not spec conformant).
fa: برخی حلقه‌های گردانندهٔ شبکه بسته‌ها را به خودشان مالتی‌کست می‌کنند، حتی اگر به‌گونه‌ای دستور گرفته باشند که چنین نکنند (مخصوصاً در حالت بی‌قاعده). در چنین مواردی ممکن است که DAD شکست بخورد، زیرا موتور DAD بسته‌های داخلی NS را (در واقع از خود گره) می‌بیند و آن را به‌نشان تکراری بودن در نظر می‌گیرد. ممکن است بخواهید به شرط #if که در sys/netinet6/nd6_nbr.c:nd6_dad_timer() به‌عنوان راه حل جایگزین "heuristics" نشانه‌گذاری شده است نگاهی بیندازید (توجه کنید قطعه کد واقع در بخش "heuristics" منطبق با مشخصات نیست).

source: Neighbor Discovery specification (RFC2461) does not talk about neighbor cache handling in the following cases:
fa: مشخصات کشف همسایه (RFC2461) در موارد زیر در مورد رسیدگی به کَش همسایه صحبتی نمی‌کند:

source: when there was no neighbor cache entry, node received unsolicited RS/NS/NA/redirect packet without link-layer address
fa: هنگامی‌که هیچ ورودی کَش همسایه‌ای وجود نداشت، گره بسته‌های تغییر مسیر ناخواستهٔ RS/NS/NA/ را بدون نشانی سطح پیوند دریافت کرد

source: neighbor cache handling on medium without link-layer address (we need a neighbor cache entry for IsRouter bit)
fa: رسیدگی به کَش همسایه در حد متوسط بدون نشانی سطح پیوند (برای قسمت IsRouter ما نیاز به یک ورودی کَش همسایه داریم)

source: For first case, we implemented workaround based on discussions on IETF ipngwg mailing list. For more details, see the comments in the source code and email thread started from (IPng 7155), dated Feb 6 1999.
fa: برای اولین مورد، ما راه‌حل جایگزین را بر اساس مباحثی که در فهرست پست‌سپاری IETF ipngwg صورت گرفت پیاده‌سازی کردیم. برای جزئیات بیشتر بنگرید به توضیحات کد منبع و بند ایمیلی که از (IPng 7155) به تاریخ ۶ فوریه ۱۹۹۹ شروع شده است.

source: IPv6 on-link determination rule (RFC2461) is quite different from assumptions in BSD network code. At this moment, no on-link determination rule is supported where default router list is empty (RFC2461, section 5.2, last sentence in 2nd paragraph - note that the spec misuse the word "host" and "node" in several places in the section).
fa: قانون تعیین‌کنندگیِ on-link در IPv6 (RFC2461) کاملاً متفاوت از مفروضات در کد شبکهٔ BSD است. در این لحظه، هیچ قانون تعیین‌کنندگیِ on-link در جایی‌که فهرست مسیریاب خالی باشد پشتیبانی نمی‌شود (RFC2461، بخش 5.2، آخرین جلمه در پاراگراف دوم - توجه داشته باشید که مشخصات در برخی قسمت‌ها کلمهٔ "میزبان" و "گره" را اشتباه به‌کار می‌برد).

source: To avoid possible DoS attacks and infinite loops, only 10 options on ND packet is accepted now. Therefore, if you have 20 prefix options attached to RA, only the first 10 prefixes will be recognized. If this troubles you, please ask it on FREEBSD-CURRENT mailing list and/or modify nd6_maxndopt in [.filename]#sys/netinet6/nd6.c#. If there are high demands we may provide sysctl knob for the variable.
fa: به‌منظور پیشگیری از حملات احتمالی DoS و حلقه‌های بی‌نهایت، تنها ۱۰ گزینه در بستهٔ ND در حال حاضر پذیرفته می‌شود. از این رو، چنانچه شما ۲۰ گزینهٔ پیشوند دارید که به RA الصاق شده‌اند، تنها ۱۰ پیشوند اولیه شناسایی می‌شوند. اگر این مسئله شما را آزار می‌دهد، لطفاً‌ آن را در فهرست پست‌سپاریِ FREEBSD-CURRENT بپرسید و/یا nd6_maxndopt را در [.filename]#sys/netinet6/nd6.c# تغییر دهید. چنانچه درخواست‌ها زیاد شوند ممکن است که یک sysctl knob برای متغیر ارائه کنیم.

source: Scope Index
fa: فهرست محدوده

source: IPv6 uses scoped addresses. Therefore, it is very important to specify scope index (interface index for link-local address, or site index for site-local address) with an IPv6 address. Without scope index, scoped IPv6 address is ambiguous to the kernel, and kernel will not be able to determine the outbound interface for a packet.
fa: IPv6 از نشانی‌های محدود‌شده استفاده می‌کند. در نتیجه، تعیین فهرست محدوده با یک نشانی IPv6 بسیار مهم است (فهرست رابط برای نشانی link-local، یا فهرست سایت برای نشانی site-local). بدون فهرست محدوده، نشانی محدود‌شدهٔ IPv6 نسبت به هسته مبهم است، و هسته قادر به تعیین رابط بیرونی برای یک بسته نخواهد بود.

source: Ordinary userland applications should use advanced API (RFC2292) to specify scope index, or interface index. For similar purpose, sin6_scope_id member in sockaddr_in6 structure is defined in RFC2553. However, the semantics for sin6_scope_id is rather vague. If you care about portability of your application, we suggest you to use advanced API rather than sin6_scope_id.
fa: برنامه‌های عادی محیط کاربری باید از رابط‌ برنامه‌نویسی کاربردی (API) پیشرفته (RFC2292) استفاده کنند تا فهرست محدوده، یا فهرست رابط را مشخص کنند. برای منظور مشابه، عضو sin6_scope_id در ساختار sockaddr_in6 در RFC2553 تعریف شده است. هرچند، قوائد معنایی برای sin6_scope_id به‌نسبت مبهم است. اگر به جابجایی‌پذیری برنامهٔ خود اهمیت می‌دهید، پیشنهاد می‌کنیم از API های پیشرفته به جای sin6_scope_id استفاده کنید.

source: In the kernel, an interface index for link-local scoped address is embedded into 2nd 16bit-word (3rd and 4th byte) in IPv6 address. For example, you may see something like:
fa: در هسته، یک فهرست رابط برای نشانی محدود‌شدهٔ link-local داخل دومین کلمهٔ ۱۶-بیتی (بایت سوم و چهارم) در نشانی IPv6 جاسازی شده است. برای مثال، ممکن است چیزی مانند این را مشاهده کنید:

source: in the routing table and interface address structure (struct in6_ifaddr). The address above is a link-local unicast address which belongs to a network interface whose interface identifier is 1. The embedded index enables us to identify IPv6 link local addresses over multiple interfaces effectively and with only a little code change.
fa: در جدول مسیرگزینی و ساختار نشانی رابط (struct in6_ifaddr). نشانی بالا یک نشانی یونیکست link-local است که متعلق به یک رابط شبکه است که شناسانهٔ رابط آن ۱ است. فهرست جاسازی شده این امکان را به ما می‌دهد تا نشانی‌های IPv6 link local را تنها با کمی تغییر در کد نسبت به رابط‌های مختلف شناسایی کنیم.

source: Routing daemons and configuration programs, like man:route6d[8] and man:ifconfig[8], will need to manipulate the "embedded" scope index. These programs use routing sockets and ioctls (like SIOCGIFADDR_IN6) and the kernel API will return IPv6 addresses with 2nd 16bit-word filled in. The APIs are for manipulating kernel internal structure. Programs that use these APIs have to be prepared about differences in kernels anyway.
fa: دیمِن‌های مسیرگزینی و برنامه‌های پیکربندی، مانند man:route6d[8] و man:ifconfig[8]، نیاز خواهند داشت تا فهرست محدودهٔ "تعبیه شده" را دستکاری کنند. این برنامه‌ها سوکت‌های مسیرگزینی و ioctl ها (مانند SIOCGIFADDR_IN6) را استفاده می‌کنند و رابط‌ برنامه‌نویسی کاربردیِ هسته نشانی‌های IPv6 را با کلمهٔ ۱۶ بیتی دوم برمی‌گرداند. رابط‌‌های برنامه‌نویسی کاربردی برای دستکاری ساختار داخلی هسته هستند. برنامه‌هایی که از این API ها استفاده می‌کنند باید برای تفاوت‌هایی که در هسته وجود دارند خود را آماده کنند.

source: Some of the userland tools support extended numeric IPv6 syntax, as documented in [.filename]#draft-ietf-ipngwg-scopedaddr-format-00.txt#. You can specify outgoing link, by using name of the outgoing interface like "fe80::1%ne0". This way you will be able to specify link-local scoped address without much trouble.
fa: برخی ابزارهای محیط کاربری از نحو عددیِ توسعه‌یافتهٔ IPv6 پشتیبانی می‌کنند، که در [.filename]#draft-ietf-ipngwg-scopedaddr-format-00.txt# مستندسازی شده است. می‌توانید با استفاده از یک رابط بیرونی مانند "fe80::1%ne0" پیوند بیرونی را مشخص کنید. بدین ترتیب می‌توانید نشانی محدود‌شدهٔ link-local را بدون دردسر تعیین کنید.

source: To use this extension in your program, you will need to use man:getaddrinfo[3], and man:getnameinfo[3] with NI_WITHSCOPEID. The implementation currently assumes 1-to-1 relationship between a link and an interface, which is stronger than what specs say.
fa: برای استفاده از این پسوند در برنامهٔ خود، لازم است از man:getaddrinfo[3] و man:getnameinfo[3] به‌همراه NI_WITHSCOPEID استفاده کنید. پیاده‌سازی در حال حاضر رابطهٔ ۱-به-۱ را بین یک پیوند و یک رابط در نظر می‌گیرد، که قوی‌تر از آن چیزی است که مشخصات می‌گویند.

source: Plug and Play
fa: اتصال و اجرا کردن

source: Most of the IPv6 stateless address autoconfiguration is implemented in the kernel. Neighbor Discovery functions are implemented in the kernel as a whole. Router Advertisement (RA) input for hosts is implemented in the kernel. Router Solicitation (RS) output for endhosts, RS input for routers, and RA output for routers are implemented in the userland.
fa: بیشتر پیکربندی‌ خودکارِ (autoconfiguration) نشانیِ بی‌حالت در IPv6 در هسته پیاده‌سازی شده است. توابع کشف همسایه به‌عنوان یک کل در هسته پیاده‌سازی شده‌اند. ورودی اعلان مسیریاب (RA) برای میزبان‌ها در هسته پیاده‌سازی شده است. خروجی درخواست مسیریاب (RS) برای میزبان‌های نهایی، ورودی RS برای مسیریاب‌ها، و خروجی RA برای مسیریاب‌هایی در محیط کاربری پیاده‌سازی شده‌اند.

source: Assignment of link-local, and special addresses
fa: تخصیص link-local، و نشانی‌های ویژه

source: IPv6 link-local address is generated from IEEE802 address (Ethernet MAC address). Each of interface is assigned an IPv6 link-local address automatically, when the interface becomes up (IFF_UP). Also, direct route for the link-local address is added to routing table.
fa: نشانی link-local در IPv6 توسط نشانی IEEE802 ایجاد شده است (نشانی مک Ethernet). زمانی‌که رابط بالا می‌آید (IFF_UP)، هر رابط به‌طور خودکار به یک نشانی link-local تخصیص داده می‌شود. همچنین، مسیر مستقیم برای نشانی link-local به جدول مسیرگزینی اضافه شده است.

source: Here is an output of netstat command:
fa: این یک خروجی از دستور netstat است:

source: Interfaces that has no IEEE802 address (pseudo interfaces like tunnel interfaces, or ppp interfaces) will borrow IEEE802 address from other interfaces, such as Ethernet interfaces, whenever possible. If there is no IEEE802 hardware attached, a last resort pseudo-random value, MD5(hostname), will be used as source of link-local address. If it is not suitable for your usage, you will need to configure the link-local address manually.
fa: رابط‌هایی که نشانی IEEE802 را دارا نیستند (شبه رابط‌هایی چون رابط‌های تونل، یا ppp) نشانی IEEE802 را در صورت امکان از سایر رابط‌ها قرض می‌گیرند، مانند رابط‌های Ethernet. اگر هیچ سخت‌افزار IEEE802 متصل نباشد، یک مقدار شبه تصادفی به‌عنوان آخرین گزینه، MD5(hostname)، به‌عنوان منبعِ نشانیِ link-local به‌کار گرفته می‌شود. چنانچه برای مصرف شما مناسب نبود، لازم است تا نشانی link-local را دستی پیکربندی کنید.

source: If an interface is not capable of handling IPv6 (such as lack of multicast support), link-local address will not be assigned to that interface. See section 2 for details.
fa: اگر یک رابط از عهدهٔ رسیدگی به IPv6 بر نیاید (مانند عدم پشتیبانی از مالتی‌کست)، نشانی link-local به آن رابط تخصیص داده نمی‌شود. برای جزئیات بیشتر بنگرید به بخش دوم.

source: Each interface joins the solicited multicast address and the link-local all-nodes multicast addresses (e.g., fe80::1:ff01:6317 and ff02::1, respectively, on the link the interface is attached). In addition to a link-local address, the loopback address (::1) will be assigned to the loopback interface. Also, ::1/128 and ff01::/32 are automatically added to routing table, and loopback interface joins node-local multicast group ff01::1.
fa: هر رابط به نشانی مالتی‌کست درخواست شده و نشانی‌های مالتی‌کستِ link-local all-nodes می‌پیوندد (برای مثال، fe80::1:ff01:6317 و ff02::1، به‌ترتیب، در پیوندی که رابط بدان متصل شده است). علاوه‌بر نشانی link-local، نشانی‌های loopback مثل (::1) به رابط loopback تخصیص داده می‌شود. همچنین، ::1/128 و ff01::/32 به‌طور خودکار به جدول مسیریابی اضافه می‌شوند، و رابط loopback به گروه ff01::1 مولتیکست node-local می‌پیوندد.

source: Stateless address autoconfiguration on Hosts
fa: پیکربندی خودکار نشانی بی‌حالت در میزبان‌ها

source: In IPv6 specification, nodes are separated into two categories: _routers_ and _hosts_. Routers forward packets addressed to others, hosts does not forward the packets. net.inet6.ip6.forwarding defines whether this node is router or host (router if it is 1, host if it is 0).
fa: در مشخصات IPv6، گره‌ها به دو دسته تقسیم شده‌اند: _مسیریاب‌ها_ و _میزبان‌ها_. مسیریاب‌ها بسته‌های خطاب شده به دیگران را ارسال می‌کنند، میزبان‌ها بسته‌ها را ارسال نمی‌کنند. net.inet6.ip6.forwarding مسیریاب یا میزبان بودن این گره را معین می‌کند (1 برای مسیریاب، 0 برای میزبان).

source: When a host hears Router Advertisement from the router, a host may autoconfigure itself by stateless address autoconfiguration. This behavior can be controlled by net.inet6.ip6.accept_rtadv (host autoconfigures itself if it is set to 1). By autoconfiguration, network address prefix for the receiving interface (usually global address prefix) is added. Default route is also configured. Routers periodically generate Router Advertisement packets. To request an adjacent router to generate RA packet, a host can transmit Router Solicitation. To generate a RS packet at any time, use the _rtsol_ command. man:rtsold[8] daemon is also available. man:rtsold[8] generates Router Solicitation whenever necessary, and it works great for nomadic usage (notebooks/laptops). If one wishes to ignore Router Advertisements, use sysctl to set net.inet6.ip6.accept_rtadv to 0.
fa: هنگامی‌که یک میزبان اعلان مسیریاب را از مسیریاب می‌شنود، میزبان ممکن است خود را توسط پیکربندیِ خودکارِ نشانیِ بی‌حالت به‌طور خودکار پیکربندی کند. این رفتار را می‌توان با net.inet6.ip6.accept_rtadv کنترل کرد (میزبان چنانچه بر روی 1 تنظیم شده باشد خود را به‌طور خودکار پیکربندی می‌کند). با پیکربندی خودکار، پیشوند نشانی شبکه برای رابط دریافت‌کننده (معمولاً پیشوند نشانی جهانی) اضافه می‌شود. مسیر پیش‌فرض نیز پیکربندی می‌شود. مسیریاب‌ها بسته‌های اعلان مسیریاب (RA) را متناوباً تولید می‌کنند. برای آنکه از یک مسیریاب مجاور درخواست کنیم تا بستهٔ RA را تولید کند، یک میزبان می‌تواند درخواست مسیریاب (RS) را انتقال دهد. به‌منظور تولید یک بستهٔ RS در هر زمان، از دستور _rtsol_ استفاده کنید. دیمِنِ man:rtsold[8] نیز موجود است. man:rtsold[8] می‌تواند درخواست مسیریاب را هر زمان که لازم بود تولید کند، و برای استفادهٔ متحرک (نوت‌بوک‌ها/لپ تاپ‌ها) مناسب است. اگر کسی بخواهد اعلان مسیریاب را نادیده بگیرد، می‌تواند از sysctl استفاده کند تا net.inet6.ip6.accept_rtadv را روی 0 تنظیم کند.

source: To generate Router Advertisement from a router, use the man:rtadvd[8] daemon.
fa: جهت ایجاد اعلان مسیریاب توسط یک مسیریاب، از دیمِن man:rtadvd[8] استفاده کنید.

source: Note that, IPv6 specification assumes the following items, and nonconforming cases are left unspecified:
fa: توجه داشته باشید، مشخصات IPv6 موارد پیش رو را در نظر می‌گیرد، و موارد ناسازگار نامعین باقی می‌مانند:

source: Only hosts will listen to router advertisements
fa: تنها میزبان‌ها به اعلان‌های مسیریاب گوش می‌دهند

source: Hosts have single network interface (except loopback)
fa: میزبان‌ها یک رابط شبکهٔ واحد دارند (به‌جز loopback)

source: Therefore, this is unwise to enable net.inet6.ip6.accept_rtadv on routers, or multi-interface host. A misconfigured node can behave strange (nonconforming configuration allowed for those who would like to do some experiments).
fa: از این رو، فعال کردن net.inet6.ip6.accept_rtadv در مسیریاب‌ها یا میزبان چند‌رابطی عاقلانه نیست. گره‌ای که درست پیکربندی نشده باشد ممکن است به طرز عجیبی رفتار کند (پیکربندی ناسازگار برای کسانی‌که مایل به انجام چندین آزمایش هستند مجاز است).
