Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/jail/_index.po
Languages: es

source: The Jail Subsystem
es: El Subsistema de Jails

source: Chapter 4. The Jail Subsystem
es: Chapter 4. El Subsistema de Jails

source: On most UNIX(R) systems, `root` has omnipotent power. This promotes insecurity. If an attacker gained `root` on a system, he would have every function at his fingertips. In FreeBSD there are sysctls which dilute the power of `root`, in order to minimize the damage caused by an attacker. Specifically, one of these functions is called `secure levels`. Similarly, another function which is present from FreeBSD 4.0 and onward, is a utility called man:jail[8]. Jail chroots an environment and sets certain restrictions on processes which are forked within the jail. For example, a jailed process cannot affect processes outside the jail, utilize certain system calls, or inflict any damage on the host environment.
es: En la mayoría de sistemas UNIX(R), `root` tiene un poder omnipotente. Esto promueve la inseguridad. Si un atacante obtiene acceso `root` en un sistema, tendría cualquier función disponible. En FreeBSD hay sysctls que diluyen el poder de `root`, para minimizar el daño ocasionado por un atacante. Específicamente, una de estas funciones se llama `secure levels`. De forma similar, otra función que está presente a partir de FreeBSD 4.0, es una utilidad llamada man:jail[8]. Los jails crean un chroot para un entorno y establecen ciertas restricciones en los procesos que son creados dentro del jail. Por ejemplo, un proceso en un jail no puede afectar a procesos que estén fuera del jail, utilizar ciertas llamadas al sistem, o infligir algún tipo de daño en el entorno anfitrión.

source: Jail is becoming the new security model. People are running potentially vulnerable servers such as Apache, BIND, and sendmail within jails, so that if an attacker gains `root` within the jail, it is only an annoyance, and not a devastation. This article mainly focuses on the internals (source code) of jail. For information on how to set up a jail see the extref:{handbook}[handbook entry on jails, jails].
es: Los jails se están convirtiendo en el nuevo modelo de seguridad. La gente está corriendo servidores potencialmente vulnerables como Apache, BIND, y sendmail dentro de jails, de forma que si un atacante obtiene acceso `root` dentro del jail, sólo es una molestia, y no una devastación. Este artículo se centra principalmente en las interioridades (código fuente) de los jails. Para información sobre cómo configurar un jail lee la extref:{handbook}[entrada sobre jails en el manual, jails].

source: Architecture
es: Arquitectura

source: Jail consists of two realms: the userland program, man:jail[8], and the code implemented within the kernel: the man:jail[2] system call and associated restrictions. I will be discussing the userland program and then how jail is implemented within the kernel.
es: Un jail consiste en dos partes: el programa de usuario, man:jail[8], y el código implementado en el núcleo: la llamada al sistema man:jail[2] y las restricciones asociadas. Discutiré el programa de usuario y cómo están los jails implementados dentro del núcleo.

source: Userland Code
es: Código de Usuario

source: The source for the userland jail is located in [.filename]#/usr/src/usr.sbin/jail#, consisting of one file, [.filename]#jail.c#. The program takes these arguments: the path of the jail, hostname, IP address, and the command to be executed.
es: El código fuente de la parte de usuario del jail se encuentra en [.filename]#/usr/src/usr.sbin/jail#, y consisten en un fichero, [.filename]#jail.c#. El programa acepta estos argumentos: la ruta al jail, el nombre del host, la dirección IP, y el comando que se va a ejecutar.

source: Data Structures
es: Estructuras de Datos

source: In [.filename]#jail.c#, the first thing I would note is the declaration of an important structure `struct jail j;` which was included from [.filename]#/usr/include/sys/jail.h#.
es: En [.filename]#jail.c#, la primera cosa a tener en cuenta es la declaración de una estructura importante `struct jail j;` que se incluye desde [.filename]#/usr/include/sys/jail.h#.

source: The definition of the `jail` structure is:
es: La definición de la estructura `jail` es:

source: As you can see, there is an entry for each of the arguments passed to the man:jail[8] program, and indeed, they are set during its execution.
es: Como puedes ver, hay una entrada por cada argumento pasado al programa man:jail[8], y de hecho, son establecidas durante su ejecución.

source: Networking
es: Redes

source: One of the arguments passed to the man:jail[8] program is an IP address with which the jail can be accessed over the network. man:jail[8] translates the IP address given into host byte order and then stores it in `j` (the `jail` structure).
es: Uno de los argumentos pasados al programa man:jail[8] es una dirección IP con la cual se puede acceder al jail desde la red. man:jail[8] traduces la dirección IP data a orden de bytes de host y después la almacena en `j` (la estructura `jail`).

source: The man:inet_aton[3] function "interprets the specified character string as an Internet address, placing the address into the structure provided." The `ip_number` member in the `jail` structure is set only when the IP address placed onto the `in` structure by man:inet_aton[3] is translated into host byte order by man:ntohl[3].
es: La función man:inet_aton[4] "interpreta la cadena de caracteres especificada como una dirección de Internet, guardando la dirección en la estructura proporcionada". El miembro `ip_number` en la estructura `jail` sólo se establece cuando la dirección IP guardada en la estructura `in`por parte de man:inet_aton[3] es traducida a orden de byte de host por man:ntohl[3].

source: Jailing the Process
es: Enjaulando el Proceso

source: Finally, the userland program jails the process. Jail now becomes an imprisoned process itself and then executes the command given using man:execv[3].
es: Por último, el programa de espacio de usuario enjaula el proceso. El jail se convierte en un proceso enjaulado también y luego ejecuta el comando dado utilizando man:execv[3].

source: As you can see, the `jail()` function is called, and its argument is the `jail` structure which has been filled with the arguments given to the program. Finally, the program you specify is executed. I will now discuss how jail is implemented within the kernel.
es: Como puedes ver, se llama a la función `jail()`, y su argumento es la estructura `jail` que se ha rellenado con los argumentos pasados al programa. Por último, se ejecuta el programa que has especificado. Ahora discutiré cómo se implementa un jail en el núcleo.

source: Kernel Space
es: Espacio del Núcleo

source: We will now be looking at the file [.filename]#/usr/src/sys/kern/kern_jail.c#. This is the file where the man:jail[2] system call, appropriate sysctls, and networking functions are defined.
es: Ahora echaremos un vistazo a [.filename]#/usr/src/sys/kern/kern_jail.c#. Este es el fichero donde se definen la llamada al sistema man:jail[2], las sysctls apropiadas, y las funciones de red.

source: In [.filename]#kern_jail.c#, the following sysctls are defined:
es: En [.filename]#kern_jail.c#, se definen las siguientes sysctls:

source: Each of these sysctls can be accessed by the user through the man:sysctl[8] program. Throughout the kernel, these specific sysctls are recognized by their name. For example, the name of the first sysctl is `security.jail.set_hostname_allowed`.
es: Se puede acceder a cada una de estas sysctls mediante el programa man:sysctl[8]. En el núcleo, estas sysctls específicas son reconocidas por su nombre. Por ejemplo, el nombre de la primera sysctl es `security.jail.set_hostname_allowed`.

source: man:jail[2] System Call
es: La Llamada al Sistema man:jail[2]

source: Like all system calls, the man:jail[2] system call takes two arguments, `struct thread *td` and `struct jail_args *uap`. `td` is a pointer to the `thread` structure which describes the calling thread. In this context, `uap` is a pointer to the structure in which a pointer to the `jail` structure passed by the userland [.filename]#jail.c# is contained. When I described the userland program before, you saw that the man:jail[2] system call was given a `jail` structure as its own argument.
es: Como todas las llamadas al sistema, la llamada al sistema man:jail[2] acepta dos argumentos, `struct thread *td` y `struct jail_args *uap`. `td` es un puntero a la estructura `thread` que describe al hilo llamante. En este contexto, `uap` es un puntero a la estructura que un puntero a la estructura `jail` pasada por [.filename]#jail.c# desde espacio de usuario. Cuando antes describí el programa de usuario, viste que se pasaba una estructura `jail`como argumento la llamada al sistema man:jail[2].

source: Therefore, `uap->jail` can be used to access the `jail` structure which was passed to the system call. Next, the system call copies the `jail` structure into kernel space using the man:copyin[9] function. man:copyin[9] takes three arguments: the address of the data which is to be copied into kernel space, `uap->jail`, where to store it, `j` and the size of the storage. The `jail` structure pointed by `uap->jail` is copied into kernel space and is stored in another `jail` structure, `j`.
es: Por lo tanto, se puede usar `uap->jail` para acceder a la estructura `jail` que se le ha pasado a la llamada al sistema. Después la llamada al sistema copia la estructura `jail` al espacio del núcleo usando la función man:copyin[9]. man:copyin[9] acepta tres argumentos: la dirección del dato que se va a copiar a espacio del núcleo, `uap->jail`, dónde almacenarlo, `j` y el tamaño del almacenamiento. La estructura `jail` a la que apunta `uap->jail` se copia al espacio del núcleo y se almacena en otra estructura `jail`, `j`.

source: There is another important structure defined in [.filename]#jail.h#. It is the `prison` structure. The `prison` structure is used exclusively within kernel space. Here is the definition of the `prison` structure.
es: En [.filename]#jail.h# hay definida otra estructura importante. Es la estructura `prison`. La estructura `prison` se usa exclusivamente en espacio del núcleo. Aquí está la definición de la estructura `prison`.

source: The man:jail[2] system call then allocates memory for a `prison` structure and copies data between the `jail` and `prison` structure.
es: Después la llamada al sistema man:jail[2] reserva memoria para una estructura `prison` y copia los datos entre la estructura `jail` y la estructura `prison`.

source: Next, we will discuss another important system call man:jail_attach[2], which implements the function to put a process into the jail.
es: Después, discutiremos otra llamada al sistema importante, man:jail_attach[2], que implementa la función de introducir un proceso en el jail.

source: This system call makes the changes that can distinguish a jailed process from those unjailed ones. To understand what man:jail_attach[2] does for us, certain background information is needed.
es: Esta llamada al sistema hace los cambios que permiten distinguir entre un proceso que esté dentro de un jail y otro que no lo esté. Para entender lo que man:jail_attach[2] hace por nosotros, se necesita cierta información previa.

source: On FreeBSD, each kernel visible thread is identified by its `thread` structure, while the processes are described by their `proc` structures. You can find the definitions of the `thread` and `proc` structure in [.filename]#/usr/include/sys/proc.h#. For example, the `td` argument in any system call is actually a pointer to the calling thread's `thread` structure, as stated before. The `td_proc` member in the `thread` structure pointed by `td` is a pointer to the `proc` structure which represents the process that contains the thread represented by `td`. The `proc` structure contains members which can describe the owner's identity(`p_ucred`), the process resource limits(`p_limit`), and so on. In the `ucred` structure pointed by `p_ucred` member in the `proc` structure, there is a pointer to the `prison` structure(`cr_prison`).
es: En FreeBSD, cada hilo visible por el núcleo se identifica por su estructura `thread`, mientras que los procesos se describen mediante sus estructuras `proc`. Puedes encontrar las definiciones de las estructuras `thread` y `proc` en [.filename]#/usr/include/sys/proc.h#. Por ejemplo, el argumento `td` en cualquier llamada al sistema es en realidad un puntero a la estructura `thread` del hilo llamante, como se ha mencionado antes. El miembro `td_proc` en la estructura `thread` apuntada por `td` es un puntero a la estructura `proc` que representa el proceso que contiene el hilo representado por `td`. La estructura `proc` contiene miembros que pueden describir la identidad del propietario (`p_ucred`), los límites de recursos del proceso (`p_limit`), y demás. En la estructura `ucred` apuntada por el miembro `p_ucred` en la estructura `proc`, hay un puntero a la estructura `prison` (`cr_prison`).

source: In [.filename]#kern_jail.c#, the function `jail()` then calls function `jail_attach()` with a given `jid`. And `jail_attach()` calls function `change_root()` to change the root directory of the calling process. The `jail_attach()` then creates a new `ucred` structure, and attaches the newly created `ucred` structure to the calling process after it has successfully attached the `prison` structure to the `ucred` structure. From then on, the calling process is recognized as jailed. When the kernel routine `jailed()` is called in the kernel with the newly created `ucred` structure as its argument, it returns 1 to tell that the credential is connected with a jail. The public ancestor process of all the process forked within the jail, is the process which runs man:jail[8], as it calls the man:jail[2] system call. When a program is executed through man:execve[2], it inherits the jailed property of its parent's `ucred` structure, therefore it has a jailed `ucred` structure.
es: En [.filename]#kern_jail.c#, la función `jail()` llama a la función `jail_attach()` con un `jid` dado. Y `jail_attach()` llama a la función `change_root()` para cambiar el directorio raíz del proceso llamante. Después `jail_attach()` crea una nueva estructura `ucred`, y adjunta la nueva estructura `ucred` al proceso llamante después de que se haya adjuntado de forma exitosa la estructura `prison` a la estructura `ucred`. A partir de este momento, se reconoce que el proceso llamante está dentro de un jail. Cuando se llama a la rutina del núcleo `jailed()` con una estructura `ucred` de nueva creación como argumento, devuelve 1 para indicar que la credencial está conectada con un jail. El proceso ascendiente público de todos los procesos creados dentro de un jail, es el proceso que ejecuta man:jail[8], ya que invoca a la llamada al sistema man:jail[2]. Cuando se ejecuta un programa mediante man:execve[2], hereda la propiedad jailed de la estructura `ucred` de su padre, por lo tanto tiene una estrucutra `ucred`.

source: When a process is forked from its parent process, the man:fork[2] system call uses `crhold()` to maintain the credential for the newly forked process. It inherently keep the newly forked child's credential consistent with its parent, so the child process is also jailed.
es: Cuando un proceso se bifurca (fork) de uno de sus padres, la llamada al sistema man:fork[2] utiliza `crhold()` para mantener la credencial para el nuevo proceso creado. Mantiene la credencial del nuevo hijo creado consistente con la de su padre, de forma que el proceso hijo también está dentro del jail.

source: Restrictions
es: Restricciones

source: Throughout the kernel there are access restrictions relating to jailed processes. Usually, these restrictions only check whether the process is jailed, and if so, returns an error. For example:
es: En todo el núcleo existen restricciones de acceso relacionadas con los procesos enjaulados. Por lo general, estas restricciones solo verifican si el proceso está enjaulado y, de ser así, devuelve un error. Por ejemplo:

source: System V IPC is based on messages. Processes can send each other these messages which tell them how to act. The functions which deal with messages are: man:msgctl[3], man:msgget[3], man:msgsnd[3] and man:msgrcv[3]. Earlier, I mentioned that there were certain sysctls you could turn on or off in order to affect the behavior of jail. One of these sysctls was `security.jail.sysvipc_allowed`. By default, this sysctl is set to 0. If it were set to 1, it would defeat the whole purpose of having a jail; privileged users from the jail would be able to affect processes outside the jailed environment. The difference between a message and a signal is that the message only consists of the signal number.
es: System V IPC está basado en mensajes. Los procesos pueden mandarse mensajes unos a otros que les dicen cómo tienen que actuar. Las funciones que tratan estos mensajes son: man:msgctl[3], man:msgget[3], man:msgsnd[3] y man:msgrcv[3]. Antes, mencioné que había ciertas sysctls que podías activar o desactivar para afectar el comportamiento del jail. Una de esas sysctls era `security.jail.sysvipc_allowed`. Por defecto, esta sysctl está a 0. Si estuviera a 1, derrotaría por completo el propósito de tener un jail; los usuarios privilegiados del jail serían capaces de afectar a procesos fuera del entorno del jail. La diferencia entre un mensaje y una señal es que el mensaje sólo consiste en el número de señal.

source: `msgget(key, msgflg)`: `msgget` returns (and possibly creates) a message descriptor that designates a message queue for use in other functions.
es: `msgget(key, msgflg)`: `msgget` devuelve (y posiblemente crea) un descriptor de mensaje que designa una cola de mensajes para usar en otras funciones.

source: `msgctl(msgid, cmd, buf)`: Using this function, a process can query the status of a message descriptor.
es: `msgctl(msgid, cmd, buf)`: Usando esta función, un proceso puede consultar el estado de un descriptor de mensaje.

source: `msgsnd(msgid, msgp, msgsz, msgflg)`: `msgsnd` sends a message to a process.
es: `msgsnd(msgid, msgp, msgsz, msgflg)`: `msgsnd` envía un mensaje a un proceso.

source: `msgrcv(msgid, msgp, msgsz, msgtyp, msgflg)`: a process receives messages using this function
es: `msgrcv(msgid, msgp, msgsz, msgtyp, msgflg)`: usando esta función un proceso recibe un mensaje

source: In each of the system calls corresponding to these functions, there is this conditional:
es: En cada una de las llamadas al sistema correspondientes a estas funciones, existe este condicional:

source: Semaphore system calls allow processes to synchronize execution by doing a set of operations atomically on a set of semaphores. Basically semaphores provide another way for processes lock resources. However, process waiting on a semaphore, that is being used, will sleep until the resources are relinquished. The following semaphore system calls are blocked inside a jail: man:semget[2], man:semctl[2] and man:semop[2].
es: Las llamadas al sistema de semáforos permiten a los procesos sincronizar su ejecución al realizar un conjunto de operaciones atómicas sobre un conjunto de semáforos. Básicamente los semáforos proporcionan a los procesos otra forma de bloquear recursos. Sin embargo, los procesos que esperan en un semáforo, que está siendo utilizado, dormirán hasta que se libere el recurso. Las siguientes llamadas al sistema de semáforos están bloqueadas dentro de un jail: man:semget[2], man:semctl[2] y man:semop[2].

source: `semctl(semid, semnum, cmd, ...)`: `semctl` does the specified `cmd` on the semaphore queue indicated by `semid`.
es: `semctl(semid, semnum, cmd, ...)`: `semctl` ejecuta el comando `cmd` en la cola de semáforo indicada mediante `semid`.

source: `semget(key, nsems, flag)`: `semget` creates an array of semaphores, corresponding to `key`.
es: `semget(key, nsems, flag)`: `semget` crea un array de semáforos, correspondientes a `key`.

source: `key and flag take on the same meaning as they do in msgget.`
es: `key y flag tienen el mismo significado que en msgget.`

source: `semop(semid, array, nops)`: `semop` performs a group of operations indicated by `array`, to the set of semaphores identified by `semid`.
es: `semop(semid, array, nops)`: `semop` ejecuta un grupo de operaciones indicado por `array`, en el conjunto de semáforos indicado por `semid`.

source: System V IPC allows for processes to share memory. Processes can communicate directly with each other by sharing parts of their virtual address space and then reading and writing data stored in the shared memory. These system calls are blocked within a jailed environment: man:shmdt[2], man:shmat[2], man:shmctl[2] and man:shmget[2].
es: System V IPC permite a los procesos compartir memoria. Los procesos se pueden comunicar directamente entre ellos compartiendo partes de su espacio de direcciones virtual y después leyendo y escribiendo datos almacenados en la memoria compartida. Estas llamadas al sistema están bloqueadas dentro de un jail: man:shmdt[2], man:shmat[2], man:shmctl[2] y man:shmget[2].

source: `shmctl(shmid, cmd, buf)`: `shmctl` does various control operations on the shared memory region identified by `shmid`.
es: `shmctl(shmid, cmd, buf)`: `shmctl` realiza varias operaciones de control en la región de memoria compartida identificada mediante `shmid`.

source: `shmget(key, size, flag)`: `shmget` accesses or creates a shared memory region of `size` bytes.
es: `shmget(key, size, flag)`: `shmget` accede o crea una región de memoria compartida de `size` bytes de tamaño.

source: `shmat(shmid, addr, flag)`: `shmat` attaches a shared memory region identified by `shmid` to the address space of a process.
es: `shmat(shmid, addr, flag)`: `shmat` adjunta al espacio de direcciones de un proceso una región de memoria compartida identificada mediante `shmid`.

source: `shmdt(addr)`: `shmdt` detaches the shared memory region previously attached at `addr`.
es: `shmdt(addr)`: `shmdt` elimina una región de memoria compartida previamente adjuntada en `addr`.

source: Jail treats the man:socket[2] system call and related lower-level socket functions in a special manner. In order to determine whether a certain socket is allowed to be created, it first checks to see if the sysctl `security.jail.socket_unixiproute_only` is set. If set, sockets are only allowed to be created if the family specified is either `PF_LOCAL`, `PF_INET` or `PF_ROUTE`. Otherwise, it returns an error.
es: Los jail tratan la llamada al sistema man:socket[2] y otras funciones de bajo nivel relacionadas de una forma especial. Para determinar si se permite crear un cierto socket, lo primero es comprobar si la sysctl `security.jail.socket_unixiproute_only` está activada. Si lo está, sólo se permite crear sockets si la familia especificada es `PF_LOCAL`, `PF_INET` o `PF_ROUTE`. De lo contrario, devuelve un error.

source: Berkeley Packet Filter
es: Filtro de Paquetes Berkeley

source: The Berkeley Packet Filter provides a raw interface to data link layers in a protocol independent fashion. BPF is now controlled by the man:devfs[8] whether it can be used in a jailed environment.
es: El Filtro de Paquetes de Berkeley proporciona una interfaz en crudo a las capas de enlaces de datos mediante un protocolo independiente. BPF está controlado por man:devfs[8] si se puede usar dentro de un jail.

source: Protocols
es: Protocolos
