Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/jail/_index.po
Languages: es

source: There are certain protocols which are very common, such as TCP, UDP, IP and ICMP. IP and ICMP are on the same level: the network layer 2. There are certain precautions which are taken in order to prevent a jailed process from binding a protocol to a certain address only if the `nam` parameter is set. `nam` is a pointer to a `sockaddr` structure, which describes the address on which to bind the service. A more exact definition is that `sockaddr` "may be used as a template for referring to the identifying tag and length of each address". In the function `in_pcbbind_setup()`, `sin` is a pointer to a `sockaddr_in` structure, which contains the port, address, length and domain family of the socket which is to be bound. Basically, this disallows any processes from jail to be able to specify the address that does not belong to the jail in which the calling process exists.
es: Hay ciertos protocolos que son muy comunes, como TCP, UDP, IP e ICMP. IP e ICMP están en el mismo nivel: la capa de red 2. Hay ciertas precauciones que se toman para evitar que un proceso encerrado vincule un protocolo a una determinada dirección solo si el `nam` el parámetro está configurado. `nam` es un puntero a una estructura `sockaddr`, que describe la dirección a la que enlazar el servicio. Una definición más exacta es que `sockaddr` "se puede utilizar como plantilla para hacer referencia a la etiqueta de identificación y la longitud de cada dirección ". En la función `in_pcbbind_setup()`, `sin`es un puntero a una estructura `sockaddr_in`, que contiene el puerto, la dirección, la longitud y la familia de dominio del socket que se va a vincular. Básicamente, esto no permite que un proceso dentro de un `jail` especifique una dirección que no pertenece al `jail` en el que está encerrado el proceso llamante.

source: You might be wondering what function `prison_ip()` does. `prison_ip()` is given three arguments, a pointer to the credential(represented by `cred`), any flags, and an IP address. It returns 1 if the IP address does NOT belong to the jail or 0 otherwise. As you can see from the code, if it is indeed an IP address not belonging to the jail, the protocol is not allowed to bind to that address.
es: Puedes estar preguntándonte qué es lo que hace la función `prison_ip()`. `prison_ip()` recibe tres argumentos, un puntero a la credencial (representado por `cred`), unos flags, y una dirección IP. Devuelve 1 si la dirección IP NO pertenece al jail o 0 en caso contrario. Como puedes ver en el código, si la dirección IP no pertenece al jail, no se permite al protocolo enlazarse a esa dirección.

source: Filesystem
es: Sistema de archivos

source: Even `root` users within the jail are not allowed to unset or modify any file flags, such as immutable, append-only, and undeleteable flags, if the securelevel is greater than 0.
es: Ni siquiera a los usuarios `root` de un jail se les permite cambiar ningún flag de fichero, como el flag de sólo lectura, sólo añadir, y flags de no borrado, si el securelevel es mayor que 0.
