Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/pkg-files/_index.po
Languages: pt_br

source: Tricks about the pkg-* files
pt_br: Truques sobre os arquivos pkg-*

source: Chapter 9. pkg-*
pt_br: Capítulo 9. pkg-*

source: There are some tricks we have not mentioned yet about the [.filename]#pkg-*# files that come in handy sometimes.
pt_br: Há alguns truques que ainda não mencionamos sobre os arquivos [.filename]#pkg-*# que às vezes são úteis.

source: To display a message when the package is installed, place the message in [.filename]#pkg-message#. This capability is often useful to display additional installation steps to be taken after a `pkg install` or `pkg upgrade`.
pt_br: Para exibir uma mensagem quando o pacote for instalado, coloque a mensagem em [.filename]#pkg-message#. Esse recurso geralmente é útil para exibir etapas adicionais de instalação a serem tomadas após um `pkg install` ou `pkg upgrade`.

source: [.filename]#pkg-message# must contain only information that is _vital_ to setup and operation on FreeBSD, and that is unique to the port in question.
pt_br: [.filename]#pkg-message# deve conter apenas informações que sejam _vitais_ para configuração e operação no FreeBSD, e que sejam exclusivas do port em questão.

source: Setup information should only be shown on initial install. Upgrade instructions should be shown only when upgrading from the relevant version.
pt_br: As informações de configuração devem ser mostradas apenas na instalação inicial. As instruções de atualização devem ser exibidas apenas ao atualizar a versão relevante.

source: Do not surround the messages with either whitespace or lines of symbols (like `----------`, `**********`, or `==========`). Leave the formatting to man:pkg[8].
pt_br: Não cerque as mensagens com espaços em branco ou linhas de símbolos (como `----------`, `**********` ou `============`). Deixe a formatação para man:pkg[8].

source: Committers have blanket approval to constrain existing messages to install or upgrade ranges using the UCL format specifications.
pt_br: Os committers têm aprovação geral para restringir as mensagens existentes a instalar ou atualizar intervalos usando as especificações do formato UCL.

source: Please be sure to refer to the proper tools for handling services.
pt_br: Certifique-se de consultar as ferramentas adequadas para serviços de manuseio.

source: Use `service name start` to start a service rather than using `/usr/local/etc/rc.d/name start`
pt_br: Use `service name start` para iniciar um serviço em vez de usar `/usr/local/etc/rc.d/name start`

source: Use `sysrc name_enable=YES` to change options in rc.conf
pt_br: Use `sysrc name_enable=YES` para alterar as opções no rc.conf

source: pkg-message supports two formats:
pt_br: pkg-message suporta dois formatos:

source: A regular plain text file. Its message is only displayed on install.
pt_br: Um arquivo normal de texto sem formatação. Sua mensagem só é exibida na instalação.

source: If the file starts with "`[`" then it is considered to be a UCL file. The UCL format is described on https://github.com/vstakhov/libucl[libucl's GitHub page].
pt_br: Se o arquivo começar com "`[`", ele será considerado um arquivo UCL. O formato UCL está descrito na https://github.com/vstakhov/libucl[libucl[página da libucl no GitHub].

source: Do not add an entry for [.filename]#pkg-message# in [.filename]#pkg-plist#.
pt_br: Não adicione uma entrada para [.filename]#pkg-message# em [.filename]#pkg-plist#.

source: UCL in pkg-message
pt_br: UCL em pkg-message

source: The format is the following. It should be an array of objects. The objects themselves can have these keywords:
pt_br: O formato é o seguinte. Deve ser uma matriz de objetos. Os objetos em si podem ter essas palavras-chave:

source: The actual message to be displayed. This keyword is mandatory.
pt_br: A mensagem real a ser exibida. Essa palavra-chave é obrigatória.

source: When the message should be displayed.
pt_br: Quando a mensagem deve ser exibida.

source: Only if `type` is `upgrade`. Display if upgrading from a version strictly lower than the version specified.
pt_br: Somente se `type` for `upgrade`. Exibir se estiver atualizando de uma versão estritamente inferior à versão especificada.

source: Only if `type` is `upgrade`. Display if upgrading from a version strictly greater than the version specified.
pt_br: Somente se `type` for `upgrade`. Exibir se estiver atualizando de uma versão estritamente maior do que a versão especificada.

source: The `maximum_version` and `minimum_version` keywords can be combined.
pt_br: As palavras-chave `maximum_version` e `minimum_version` podem ser combinadas.

source: The `type` keyword can have three values:
pt_br: A palavra-chave `type` pode ter três valores:

source: The message should only be displayed when the package is installed.
pt_br: A mensagem só deve ser exibida quando o pacote é instalado.

source: The message should only be displayed when the package is removed.
pt_br: A mensagem só deve ser exibida quando o pacote é removido.

source: the message should only be displayed during an upgrade of the package..
pt_br: a mensagem só deve ser exibida durante uma atualização do pacote.

source: To preserve the compatibility with non UCL [.filename]#pkg-message# files, the first line of a UCL [.filename]#pkg-message# _MUST be_ a single "`[`", and the last line _MUST be_ a single "`]`".
pt_br: Para preservar a compatibilidade com arquivos não UCL [.filename]#pkg-message#, a primeira linha de uma UCL [.filename]#pkg-message# _DEVE ser_ um único "`[`" e a última linha _DEVE ser_ um único "`]`".

source: UCL Short Strings
pt_br: Strings curtas UCL

source: The message is delimited by double quotes `"`, this is used for simple single line strings:
pt_br: A mensagem é delimitada por aspas duplas `"`, usadas para sequências simples de linha única:

source: [ { type: install message: "Simple message" } ]
pt_br: [ { type: install message: "Mensagem simples" } ]

source: UCL Multiline Strings
pt_br: UCL Multilinha

source: [ { type: install message: <<EOM Simple message EOM } ]
pt_br: [ { type: install message: <<EOM Mensagem simples EOM } ]

source: Display a Message on Install/Deinstall
pt_br: Exibir uma Mensagem na Instalação/Desinstalação

source: When a message only needs to be displayed on installation or uninstallation, set the type:
pt_br: Quando uma mensagem precisa ser exibida apenas na instalação ou na desinstalação, defina o tipo:

source: [ { type: remove message: "package being removed." } { type: install, message: "package being installed."} ]
pt_br: [ { type: remove message: "pacote sendo removido." } { type: install, message: "pacote sendo instalado."} ]

source: Display a Message on Upgrade
pt_br: Exibir uma Mensagem na Atualização

source: When a port is upgraded, the message displayed can be even more tailored to the port's needs.
pt_br: Quando um port é atualizado, a mensagem exibida pode ser ainda mais adaptada às necessidades do port.

source: [ { type: upgrade message: "Package is being upgraded." } { type: upgrade maximum_version: "1.0" message: "Upgrading from before 1.0 need to do this." } { type: upgrade minimum_version: "1.0" message: "Upgrading from after 1.0 should do that." } { type: upgrade maximum_version: "3.0" minimum_version: "1.0" message: "Upgrading from > 1.0 and < 3.0 remove that file." } ]
pt_br: [ { type: upgrade message: "O pacote está sendo atualizado." } { type: upgrade maximum_version: "1.0" message: "A atualização anterior à 1.0 precisa fazer isso." } { type: upgrade minimum_version: "1.0" message: "A atualização após 1.0 deve fazer isso." } { type: upgrade maximum_version: "3.0" minimum_version: "1.0" message: "Atualizar de > 1.0 e < 3.0 remove esse arquivo." } ]

source: When displaying a message on upgrade, it is important to limit when it is being shown to the user. Most of the time it is by using `maximum_version` to limit its usage to upgrades from before a certain version when something specific needs to be done.
pt_br: Ao exibir uma mensagem na atualização, é importante limitar quando ela está sendo exibida ao usuário. Na maioria das vezes, é usando `maximum_version` para limitar seu uso a atualizações anteriores a uma determinada versão, quando algo específico precisa ser feito.

source: pkg-install, pkg-pre-install, and pkg-post-install
pt_br: pkg-install, pkg-pre-install e pkg-post-install

source: If the port needs to execute commands when the binary package is installed with `pkg add` or `pkg install`, use [.filename]#pkg-install#. It is run twice by `pkg`, the first time as `${SH} pkg-install ${PKGNAME} PRE-INSTALL` before the package is installed, and the second time as `${SH} pkg-install ${PKGNAME} POST-INSTALL` after it has been installed. `$2` can be tested to determine which mode the script is being run in. The `PKG_PREFIX` environment variable is set to the package installation directory.
pt_br: Se o port precisar executar comandos quando o pacote binário for instalado com `pkg add` ou `pkg install`, use [.filename]#pkg-install#. Ele é executado duas vezes por `pkg`, a primeira vez como `${SH} pkg-install ${PKGNAME} PRE-INSTALL` antes da instalação do pacote e a segunda vez como `${SH} pkg-install ${PKGNAME} PÓS-INSTALL` após a instalação. `$2` pode ser testado para determinar em qual modo o script está sendo executado. A variável de ambiente `PKG_PREFIX` é definida para o diretório de instalação do pacote.

source: If using [.filename]#pkg-pre-install# or [.filename]#pkg-post-install# instead, the script is run only once (before or after installing the package), with the single argument `${PKGNAME}`. Using [.filename]#pkg-pre-install.lua# or [.filename]#pkg-post-install.lua# will run a lua script instead of a shell script. Lua scripts run by `pkg` provide some extensions and a few restrictions, both explained in man:pkg-lua-script[5].
pt_br: Se estiver usando [.filename]#pkg-pre-install# ou [.filename]#pkg-post-install#, o script será executado somente uma vez (antes ou depois da instalação do pacote), com o único argumento `${PKGNAME} `. Usar [.filename]#pkg-pre-install.lua# ou [.filename]#pkg-post-install.lua# executará um script lua em vez de um script shell. Os scripts Lua executados por `pkg` fornecem algumas extensões e algumas restrições, ambas explicadas em man:pkg-lua-script[5].

source: Using [.filename]#pkg-pre-install# (or [.filename]#pkg-pre-install.lua#) and [.filename]#pkg-post-install# (or [.filename]#pkg-post-install.lua#) is preferred to using [.filename]#pkg-install#.
pt_br: É preferível usar [.filename]#pkg-pre-install# (ou [.filename]#pkg-pre-install.lua#) e [.filename]#pkg-post-install# (ou [.filename]#pkg-post-install.lua#) do que usar [.filename]#pkg-install#.

source: These scripts are automatically added to the packing list.
pt_br: Esses scripts são adicionados automaticamente à lista de embalagem.

source: These scripts are here to simplify package configuration after installation. They _must not_ be abused to start services, stop services, or run any other commands that will modify the currently running system.
pt_br: Esses scripts estão aqui para simplificar a configuração do pacote após a instalação. Eles _não_ devem ser abusados para iniciar serviços, interromper serviços ou executar qualquer outro comando que modifique o sistema em execução no momento.

source: pkg-deinstall, pkg-pre-deinstall, and pkg-post-deinstall
pt_br: pkg-deinstall, pkg-pre-deinstall e pkg-post-deinstall

source: These scripts execute when a package is removed.
pt_br: Esses scripts são executados quando um pacote é removido.

source: The [.filename]#pkg-deinstall# script is run twice by `pkg delete`. The first time as `${SH} pkg-deinstall ${PKGNAME} DEINSTALL` before the port is de-installed and the second time as `${SH} pkg-deinstall ${PKGNAME} POST-DEINSTALL` after the port has been de-installed. `$2` can be tested to determine which mode the script is being run in. The `PKG_PREFIX` environment variable is set to the package installation directory.
pt_br: O script [.filename]#pkg-deinstall# é executado duas vezes por `pkg delete`. A primeira vez como `${SH} pkg-deinstall ${PKGNAME} DEINSTALL` antes da desinstalação do port e a segunda vez como `${SH} pkg-deinstall ${PKGNAME} POST-DEINSTALL` após a desinstalação do port. `$2` pode ser testado para determinar em qual modo o script está sendo executado. A variável de ambiente `PKG_PREFIX` é definida para o diretório de instalação do pacote.

source: If using [.filename]#pkg-pre-deinstall# or [.filename]#pkg-post-deinstall# instead, the script is run only once (before or after deinstalling the package), with the single argument `${PKGNAME}`. Using [.filename]#pkg-pre-deinstall.lua# or [.filename]#pkg-post-deinstall.lua# will run a lua script instead of a shell script. Lua scripts run by `pkg` provide some extensions and a few restrictions, both explained in man:pkg-lua-script[5].
pt_br: Se estiver usando[.filename]#pkg-pre-deinstall# ou [.filename]#pkg-post-deinstall#, o script será executado somente uma vez (antes ou depois da desinstalação do pacote), com o único argumento `${PKGNAME} `. Usar [.filename]#pkg-pre-deinstall.lua# ou [.filename]#pkg-post-deinstall.lua# executará um script lua em vez de um script shell. Os scripts Lua executados por `pkg` fornecem algumas extensões e algumas restrições, ambas explicadas em man:pkg-lua-script[5].

source: Using [.filename]#pkg-pre-deinstall# (or [.filename]#pkg-pre-deinstall.lua#) and [.filename]#pkg-post-deinstall# (or [.filename]#pkg-post-deinstall.lua#) is preferred to using [.filename]#pkg-deinstall#.
pt_br: É preferível usar [.filename] #pkg-pre-deinstall# (ou [.filename]#pkg-pre-deinstall.lua#) e [.filename]#pkg-post-deinstall# (ou [.filename]#pkg-post-deinstall.lua#) do que usar [.filename]#pkg-deinstall#.

source: These scripts are here to simplify cleanup after package deinstallation. They _must not_ be abused to start services, stop services, or run any other commands that will modify the currently running system.
pt_br: Esses scripts estão aqui para simplificar a limpeza após a desinstalação do pacote. Eles _não_ devem ser abusados para iniciar serviços, interromper serviços ou executar qualquer outro comando que modifique o sistema em execução no momento.

source: Changing the Names of pkg-*
pt_br: Alterando os Nomes de pkg-*

source: All the names of [.filename]#pkg-\*# are defined using variables that can be changed in the [.filename]#Makefile# if needed. This is especially useful when sharing the same [.filename]#pkg-*# files among several ports or when it is necessary to write to one of these files. See crossref:porting-dads[porting-wrkdir,writing to places other than `WRKDIR`] for why it is a bad idea to write directly into the directory containing the [.filename]#pkg-*# files.
pt_br: Todos os nomes de [.filename]#pkg-\*# são definidos usando variáveis que podem ser alteradas no [.filename]#Makefile#, se necessário. Isso é especialmente útil ao compartilhar os mesmos arquivos [.filename]#pkg-*# entre várias portas ou quando é necessário gravar em um desses arquivos. Consulte crossref:porting-dads[porting-wrkdir,escrevendo em lugares diferentes de `WRKDIR`] para saber por que é uma má ideia escrever diretamente no diretório que contém os arquivos [.filename] #pkg-*#.

source: Here is a list of variable names and their default values. (`PKGDIR` defaults to `${MASTERDIR}`.)
pt_br: Aqui está uma lista de nomes de variáveis e seus valores padrão. (O padrão de `PKGDIR` é `${MASTERDIR}`.)

source: Variable
pt_br: Variável

source: Default value
pt_br: Valor padrão

source: Making Use of `SUB_FILES` and `SUB_LIST`
pt_br: Fazendo uso de `SUB_FILES` e `SUB_LIST`

source: `SUB_FILES` and `SUB_LIST` are useful for dynamic values in port files, such as the installation `PREFIX` in [.filename]#pkg-message#.
pt_br: `SUB_FILES` e `SUB_LIST` são úteis para valores dinâmicos em arquivos de porta, como a instalação `PREFIX` em [.filename]#pkg-message#.

source: `SUB_FILES` specifies a list of files to be automatically modified. Each [.filename]#file# in the `SUB_FILES` list must have a corresponding [.filename]#file.in# present in `FILESDIR`. A modified version will be created as [.filename]#${WRKDIR}/file#. Files defined as a value of `USE_RC_SUBR` are automatically added to `SUB_FILES`. For the files [.filename]#pkg-message#, [.filename]#pkg-install#, and [.filename]#pkg-deinstall#, the corresponding Makefile variable is automatically set to point to the processed version.
pt_br: `SUB_FILES` especifica uma lista de arquivos a serem modificados automaticamente. Cada [.filename]#file# na lista `SUB_FILES` deve ter um [.filename] #file .in# correspondente presente em `FILESDIR`. Uma versão modificada será criada como [.filename]#${WRKDIR}/file#. Arquivos definidos como um valor de `USE_RC_SUBR` são adicionados automaticamente a `SUB_FILES`. Para os arquivos [.filename]#pkg-message#, [.filename]#pkg-install# e [.filename]#pkg-deinstall#, a variável Makefile correspondente é automaticamente definida para apontar para a versão processada.

source: `SUB_LIST` is a list of `VAR=VALUE` pairs. For each pair, `%%VAR%%` will be replaced with `VALUE` in each file listed in `SUB_FILES`. Several common pairs are automatically defined: `PREFIX`, `LOCALBASE`, `DATADIR`, `DOCSDIR`, `EXAMPLESDIR`, `WWWDIR`, and `ETCDIR`. Any line beginning with `@comment` followed by a space, will be deleted from resulting files after a variable substitution.
pt_br: `SUB_LIST` é uma lista de pares `VAR=VALUE`. Para cada par, `%%VAR%%` será substituído por `VALUE` em cada arquivo listado em `SUB_FILES`. Vários pares comuns são definidos automaticamente: `PREFIX`, `LOCALBASE`, `DATADIR`, `DOCSDIR`, `EXAMPLESDIR`, `WWWDIR` e `ETCDIR`. Qualquer linha que comece com `@comment` seguida por um espaço será excluída dos arquivos resultantes após uma substituição de variável.

source: This example replaces `%%ARCH%%` with the system architecture in a [.filename]#pkg-message#:
pt_br: Este exemplo substitui `%%ARCH%%` pela arquitetura do sistema em um [.filename]#pkg-message#:

source: Note that for this example, [.filename]#pkg-message.in# must exist in `FILESDIR`.
pt_br: Observe que, neste exemplo, [.filename]#pkg-message.in# deve existir em `FILESDIR`.

source: Example of a good [.filename]#pkg-message.in#:
pt_br: Exemplo de um bom [.filename]#pkg-message.in#:

source: Now it is time to configure this package. Copy %%PREFIX%%/shared/examples/putsy/%%ARCH%%.conf into your home directory as .putsy.conf and edit it.
pt_br: Agora é hora de configurar esse pacote. Copie %%PREFIX%%/shared/examples/putsy/%%ARCH%%.conf em seu diretório inicial como .putsy.conf e edite-o.
