Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/kobj/_index.po
Languages: es

source: Kernel Objects
es: Objetos del Kernel

source: Chapter 3. Kernel Objects
es: Chapter 3. Objetos del Kernel

source: Kernel Objects, or _Kobj_ provides an object-oriented C programming system for the kernel. As such the data being operated on carries the description of how to operate on it. This allows operations to be added and removed from an interface at run time and without breaking binary compatibility.
es: Los Objetos del núcleo, o _Kobj_ proporciona un sistema de programación C orientado a objetos para el kernel. Como tal, los datos con los que se opera llevan la descripción de cómo operar con ellos. Esto permite agregar y eliminar operaciones de una interfaz en tiempo de ejecución y sin romper la compatibilidad binaria.

source: Terminology
es: Terminología

source: Object
es: Objeto

source: A set of data - data structure - data allocation.
es: Un conjunto de datos - estructura de datos - asignación de datos.

source: Method
es: Método

source: An operation - function.
es: Una operación - función.

source: Class
es: Clase

source: One or more methods.
es: Uno o más métodos.

source: Interface
es: Interfaz

source: A standard set of one or more methods.
es: Un conjunto estándar de uno o más métodos.

source: Kobj Operation
es: Operación Kobj

source: Kobj works by generating descriptions of methods. Each description holds a unique id as well as a default function. The description's address is used to uniquely identify the method within a class' method table.
es: Kobj funciona generando descripciones de métodos. Cada descripción tiene una identificación única, así como una función predeterminada. La dirección de la descripción se utiliza para identificar de forma única el método dentro de la tabla de métodos de una clase.

source: A class is built by creating a method table associating one or more functions with method descriptions. Before use the class is compiled. The compilation allocates a cache and associates it with the class. A unique id is assigned to each method description within the method table of the class if not already done so by another referencing class compilation. For every method to be used a function is generated by script to qualify arguments and automatically reference the method description for a lookup. The generated function looks up the method by using the unique id associated with the method description as a hash into the cache associated with the object's class. If the method is not cached the generated function proceeds to use the class' table to find the method. If the method is found then the associated function within the class is used; otherwise, the default function associated with the method description is used.
es: Una clase se construye creando una tabla de métodos que asocia una o más funciones con descripciones de métodos. Antes de su uso, se compila la clase. La compilación asigna un caché y lo asocia con la clase. Se asigna una identificación única a cada descripción de método dentro de la tabla de métodos de la clase si no lo ha hecho ya otra compilación de clases de referencia. Para cada método que se utilizará, el script genera una función para calificar los argumentos y hacer referencia automáticamente a la descripción del método para una búsqueda. La función generada busca el método utilizando la identificación única asociada con la descripción del método como un hash en la caché asociada con la clase del objeto. Si el método no está almacenado en caché, la función generada procede a usar la tabla de la clase para encontrar el método. Si se encuentra el método, se utiliza la función asociada dentro de la clase; de lo contrario, se utiliza la función predeterminada asociada con la descripción del método.

source: These indirections can be visualized as the following:
es: Estas indirecciones se pueden visualizar de la siguiente manera:

source: Using Kobj
es: Usando Kobj

source: Structures
es: Estructuras

source: struct kobj_method
es: estructura kobj_method

source: Functions
es: Funciones

source: Headers
es: Encabezados

source: Creating an Interface Template
es: Crear una Plantilla de Interfaz

source: The first step in using Kobj is to create an Interface. Creating the interface involves creating a template that the script [.filename]#src/sys/kern/makeobjops.pl# can use to generate the header and code for the method declarations and method lookup functions.
es: El primer paso para utilizar Kobj es crear una Interfaz. Crear la interfaz implica crear una plantilla que el script [.filename]#src/sys/kern/makeobjops.pl# pueda utilizar para generar el encabezado y el código para las declaraciones de métodos y las funciones de búsqueda de métodos.

source: Within this template the following keywords are used: `#include`, `INTERFACE`, `CODE`, `EPILOG`, `HEADER`, `METHOD`, `PROLOG`, `STATICMETHOD`, and `DEFAULT`.
es: Dentro de esta plantilla se usan las siguientes palabras clave: `#include`, `INTERFACE`, `CODE`, `EPILOG`, `HEADER`, `METHOD`, `PROLOG`, `STATICMETHOD`, y `DEFAULT`.

source: The `#include` statement and what follows it is copied verbatim to the head of the generated code file.
es: La sentencia `#include` y lo que le sigue se copia de forma literal en el encabezado del fichero de código generado.

source: For example:
es: Por ejemplo:

source: The `INTERFACE` keyword is used to define the interface name. This name is concatenated with each method name as [interface name]_[method name]. Its syntax is INTERFACE [interface name];.
es: La palabra reservada `INTERFACE` se usa para definir el nombre de la interfaz. Este nombre se concatena con el nombre de cada método como [nombre de interfaz]_[nombre de método]. Su sintaxis es INTERFACE [nombre de la interfaz];.

source: The `CODE` keyword copies its arguments verbatim into the code file. Its syntax is `CODE { [whatever] };`
es: La palabra clave `CODE` copia sus argumentos de forma literal en el fichero. Su sintaxis es `CODE { [lo que sea] };`

source: The `HEADER` keyword copies its arguments verbatim into the header file. Its syntax is `HEADER { [whatever] };`
es: La palabra clave `HEADER` copia sus argumentos de forma literal en el fichero de cabecera. Si sintaxis es `HEADER { [lo que sea] };`

source: The `METHOD` keyword describes a method. Its syntax is `METHOD [return type] [method name] { [object [, arguments]] };`
es: La palabra clave `METHOD`describe un método. Su sintaxis es `METHOD [tipo devuelto] [nombre del método] { [objeto [, argumentos]] };`

source: The `DEFAULT` keyword may follow the `METHOD` keyword. It extends the `METHOD` key word to include the default function for method. The extended syntax is `METHOD [return type] [method name] { [object; [other arguments]] }DEFAULT [default function];`
es: La palabra clave `DEFAULT` puede seguir a la palabra clave `METHOD`. Extiende la palabra clave `METHOD`para incluir la función por defecto para el método. La sintaxis extendida es `METHOD [tipo devuelto] [nombre del método] { [objeto; [otros argumentos]] }DEFAULT [función por defecto];`

source: The `STATICMETHOD` keyword is used like the `METHOD` keyword except the kobj data is not at the head of the object structure so casting to kobj_t would be incorrect. Instead `STATICMETHOD` relies on the Kobj data being referenced as 'ops'. This is also useful for calling methods directly out of a class's method table.
es: La palabra clave `STATICMETHOD` se usa como la palabra clave `METHOD` excepto que los datos del kobj no están al comienzo de la estructura del objeto de modo que hacer un cast a kobj_t sería incorrecto. En su lugar `STATICMETHOD` depende de que los datos del Kobj se referencien como 'ops'. Esto también es útil para llamar métodos directamente a partir de la tabla de métodos de una clase.

source: The `PROLOG` and `EPILOG` keywords sets inserts code immediately before or directly after the `METHOD` they are attached to. This feature is used primarily for profiling situations where it's difficult to obtain the information in another way.
es: Los conjuntos de palabras clave `PROLOG` y `EPILOG` insertan código inmediatamente antes o inmediatamente después del `METHOD` al que están adjuntados. Esta característica se usa principalmente para perfilar situaciones en las que de otra forma es difícil conseguir la información.

source: Other complete examples:
es: Otros ejemplos completos:

source: Creating a Class
es: Crear una Clase

source: The second step in using Kobj is to create a class. A class consists of a name, a table of methods, and the size of objects if Kobj's object handling facilities are used. To create the class use the macro `DEFINE_CLASS()`. To create the method table create an array of kobj_method_t terminated by a NULL entry. Each non-NULL entry may be created using the macro `KOBJMETHOD()`.
es: El segundo paso para usar Kobj es crear una clase. Una clase consta de un nombre, una tabla de métodos y el tamaño de los objetos si se utilizan las funciones de manejo de objetos de Kobj. Para crear la clase usa la macro `DEFINE_CLASS()`. Para crear la tabla de métodos, crea una matriz de kobj_method_t terminada por una entrada NULL. Cada entrada que no sea NULL se puede crear usando la macro `KOBJMETHOD()`.

source: The class must be "compiled". Depending on the state of the system at the time that the class is to be initialized a statically allocated cache, "ops table" have to be used. This can be accomplished by declaring a `struct kobj_ops` and using `kobj_class_compile_static();` otherwise, `kobj_class_compile()` should be used.
es: La clase se tiene que "compilar". Dependiendo del estado del sistema en el momento en que la clase va a ser inicializada, una caché estática, "ops table", tendrá que ser usada. Esto se puede conseguir declarando un ``struct kobj_ops` y usando `kobj_class_compile_static();` de lo contrario, se debería usar `kobj_class_compile()`.

source: Creating an Object
es: Crear un Objeto

source: The third step in using Kobj involves how to define the object. Kobj object creation routines assume that Kobj data is at the head of an object. If this in not appropriate you will have to allocate the object yourself and then use `kobj_init()` on the Kobj portion of it; otherwise, you may use `kobj_create()` to allocate and initialize the Kobj portion of the object automatically. `kobj_init()` may also be used to change the class that an object uses.
es: El tercer paso para utilizar Kobj implica cómo definir el objeto. Las rutinas de creación de objetos de Kobj asumen que los datos de Kobj están al comienzo de un objeto. Si esto no es apropiado, tendrás que asignar el objeto tú mismo y luego usar `kobj_init()` en la porción de Kobj; de lo contrario, puedes usar `kobj_create()` para asignar e inicializar la parte Kobj del objeto automáticamente. `kobj_init()` también se puede usar para cambiar la clase que usa un objeto.

source: To integrate Kobj into the object you should use the macro KOBJ_FIELDS.
es: Para integrar Kobj en el objeto, debes utilizar la macro KOBJ_FIELDS.

source: For example
es: Por ejemplo

source: Calling Methods
es: Llamando a Métodos

source: The last step in using Kobj is to simply use the generated functions to use the desired method within the object's class. This is as simple as using the interface name and the method name with a few modifications. The interface name should be concatenated with the method name using a '_' between them, all in upper case.
es: El último paso para usar Kobj es simplemente usar las funciones generadas para usar el método deseado dentro de la clase del objeto. Esto es tan simple como usar el nombre de la interfaz y el nombre del método con algunas modificaciones. El nombre de la interfaz debe concatenarse con el nombre del método usando un '_' entre ellos, todo en mayúsculas.

source: For example, if the interface name was foo and the method was bar then the call would be:
es: Por ejemplo, si el nombre de la interfaz era foo y el método era bar, la llamada sería:

source: [return value = ] FOO_BAR(object [, other parameters]);
es: [valor de retorno = ] FOO_BAR(objeto [, otros parámetros]);

source: Cleaning Up
es: Limpieza

source: When an object allocated through `kobj_create()` is no longer needed `kobj_delete()` may be called on it, and when a class is no longer being used `kobj_class_free()` may be called on it.
es: Cuando un objeto creado con `kobj_create()` ya no es necesario se puede llamar `kobj_delete()` sobre él, y cuando una clase ya no se va a usar más se puede llamar `kobj_class_free()` sobre ella.
