Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/usb-device-mode/_index.po
Languages: es

source: This chapter covers the use of USB Device Mode and USB On The Go (USB OTG) in FreeBSD
es: Este capítulo cubre el uso del Modo de Dispositivo USB y USB On The Go (USB OTG) en FreeBSD

source: Part III. System Administration
es: Parte III. Administración del sistema

source: Chapter 28. USB Device Mode / USB OTG
es: Capítulo 28. Modo de dispositivo USB / USB OTG

source: USB Device Mode / USB OTG
es: Modo de dispositivo USB / USB OTG

source: Synopsis
es: Sinopsis

source: This chapter covers the use of USB Device Mode and USB On The Go (USB OTG) in FreeBSD. This includes virtual serial consoles, virtual network interfaces, and virtual USB drives.
es: Este capítulo cubre el uso del Modo de Dispositivo USB y USB On The Go (USB OTG) en FreeBSD. Esto incluye consolas seriales virtuales, interfaces de red virtuales y unidades USB virtuales.

source: When running on hardware that supports USB device mode or USB OTG, like that built into many embedded boards, the FreeBSD USB stack can run in _device mode_. Device mode makes it possible for the computer to present itself as different kinds of USB device classes, including serial ports, network adapters, and mass storage, or a combination thereof. A USB host like a laptop or desktop computer is able to access them just like physical USB devices. Device mode is sometimes called the "USB gadget mode".
es: Cuando se ejecuta en hardware que admite el modo dispositivo USB o USB OTG, como el que está integrado en muchas placas embebidas, la pila USB de FreeBSD puede funcionar en modo dispositivo. El modo dispositivo hace posible que la computadora se presente como diferentes tipos de clases de dispositivos USB, incluidos puertos serie, adaptadores de red y almacenamiento masivo, o una combinación de estos. Un host USB, como una computadora portátil o de escritorio, puede acceder a ellos de la misma manera que a los dispositivos USB físicos. El modo dispositivo a veces se denomina "modo gadget USB".

source: There are two basic ways the hardware can provide the device mode functionality: with a separate "client port", which only supports the device mode, and with a USB OTG port, which can provide both device and host mode. For USB OTG ports, the USB stack switches between host-side and device-side automatically, depending on what is connected to the port. Connecting a USB device like a memory stick to the port causes FreeBSD to switch to host mode. Connecting a USB host like a computer causes FreeBSD to switch to device mode. Single purpose "client ports" always work in device mode.
es: Existen dos formas básicas en que el hardware puede proporcionar la funcionalidad del modo dispositivo: con un "puerto cliente" separado, que solo admite el modo dispositivo, y con un puerto USB OTG, que puede proporcionar tanto el modo dispositivo como el modo host. Para los puertos USB OTG, la pila USB cambia automáticamente entre el lado del host y el lado del dispositivo, dependiendo de lo que esté conectado al puerto. Conectar un dispositivo USB como una memoria USB al puerto hace que FreeBSD cambie al modo host. Conectar un host USB como una computadora hace que FreeBSD cambie al modo dispositivo. Los "puertos cliente" de un solo propósito siempre funcionan en modo dispositivo.

source: What FreeBSD presents to the USB host depends on the `hw.usb.template` sysctl. Some templates provide a single device, such as a serial terminal; others provide multiple ones, which can all be used at the same time. An example is the template 10, which provides a mass storage device, a serial console, and a network interface. See man:usb_template[4] for the list of available values.
es: Lo que FreeBSD presenta al anfitrión USB depende del sysctl hw.usb.template. Algunas plantillas proporcionan un único dispositivo, como una terminal serie; otras proporcionan varios, que pueden utilizarse todos al mismo tiempo. Un ejemplo es la plantilla 10, que proporciona un dispositivo de almacenamiento masivo, una consola serie y una interfaz de red. Consulte man:usb_template para obtener la lista de los valores disponibles.

source: Note that in some cases, depending on the hardware and the hosts operating system, for the host to notice the configuration change, it must be either physically disconnected and reconnected, or forced to rescan the USB bus in a system-specific way. When FreeBSD is running on the host, man:usbconfig[8] `reset` can be used. This also must be done after loading [.filename]#usb_template.ko# if the USB host was already connected to the USBOTG socket.
es: Tenga en cuenta que en algunos casos, dependiendo del hardware y del sistema operativo del host, para que el host note el cambio de configuración, debe estar desconectado físicamente y volver a conectarse, o forzado a volver a escanear el bus USB de una manera específica del sistema. Cuando FreeBSD está en ejecución en el host, se puede usar man:usbconfig[8] `reset`. Esto también debe hacerse después de cargar [.filename]#usb_template.ko# si el host USB ya estaba conectado al socket USBOTG.

source: Read this chapter to learn:
es: Lea este capítulo para saber:

source: How to set up USB Device Mode functionality on FreeBSD.
es: Cómo configurar la funcionalidad del modo de dispositivo USB en FreeBSD.

source: How to configure the virtual serial port on FreeBSD.
es: Cómo configurar el puerto serie virtual en FreeBSD.

source: How to connect to the virtual serial port from various operating systems.
es: Cómo conectarse al puerto serie virtual desde varios sistemas operativos.

source: How to configure FreeBSD to provide a virtual USB network interface.
es: Cómo configurar FreeBSD para proporcionar una interfaz de red USB virtual.

source: How to configure FreeBSD to provide a virtual USB storage device.
es: Cómo configurar FreeBSD para proporcionar un dispositivo de almacenamiento USB virtual.

source: USB Virtual Serial Ports
es: Puertos Seriales Virtuales USB

source: Configuring USB Device Mode Serial Ports
es: Configuración de puertos seriales en modo dispositivo USB

source: Virtual serial port support is provided by templates number 3, 8, and 10. Note that template 3 works with Microsoft Windows 10 without the need for special drivers and INF files. Other host operating systems work with all three templates. Both man:usb_template[4] and man:umodem[4] kernel modules must be loaded.
es: El soporte para puertos seriales virtuales es proporcionado por las plantillas número 3, 8 y 10. Tenga en cuenta que la plantilla 3 funciona con Microsoft Windows 10 sin necesidad de controladores especiales ni archivos INF. Otros sistemas operativos anfitriones funcionan con las tres plantillas. Deben cargarse ambos módulos del núcleo man:usb_template[4] y man:umodem[4].

source: To enable USB device mode serial ports, add those lines to [.filename]#/etc/ttys#:
es: Para habilitar los puertos seriales en modo de dispositivo USB, agregue estas líneas a [.filename]#/etc/ttys#:

source: Then add these lines to [.filename]#/etc/devd.conf#:
es: Luego añade estas líneas a [.filename]#/etc/devd.conf#:

source: Reload the configuration if man:devd[8] is already running:
es: Recargue la configuración si man:devd[8] ya se está ejecutando:

source: Make sure the necessary modules are loaded and the correct template is set at boot by adding those lines to [.filename]#/boot/loader.conf#, creating it if it does not already exist:
es: Asegúrese de que los módulos necesarios estén cargados y que la plantilla correcta esté configurada al inicio agregando esas líneas a [.filename]#/boot/loader.conf#, creándolo si aún no existe:

source: To load the module and set the template without rebooting use:
es: Para cargar el módulo y establecer la plantilla sin reiniciar, use:

source: Connecting to USB Device Mode Serial Ports from FreeBSD
es: Conexión a puertos seriales en modo dispositivo USB desde FreeBSD

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. Use `pstat -t` on the host to list the terminal lines. Near the end of the list a USB serial port is shown, e.g. "ttyU0". To open the connection, use:
es: Para conectarse a una placa configurada para proporcionar puertos serie en modo dispositivo USB, conecte el host USB, como una computadora portátil, al puerto USB OTG o puerto cliente USB de la placa. Utilice pstat -t en el host para listar las líneas de terminal. Cerca del final de la lista se muestra un puerto serie USB, por ejemplo, "ttyU0". Para abrir la conexión, utilice:

source: After pressing the kbd:[Enter] key a few times a login prompt appears.
es: Tras pulsar la tecla kbd:[Enter] unas cuantas veces aparecerá una solicitud de inicio de sesión.

source: Connecting to USB Device Mode Serial Ports from macOS
es: Conectarse a puertos serie en modo dispositivo USB desde macOS

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. To open the connection, use:
es: Para conectarse a una placa configurada para proporcionar puertos serie en modo dispositivo USB, conecte el host USB, como una computadora portátil, al puerto USB OTG o al puerto cliente USB de la placa. Para abrir la conexión, utilice:

source: Connecting to USB Device Mode Serial Ports from Linux
es: Conectarse a puertos serie en modo dispositivo USB desde Linux

source: Connecting to USB Device Mode Serial Ports from Microsoft Windows 10
es: Conexión a puertos serie en modo dispositivo USB desde Microsoft Windows 10

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. To open a connection a serial terminal program is needed, such as PuTTY. To check the COM port name used by Windows, run Device Manager, expand "Ports (COM & LPT)". A name similar to "USB Serial Device (COM4)" appears. Run the serial terminal program of choice, for example PuTTY. In the PuTTY dialog set "Connection type" to "Serial", type the COMx obtained from Device Manager in the "Serial line" dialog box and click Open.
es: Para conectarse a una placa configurada para proporcionar puertos serie en modo dispositivo USB, conecte el host USB, como una computadora portátil, al puerto USB OTG o al puerto cliente USB de la placa. Para abrir una conexión se necesita un programa de terminal serie, como PuTTY. Para comprobar el nombre del puerto COM utilizado por Windows, ejecute el Administrador de dispositivos y expanda "Puertos (COM y LPT)". Aparecerá un nombre similar a "Dispositivo de serie USB (COM4)". Ejecute el programa de terminal serie de su elección, por ejemplo PuTTY. En el cuadro de diálogo de PuTTY, establezca el "Connection type" en "Serial", escriba el COMx obtenido del Administrador de dispositivos en el cuadro de diálogo "Serial line" y haga clic en Open.

source: USB Device Mode Network Interfaces
es: Interfaces de red en modo dispositivo USB

source: Virtual network interfaces support is provided by templates number 1, 8, and 10. Note that none of them works with Microsoft Windows. Other host operating systems work with all three templates. Both man:usb_template[4] and man:if_cdce[4] kernel modules must be loaded.
es: El soporte para interfaces de red virtuales lo proporcionan las plantillas número 1, 8 y 10. Tenga en cuenta que ninguna de ellas funciona con Microsoft Windows. Otros sistemas operativos host funcionan con las tres plantillas. Deben cargarse ambos módulos del kernel, man:usb_template[4] y man:if_cdce[4].

source: USB Virtual Storage Device
es: Dispositivo de almacenamiento virtual USB

source: The man:cfumass[4] driver is a USB device mode driver first available in FreeBSD 12.0.
es: El controlador man:cfumass[4] es un controlador de modo de dispositivo USB disponible por primera vez en FreeBSD 12.0.

source: Mass Storage target is provided by templates 0 and 10. Both man:usb_template[4] and man:cfumass[4] kernel modules must be loaded. man:cfumass[4] interfaces to the CTL subsystem, the same one that is used for iSCSI or Fibre Channel targets. On the host side, USB Mass Storage initiators can only access a single LUN, LUN 0.
es: El target de almacenamiento masivo se implementa mediante las plantillas 0 y 10. Es necesario cargar tanto el módulo del kernel man:usb_template[4] como man:cfumass[4]. El controlador man:cfumass[4] sirve de interfaz con el subsistema CTL, el mismo que se utiliza para los targets iSCSI o Fibre Channel. En el lado del host, los iniciadores de almacenamiento masivo USB solo pueden acceder a una única LUN, la LUN 0.

source: Configuring USB Mass Storage Target Using the cfumass Startup Script
es: Configuración del target de almacenamiento masivo USB mediante el script de inicio de cfumass

source: The simplest way to set up a read-only USB storage target is to use the [.filename]#cfumass# rc script. To configure it this way, copy the files to be presented to the USB host machine into the `/var/cfumass` directory, and add this line to [.filename]#/etc/rc.conf#:
es: La forma más sencilla de configurar un target de almacenamiento USB de solo lectura es utilizar el script de inicio [.filename]#cfumass#. Para configurarlo de esta manera, copie los archivos que se presentarán al equipo host USB en el directorio /var/cfumass y añada esta línea a [.filename]#/etc/rc.conf#:

source: To configure the target without restarting, run this command:
es: Para configurar el target sin reiniciar, ejecute este comando:

source: Differently from serial and network functionality, the template should not be set to 0 or 10 in [.filename]#/boot/loader.conf#. This is because the LUN must be set up before setting the template. The cfumass startup script sets the correct template number automatically when started.
es: A diferencia de las funcionalidades de serie y de red, la plantilla no debe establecerse en 0 ó 10 en [.filename]#/boot/loader.conf#. Esto se debe a que la LUN debe estar configurada antes de establecer la plantilla. El script de inicio de [.filename]#cfumass# establece automáticamente el número de plantilla correcto al ejecutarse.

source: Configuring USB Mass Storage Using Other Means
es: Configuración de almacenamiento masivo USB mediante otros métodos

source: The rest of this chapter provides detailed description of setting the target without using the cfumass rc file. This is necessary if e.g. one wants to provide a writeable LUN.
es: El resto de este capítulo ofrece una descripción detallada de cómo configurar el target sin utilizar el archivo rc de cfumass. Esto es necesario si, por ejemplo, se desea proporcionar una LUN con permisos de escritura.

source: USB Mass Storage does not require the man:ctld[8] daemon to be running, although it can be used if desired. This is different from iSCSI. Thus, there are two ways to configure the target: man:ctladm[8], or man:ctld[8]. Both require the [.filename]#cfumass.ko# kernel module to be loaded. The module can be loaded manually:
es: El almacenamiento masivo USB no requiere que el demonio man:ctld esté en ejecución, aunque se puede utilizar si se desea. Esto es diferente de iSCSI. Por tanto, existen dos formas de configurar el target: man:ctladm o man:ctld. Ambas requieren que el módulo del kernel [.filename]#cfumass.ko# esté cargado. El módulo puede cargarse manualmente:

source: If [.filename]#cfumass.ko# has not been built into the kernel, [.filename]#/boot/loader.conf# can be set to load the module at boot:
es: Si [.filename]#cfumass.ko# no se ha compilado dentro del kernel, se puede configurar [.filename]#/boot/loader.conf# para cargar el módulo al arrancar:

source: A LUN can be created without the man:ctld[8] daemon:
es: Se puede crear una LUN sin el demonio man:ctld[8]:

source: This presents the contents of the image file [.filename]#/data/target0# as a LUN to the USB host. The file must exist before executing the command. To configure the LUN at system startup, add the command to [.filename]#/etc/rc.local#.
es: El contenido del archivo de imagen [.filename]#/data/target0# se expone como una LUN ante el equipo host USB. El archivo debe existir antes de ejecutar el comando. Para que la LUN se configure automáticamente al arrancar el sistema, añada el comando al archivo [.filename]#/etc/rc.local#.

source: man:ctld[8] can also be used to manage LUNs. Create [.filename]#/etc/ctl.conf#, add a line to [.filename]#/etc/rc.conf# to make sure man:ctld[8] is automatically started at boot, and then start the daemon.
es: man:ctld[8] también se puede utilizar para gestionar LUNs. Cree el archivo [.filename]#/etc/ctl.conf#, añada una línea a [.filename]#/etc/rc.conf# para asegurarse de que man:ctld[8] se inicie automáticamente al arrancar y, a continuación, inicie el demonio.

source: This is an example of a simple [.filename]#/etc/ctl.conf# configuration file. Refer to man:ctl.conf[5] for a complete description of the options.
es: Este es un ejemplo de un archivo de configuración [.filename]#/etc/ctl.conf# simple. Consulte man:ctl.conf[5] para obtener una descripción completa de las opciones.

source: The example creates a single target with a single LUN. The `naa.50015178f369f092` is a device identifier composed of 32 random hexadecimal digits. The `path` line defines the full path to a file or zvol backing the LUN. That file must exist before starting man:ctld[8]. The second line is optional and specifies the size of the LUN.
es: Este ejemplo crea un único target con un solo LUN. El naa.50015178f369f092 es un identificador de dispositivo compuesto por 32 dígitos hexadecimales aleatorios. La línea path define la ruta completa a un archivo o zvol que sirve de respaldo al LUN. Ese archivo debe existir antes de iniciar man:ctld[8]. La segunda línea es opcional y especifica el tamaño del LUN.

source: To make sure the man:ctld[8] daemon is started at boot, add this line to [.filename]#/etc/rc.conf#:
es: Para asegurar que el demonio man:ctld[8] se inicie en el arranque, añada esta línea a [.filename]#/etc/rc.conf#:

source: To start man:ctld[8] now, run this command:
es: Para iniciar man:ctld[8] ahora, ejecute este comando:

source: As the man:ctld[8] daemon is started, it reads [.filename]#/etc/ctl.conf#. If this file is edited after the daemon starts, reload the changes so they take effect immediately:
es: A medida que el demonio man:ctld[8] se inicia, este lee [.filename]#/etc/ctl.conf#. Si este archivo se edita después de que el demonio se haya iniciado, recargue los cambios para que surtan efecto inmediatamente:
