Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/pr-guidelines/_index.po
Languages: es

source: The email addresses that Bugzilla listens to for incoming PRs have been published as part of the FreeBSD documentation, have been announced and listed on the web-site. This means that spammers found them.
es: Las direcciones de correo electrónico que utiliza Bugzilla para recibir los PR se han publicado como parte de la documentación de FreeBSD, se han anunciado y se enumeran en el sitio web. Esto significa que los spammers las han encontrado.

source: Whenever you close one of these PRs, please do the following:
es: Cuando cierres uno de estos PRs, haz lo siguiente:

source: Set Responsible to `nobody@FreeBSD.org`.
es: Establece Responsible a `nobody@FreeBSD.org`.

source: Set State to `Issue Resolved`.
es: Cambia el estado a `Issue Resolved`.

source: Setting the category to `junk` makes it obvious that there is no useful content within the PR, and helps to reduce the clutter within the main categories.
es: Establecer la categoría a `junk` hace evidente que no hay contenido útil en el PR y ayuda a reducir la basura en las categorías principales.

source: Further Reading
es: Otras Lecturas

source: This is a list of resources relevant to the proper writing and processing of problem reports. It is by no means complete.
es: Esta es una lista de recursos relacionados con la escritura y procesamiento adecuados de informes de error. No pretende ser una lista completa.
