Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/pr-guidelines/_index.po
Languages: es

source: These guidelines describe recommended handling practices for FreeBSD Problem Reports (PRs).
es: Estas directrices describen las prácticas recomendadas para los Informes de Problemas de FreeBSD (Problem Reports o PRs).

source: Abstract
es: Resumen

source: Introduction
es: Introducción

source: Bugzilla is an issue management system used by the FreeBSD Project. As accurate tracking of outstanding software defects is important to FreeBSD's quality, the correct use of the software is essential to the forward progress of the Project.
es: Bugzilla es un sistema de gestión de errores utilizado por el proyecto FreeBSD. Un seguimiento preciso de los defectos de software pendientes es importante para la calidad de FreeBSD, el uso correcto del software es esencial para el progreso del Proyecto.

source: Access to Bugzilla is available to the entire FreeBSD community. In order to maintain consistency within the database and provide a consistent user experience, guidelines have been established covering common aspects of bug management such as presenting followup, handling close requests, and so forth.
es: El acceso a Bugzilla está disponible para toda la comunidad de FreeBSD. Con el fin de mantener la coherencia dentro de la base de datos y proporcionar una experiencia de usuario consistente, se han establecido pautas que cubren aspectos comunes de la gestión de errores, como la presentación del seguimiento, el manejo de las solicitudes de cierre, etc.

source: Problem Report Life-cycle
es: Ciclo de Vida de un Informe de Problemas

source: The Reporter submits a bug report on the website. The bug is in the `Needs Triage` state.
es: El Usuario (Reporter) envía un informe de error a través del sitio web. El bug se encuentra en el estado `Needs Triage`.

source: Jane Random BugBuster confirms that the bug report has sufficient information to be reproducible. If not, she goes back and forth with the reporter to obtain the needed information. At this point the bug is set to the `Open` state.
es: Jane Random BugBuster confirma que el error reportado tiene la suficiente información para ser reproducido. Si no, se interactuará repetidamente con el usuario para obtener la información necesaria. En este punto, el error se establece en el estado `Open`.

source: Joe has a brief exchange with the originator (making sure it all goes into the audit trail) and determines the cause of the problem.
es: Joe tiene una breve conversación con el usuario que ha enviado el informe del problema (asegurándose de que todo queda registrado) y determina la causa.

source: A couple of iterations later, both Joe and the originator are satisfied with the patch, and Joe commits it to `-CURRENT` (or directly to `-STABLE` if the problem does not exist in `-CURRENT`), making sure to reference the Problem Report in his commit log (and credit the originator if they submitted all or part of the patch) and, if appropriate, start an MFC countdown. The bug is set to the `Needs MFC` state.
es: Un par de iteraciones más tarde, tanto Joe como el usuario que lo ha creado están satisfechos con el parche, y Joe realiza el commit a `-CURRENT` (o directamente a `-STABLE` si el problema no existe en `-CURRENT`), asegurándose de hacer referencia al informe de problemas en su mensaje de commit (y dando el crédito al usuario si envió todo o parte del parche) y, si corresponde, iniciará una cuenta atrás de MFC. El error cambia al estado `Needs MFC`.

source: Problem Report State
es: Estados de los Informes de Problemas

source: A small example on when to change PR state
es: Un pequeño ejemplo de cuándo cambiar el estado de un PR

source: When a PR has been worked on and the developer(s) responsible feel comfortable about the fix, they will submit a followup to the PR and change its state to "feedback". At this point, the originator should evaluate the fix in their context and respond indicating whether the defect has indeed been remedied.
es: Cuando un PR ha sido tratado y el desarrollador/es se sienta cómodo con la solución, enviará un follow-up al PR y cambiará su estado a "feedback". En este punto, el usuario que lo ha creado debe evaluar la solución en su contexto y responder indicando si el defecto ha sido solucionado.

source: A Problem Report may be in one of the following states:
es: Un Informe de Problema puede estar en uno de los siguientes estados:

source: open
es: Abierto

source: Initial state; the problem has been pointed out and it needs reviewing.
es: Estado inicial; el problema ha sido indicado y necesita ser revisado.

source: analyzed
es: Analizado

source: The problem has been reviewed and a solution is being sought.
es: El problema ha sido revisado y se está buscando una solución.

source: feedback
es: Comentarios

source: Further work requires additional information from the originator or the community; possibly information regarding the proposed solution.
es: Hay que realizar trabajo adicional que requiere información adicional del usuario o de la comunidad; posiblemente información sobre la solución propuesta.

source: patched
es: Parcheado

source: A patch has been committed, but something (MFC, or maybe confirmation from originator) is still pending.
es: Se ha realizado un commit con el parche, pero aún hay algo pendiente (MFC, o tal vez confirmación del usuario que lo creó).

source: suspended
es: Suspendido

source: The problem is not being worked on, due to lack of information or resources. This is a prime candidate for somebody who is looking for a project to take on. If the problem cannot be solved at all, it will be closed, rather than suspended. The documentation project uses suspended for wish-list items that entail a significant amount of work which no one currently has time for.
es: No se está trabajando en el problema debido a la falta de información o recursos. Este es un candidato excelente para alguien que está buscando un proyecto. Si el problema no se puede resolver, se cerrará, en lugar de suspenderse. El proyecto de documentación utiliza suspendido para los elementos de la lista de deseos que implican una cantidad significativa de trabajo para el cual nadie tiene tiempo actualmente.

source: closed
es: Cerrado

source: A problem report is closed when any changes have been integrated, documented, and tested, or when fixing the problem is abandoned.
es: Un informe de problemas se cierra cuando se han integrado, documentado y probado los cambios, o cuando se abandona la solución del problema.

source: The "patched" state is directly related to feedback, so you may go directly to "closed" state if the originator cannot test the patch, and it works in your own testing.
es: El estado "patched" está directamente relacionado con el feedback, por lo que puede ir directamente al estado "closed" si el usuario que lo creó no puede probar el parche y funciona en sus propias pruebas.

source: Types of Problem Reports
es: Tipos de Informes de Problemas

source: While handling problem reports, either as a developer who has direct access to the Problem Reports database or as a contributor who browses the database and submits followups with patches, comments, suggestions or change requests, you will come across several different types of PRs.
es: Al tratar con informes de problemas, ya sea como desarrollador que tiene acceso directo a la Base de Datos de Informes de Problemas o como colaborador que navega por la base de datos y envía follow-ups con parches, comentarios, sugerencias o solicitudes de cambio, encontrará varios tipos diferentes de PRs.

source: crossref:pr-guidelines[pr-unassigned, Unassigned PRs]
es: crossref:pr-guidelines[pr-unassigned, PRs no asignados]

source: crossref:pr-guidelines[pr-assigned, Assigned PRs]
es: crossref:pr-guidelines[pr-unassigned, PRs asignados]

source: crossref:pr-guidelines[pr-dups, Duplicate PRs]
es: crossref:pr-guidelines[pr-unassigned, PRs duplicados]

source: crossref:pr-guidelines[pr-stale, Stale PRs]
es: crossref:pr-guidelines[pr-unassigned, PRs estancados]

source: crossref:pr-guidelines[pr-misfiled-notpr, Non-Bug PRs]
es: crossref:pr-guidelines[pr-unassigned, PR no errores]

source: The following sections describe what each different type of PRs is used for, when a PR belongs to one of these types, and what treatment each different type receives.
es: Las siguientes secciones describen para qué se usa cada tipo de PRs, cuándo un PR pertenece a uno de estos tipos y qué tratamiento recibe cada tipo.

source: Unassigned PRs
es: PRs sin asignar

source: When PRs arrive, they are initially assigned to a generic (placeholder) assignee. These are always prepended with `freebsd-`. The exact value for this default depends on the category; in most cases, it corresponds to a specific FreeBSD mailing list. Here is the current list, with the most common ones listed first:
es: Cuando los PRs llegan, inicialmente se asignan a un responsable genérico (placeholder). Estos siempre tienen el prefijo `freebsd-`. El valor exacto para este patrón depende de la categoría; en la mayoría de los casos, corresponde a una lista de correo específica de FreeBSD. Aquí está la lista actual, con las más comunes primero:

source: Default Assignees - most common
es: Asignaciones Predeterminadas — más comunes

source: Type
es: Tipo

source: Categories
es: Categorías

source: Default Assignee
es: Asignaciones Predeterminadas

source: base system
es: sistema base

source: architecture-specific
es: específico de una arquitectura

source: ports collection
es: colección de ports

source: documentation shipped with the system
es: documentación entregada con el sistema

source: FreeBSD web pages (not including docs)
es: Páginas web de FreeBSD (sin incluir docs)

source: Default Assignees - other
es: Asignaciones Predeterminadas — otros

source: advocacy efforts
es: esfuerzos de apoyo y promoción

source: Java Virtual Machine(TM) problems
es: Problemas de la Máquina Virtual de Java (Java Virtual Machine(TM))

source: standards compliance
es: cumplimiento de estándares

source: threading libraries
es: librerías de hilos

source: man:usb[4] subsystem
es: subsistema man:usb[4]

source: Do not be surprised to find that the submitter of the PR has assigned it to the wrong category. If you fix the category, do not forget to fix the assignment as well. (In particular, our submitters seem to have a hard time understanding that just because their problem manifested on an i386 system, that it might be generic to all of FreeBSD, and thus be more appropriate for `kern`. The converse is also true, of course.)
es: No te sorprendas al descubrir que el usuario responsable del PR lo ha asignado a la categoría incorrecta. Si corriges la categoría, no te olvides de corregir también la asignación. (En particular, nuestros usuarios parecen tener dificultades para entender que aunque su problema ocurra en un sistema i386, podría ser genérico de todo FreeBSD y, por lo tanto, ser más adecuado para `kern`. Lo contrario también es cierto, por supuesto.)

source: Certain PRs may be reassigned away from these generic assignees by anyone. There are several types of assignees: specialized mailing lists; mail aliases (used for certain limited-interest items); and individuals.
es: Algunos PRs pueden ser reasignados lejos de estos responsables genéricos por cualquier persona. Hay varios tipos de responsables: listas de correo especializadas; alias de correo (utilizados para ciertos casos de interés limitado); y los individuos particulares.

source: For assignees which are mailing lists, please use the long form when making the assignment (e.g., `freebsd-foo` instead of `foo`); this will avoid duplicate emails sent to the mailing list.
es: Para los responsables que son listas de correo, utiliza la designación larga al realizar la asignación (por ejemplo, `freebsd-foo` en lugar de `foo`); esto evitará los mensajes de correo electrónico duplicados enviados a la lista de correo.

source: Since the list of individuals who have volunteered to be the default assignee for certain types of PRs changes so often, it is much more suitable for https://wiki.freebsd.org/AssigningPRs[the FreeBSD wiki].
es: Como la lista de individuos que se han prestado voluntarios a ser los responsables por defecto de varios tipos de PR cambia tan frecuentemente, es mucho más útil para https://wiki.freebsd.org/AssigningPRs[la wiki de FreeBSD].

source: Here is a sample list of such entities; it is probably not complete.
es: Aquí hay un listado de ejemplo de dichas entidades; probablemente no esté completo.

source: Common Assignees - base system
es: Responsables Comunes — sistema base

source: Suggested Category
es: Categoría Sugerida

source: Suggested Assignee
es: Responsable Sugerido

source: Assignee Type
es: Tipo de Responsable

source: problem specific to the ARM(R) architecture
es: problema específico de la arquitectura ARM(R)

source: mailing list
es: lista de correo

source: problem specific to the MIPS(R) architecture
es: problema específico de la arquitectura MIPS(R)

source: problem specific to the PowerPC(R) architecture
es: problema específico de la arquitectura PowerPC(R)

source: problem with Advanced Configuration and Power Management (man:acpi[4])
es: problema con la Configuración Avanzada y Gestión de Energía (man:acpi[4])

source: problem with embedded or small-footprint FreeBSD systems (e.g., NanoBSD/PicoBSD/FreeBSD-arm)
es: problema con sistemas FreeBSD embebidos o de pocos recursos (por ejemplo, NanoBSD/PicoBSD/FreeBSD-arm)

source: problem with FireWire(R) drivers
es: problema con controladores de FireWire(R)

source: problem with the filesystem code
es: problema con el código del sistema de ficheros

source: problem with the man:geom[4] subsystem
es: problema con el subsistema man:geom[4]

source: problem with the man:ipfw[4] subsystem
es: problema con el subsistema man:ipfw[4]

source: man:jail[8] subsystem
es: subsistema man:jail[8]

source: problem with Linux(R) or SVR4 emulation
es: problema con la emulación Linux(R) o SVR4

source: problem with the networking stack
es: problema con la pila de red

source: problem with the man:pf[4] subsystem
es: problema con el subsistema man:pf[4]

source: problem with the man:scsi[4] subsystem
es: problema con el subsistema man:scsi[4]

source: problem with the man:sound[4] subsystem
es: problema con el subsistema man:sound[4]

source: problems with the man:wlan[4] subsystem and wireless drivers
es: problema con el subsistema man:wlan[4] y controladores wireless

source: problem with man:sysinstall[8] or man:bsdinstall[8]
es: problema con man:sysinstall[8] o man:bsdinstall[8]

source: problem with the system startup scripts (man:rc[8])
es: problema con los scripts de arranque del sistema (man:rc[8])

source: problem with VIMAGE or VNET functionality and related code
es: problema relacionado con el código y la funcionalidad de VIMAGE o VNET

source: problem with Xen emulation
es: problema con la emulación Xen

source: Common Assignees - Ports Collection
es: Responsables Comunes — Colección de Ports

source: problem with the ports framework (__not__ with an individual port!)
es: problema con la infraestructura de ports (__no__ con un port individual)

source: port which is maintained by apache@FreeBSD.org
es: port que está mantenido por apache@FreeBSD.org

source: port which is maintained by autotools@FreeBSD.org
es: port que es mantenido por autotools@FreeBSD.org

source: port which is maintained by doceng@FreeBSD.org
es: port que es mantenido por doceng@FreeBSD.org

source: port which is maintained by eclipse@FreeBSD.org
es: port que es mantenido por eclipse@FreeBSD.org

source: port which is maintained by gecko@FreeBSD.org
es: port que es mantenido por gecko@FreeBSD.org

source: port which is maintained by gnome@FreeBSD.org
es: port que es mantenido por gnome@FreeBSD.org

source: port which is maintained by hamradio@FreeBSD.org
es: port que es mantenido por hamradio@FreeBSD.org

source: port which is maintained by haskell@FreeBSD.org
es: port que es mantenido por haskell@FreeBSD.org

source: port which is maintained by java@FreeBSD.org
es: port que es mantenido por java@FreeBSD.org

source: port which is maintained by kde@FreeBSD.org
es: port que es mantenido por kde@FreeBSD.org

source: port which is maintained by mono@FreeBSD.org
es: port que es mantenido por mono@FreeBSD.org

source: port which is maintained by office@FreeBSD.org
es: port que es mantenido por office@FreeBSD.org

source: port which is maintained by perl@FreeBSD.org
es: port que es mantenido por perl@FreeBSD.org

source: port which is maintained by python@FreeBSD.org
es: port que es mantenido por python@FreeBSD.org

source: port which is maintained by ruby@FreeBSD.org
es: port que es mantenido por ruby@FreeBSD.org

source: port which is maintained by secteam@FreeBSD.org
es: port que es mantenido por secteam@FreeBSD.org

source: port which is maintained by vbox@FreeBSD.org
es: port que es mantenido por vbox@FreeBSD.org

source: port which is maintained by x11@FreeBSD.org
es: port que es mantenido por x11@FreeBSD.org

source: Ports PRs which have a maintainer who is a ports committer may be reassigned by anyone (but note that not every FreeBSD committer is necessarily a ports committer, so you cannot simply go by the email address alone.)
es: Los PRs relacionados con los ports que tienen un mantenedor que es a la vez un committer de ports pueden ser reasignados por cualquiera (pero ten en cuenta que no todo committer de FreeBSD es necesariamente un committer de ports, por lo que no puedes guiarte únicamente por la dirección de correo electrónico.)

source: For other PRs, please do not reassign them to individuals (other than yourself) unless you are certain that the assignee really wants to track the PR. This will help to avoid the case where no one looks at fixing a particular problem because everyone assumes that the assignee is already working on it.
es: Para otros PRs, por favor, no los reasignes a otros individuos (otros que no seas tú mismo), a menos que estés seguro de que el responsable realmente quiere mantenerse al tanto del PR. Esto ayudará a evitar situaciones en las que nadie se dedica a solucionar un problema en particular porque todos asumen que el responsable ya está trabajando en ello.

source: Common Assignees - Other
es: Responsables Comunes — Otros

source: problem with Bugzilla https://bugs.freebsd.org/submit/[web form].
es: problema con el https://bugs.freebsd.org/submit/[formulario web] de Bugzilla.

source: Assigned PRs
es: PRs Asignados

source: If a PR has the `responsible` field set to the username of a FreeBSD developer, it means that the PR has been handed over to that particular person for further work.
es: Si un PR tiene el campo `responsible` establecido al nombre de usuario de un desarrollador de FreeBSD, significa que el PR ha sido traspasado a dicho individuo para realizar más trabajo.

source: Assigned PRs should not be touched by anyone but the assignee or bugmeister. If you have comments, submit a followup. If for some reason you think the PR should change state or be reassigned, send a message to the assignee. If the assignee does not respond within two weeks, unassign the PR and do as you please.
es: Los PRs asignados no deben ser tocados por nadie más que el responsable o el bugmeister. Si tienes comentarios, envía un follow-up. Si, por algún motivo, crees que el PR debe cambiar de estado o ser reasignado, envía un mensaje al responsable. Si el responsable no responde en dos semanas, anula la asignación del PR y haz lo que quieras.

source: Duplicate PRs
es: PRs Duplicados

source: If you find more than one PR that describe the same issue, choose the one that contains the largest amount of useful information and close the others, stating clearly the number of the superseding PR. If several PRs contain non-overlapping useful information, submit all the missing information to one in a followup, including references to the others; then close the other PRs (which are now completely superseded).
es: Si encuentras más de un PR que describe el mismo problema, elige el que contiene la mayor cantidad de información útil y cierre los demás, indicando claramente el número de PR sustituidos. Si varios PRs contienen información útil que no está repetida, envía toda la información restante en un follow-up, incluidas las referencias a los demás; luego cierra los otros PRs (que ahora han sido completamente reemplazados).

source: Stale PRs
es: PRs Obsoletos

source: A PR is considered stale if it has not been modified in more than six months. Apply the following procedure to deal with stale PRs:
es: Un PR se considera obsoleto si no ha sido modificado en más de seis meses. Aplica el siguiente procedimiento para tratar los PRs obsoletos:

source: If the PR contains sufficient detail, try to reproduce the problem in `-CURRENT` and `-STABLE`. If you succeed, submit a followup detailing your findings and try to find someone to assign it to. Set the state to "analyzed" if appropriate.
es: Si el PR contiene suficientes detalles, intenta reproducir el problema en `-CURRENT` y `-STABLE`. Si lo consigues, envía un followup detallando tus hallazgos e intenta encontrar a alguien a quien asignárselo. Cambia el estado a "analyzed" si procede.

source: If the PR describes an issue which you know is the result of a usage error (incorrect configuration or otherwise), submit a followup explaining what the originator did wrong, then close the PR with the reason "User error" or "Configuration error".
es: Si el PR describe un problema que sabes que es el resultado de un error de uso (configuración incorrecta o de otro tipo), envía un follow-up que explique qué hizo mal el usuario, luego cierra el PR con el motivo "User error" o "Configuration error".

source: If the PR describes an error which you know has been corrected in both `-CURRENT` and `-STABLE`, close it with a message stating when it was fixed in each branch.
es: Si el PR describe un error que sabes que ha sido corregido tanto en `-CURRENT` como en `-STABLE`, ciérralo con un mensaje que indique que ha sido arreglado en cada rama.

source: If the PR describes an error which you know has been corrected in `-CURRENT`, but not in `-STABLE`, try to find out when the person who corrected it is planning to MFC it, or try to find someone else (maybe yourself?) to do it. Set the state to "patched" and assign it to whomever will do the MFC.
es: Si el PR describe un error que sabes que ha sido corregido en `-CURRENT`, pero no en `-STABLE`, intenta averiguar cuándo piensa hacer el MFC la persona que lo corrigió, o intenta encontrar a alguien (¿quizás tú mismo?) para hacerlo. Cambia el estado a "patched" y asígnalo a quien vaya a hacer el MFC.

source: In other cases, ask the originator to confirm if the problem still exists in newer versions. If the originator does not reply within a month, close the PR with the notation "Feedback timeout".
es: En otros casos, solicita al usuario que confirme si el problema persiste en las versiones más nuevas. Si el usuario no responde en un mes, cierra el PR con la anotación "Feedback timeout".

source: Non-Bug PRs
es: PRs Sin Errores

source: Developers that come across PRs that look like they should have been posted to {freebsd-bugs} or some other list should close the PR, informing the submitter in a comment why this is not really a PR and where the message should be posted.
es: Los desarrolladores que se encuentran con PRs que parece que deberían haber sido enviados a la {freebsd-bugs} o alguna otra lista deberían cerrar el PR, informando al creador en un comentario que esto no es en realidad un PR y dónde se debería enviar el mensaje.
