Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/pccard/_index.po
Languages: fa

source: PC Card
fa: کارت سخت‌افزاری کامپیوتر

source: Chapter 16. PC Card
fa: فصل ۱۶. کارت سخت افزاری کامپیوتر

source: This chapter will talk about the FreeBSD mechanisms for writing a device driver for a PC Card or CardBus device. However, at present it just documents how to add a new device to an existing pccard driver.
fa: این فصل در مورد مکانیسم‌های FreeBSD برای نوشتن درایور دستگاه برای یک دستگاه PC Card یا CardBus صحبت خواهد کرد. با این حال، در حال حاضر فقط نحوه اضافه کردن یک دستگاه جدید به درایور یک PCcard موجود را مستند می‌کند.

source: Adding a Device
fa: اضافه کردن یک دستگاه

source: Device drivers know what devices they support. There is a table of supported devices in the kernel that drivers use to attach to a device.
fa: درایورهای دستگاه می‌دانند از چه دستگاه‌هایی پشتیبانی می‌کنند. جدولی از دستگاه‌های پشتیبانی‌شده در هسته وجود دارد که درایورها برای اتصال به یک دستگاه از آن استفاده می‌کنند.

source: Overview
fa: نمای کلی

source: PC Cards are identified in one of two ways, both based on the _Card Information Structure_ (CIS) stored on the card. The first method is to use numeric manufacturer and product numbers. The second method is to use the human readable strings that are also contained in the CIS. The PC Card bus uses a centralized database and some macros to facilitate a design pattern to help the driver writer match devices to his driver.
fa: کارت‌های PC به یکی از دو روش زیر شناسایی می‌شوند، که هر دو بر اساس ساختار اطلاعات کارت (CIS) ذخیره شده روی کارت هستند. روش اول استفاده از شماره‌های عددی سازنده و محصول است. روش دوم استفاده از رشته‌های قابل خواندن توسط انسان است که در CIS نیز موجود هستند. گذرگاه کارت PC از یک پایگاه داده متمرکز و برخی ماکروها برای تسهیل یک الگوی طراحی استفاده می‌کند تا به نویسنده درایور کمک کند تا دستگاه‌ها را با درایور خود مطابقت دهد.

source: Original equipment manufacturers (OEMs) often develop a reference design for a PC Card product, then sell this design to other companies to market. Those companies refine the design, market the product to their target audience or geographic area, and put their own name plate onto the card. The refinements to the physical card are typically very minor, if any changes are made at all. To strengthen their brand, these vendors place their company name in the human readable strings in the CIS space, but leave the manufacturer and product IDs unchanged.
fa: تولیدکنندگان تجهیزات اصلی (OEMها) اغلب یک طرح مرجع برای محصول کارت PC توسعه می‌دهند، سپس این طرح را به شرکت‌های دیگر برای بازاریابی می‌فروشند. این شرکت‌ها طرح را اصلاح می‌کنند، محصول را به مخاطبان هدف یا منطقه جغرافیایی خود عرضه می‌کنند و پلاک نام خود را روی کارت قرار می‌دهند. اصلاحات روی کارت فیزیکی معمولاً بسیار جزئی است، اگر تغییری ایجاد شود. این فروشندگان برای تقویت برند خود، نام شرکت خود را در رشته‌های قابل خواندن توسط انسان در فضای CIS قرار می‌دهند، اما شناسه‌های سازنده و محصول را بدون تغییر باقی می‌گذارند.

source: Due to this practice, FreeBSD drivers usually rely on numeric IDs for device identification. Using numeric IDs and a centralized database complicates adding IDs and support for cards to the system. One must carefully check to see who really made the card, especially when it appears that the vendor who made the card might already have a different manufacturer ID listed in the central database. Linksys, D-Link, and NetGear are a number of US manufacturers of LAN hardware that often sell the same design. These same designs can be sold in Japan under names such as Buffalo and Corega. Often, these devices will all have the same manufacturer and product IDs.
fa: به دلیل این رویه، درایورهای FreeBSD معمولاً برای شناسایی دستگاه به شناسه‌های عددی متکی هستند. استفاده از شناسه‌های عددی و یک پایگاه داده متمرکز، افزودن شناسه‌ها و پشتیبانی از کارت‌ها به سیستم را پیچیده می‌کند. باید با دقت بررسی کرد که چه کسی واقعاً کارت را ساخته است، به خصوص وقتی که به نظر می‌رسد فروشنده‌ای که کارت را ساخته است، ممکن است از قبل شناسه سازنده متفاوتی در پایگاه داده مرکزی داشته باشد. Linksys، D-Link و NetGear تعدادی از تولیدکنندگان سخت‌افزار LAN در ایالات متحده هستند که اغلب طرح یکسانی را می‌فروشند. همین طرح‌ها را می‌توان در ژاپن با نام‌هایی مانند Buffalo و Corega فروخت. اغلب، این دستگاه‌ها همگی شناسه سازنده و محصول یکسانی دارند.

source: The PC Card bus code keeps a central database of card information, but not which driver is associated with them, in [.filename]#/sys/dev/pccard/pccarddevs#. It also provides a set of macros that allow one to easily construct simple entries in the table the driver uses to claim devices.
fa: کد گذرگاه کارت PC یک پایگاه داده مرکزی از اطلاعات کارت را نگهداری می‌کند، اما اطلاعاتی در مورد اینکه کدام درایور با آنها مرتبط است، در [.filename]#/sys/dev/pccard/pccarddevs# ندارد. همچنین مجموعه‌ای از ماکروها را ارائه می‌دهد که به فرد اجازه می‌دهد به راحتی ورودی‌های ساده‌ای را در جدولی که درایور برای ادعای مالکیت دستگاه‌ها استفاده می‌کند، ایجاد کند.

source: Finally, some really low end devices do not contain manufacturer identification at all. These devices must be detected by matching the human readable CIS strings. While it would be nice if we did not need this method as a fallback, it is necessary for some very low end CD-ROM players and Ethernet cards. This method should generally be avoided, but a number of devices are listed in this section because they were added prior to the recognition of the OEM nature of the PC Card business. When adding new devices, prefer using the numeric method.
fa: در نهایت، برخی از دستگاه‌های بسیار ارزان‌قیمت اصلاً حاوی شناسه سازنده نیستند. این دستگاه‌ها باید با تطبیق رشته‌های CIS قابل خواندن توسط انسان شناسایی شوند. اگرچه خوب می‌شد اگر به عنوان یک جایگزین به این روش نیاز نداشتیم، اما برای برخی از پخش‌کننده‌های CD-ROM بسیار ارزان‌قیمت و کارت‌های اترنت ضروری است. به طور کلی باید از این روش اجتناب کرد، اما تعدادی از دستگاه‌ها در این بخش فهرست شده‌اند زیرا قبل از به رسمیت شناختن ماهیت OEM تجارت PC Card اضافه شده‌اند. هنگام افزودن دستگاه‌های جدید، ترجیحاً از روش عددی استفاده کنید.

source: Format of [.filename]#pccarddevs#
fa: قالب [.filename]#pccarddevs#

source: There are four sections in the [.filename]#pccarddevs# files. The first section lists the manufacturer numbers for vendors that use them. This section is sorted in numerical order. The next section has all of the products that are used by these vendors, along with their product ID numbers and a description string. The description string typically is not used (instead we set the device's description based on the human readable CIS, even if we match on the numeric version). These two sections are then repeated for devices that use the string matching method. Finally, C-style comments enclosed in `/*` and `*/` characters are allowed anywhere in the file.
fa: چهار بخش در فایل‌های ‎[.filename]#pccarddevs#‎ وجود دارد. بخش اول شماره‌های سازنده را برای فروشندگانی که از آنها استفاده می‌کنند فهرست می‌کند. این بخش به ترتیب عددی مرتب شده است. بخش بعدی شامل تمام محصولاتی است که توسط این فروشندگان استفاده می‌شوند، به همراه شماره‌های شناسه محصول آنها و یک رشته توضیحات. رشته توضیحات معمولاً استفاده نمی‌شود (در عوض، ما توضیحات دستگاه را بر اساس CIS قابل خواندن توسط انسان تنظیم می‌کنیم، حتی اگر در نسخه عددی مطابقت داشته باشیم). سپس این دو بخش برای دستگاه‌هایی که از روش تطبیق رشته استفاده می‌کنند، تکرار می‌شوند. در نهایت، کامنت‌های به سبک C که در کاراکترهای `/*` و `*/` قرار می‌گیرند، در هر کجای فایل مجاز هستند.

source: The first section of the file contains the vendor IDs. Please keep this list sorted in numeric order. Also, please coordinate changes to this file because we share it with NetBSD to help facilitate a common clearing house for this information. For example, here are the first few vendor IDs:
fa: بخش اول فایل شامل شناسه‌های فروشندگان است. لطفاً این لیست را به ترتیب عددی مرتب نگه دارید. همچنین، لطفاً تغییرات این فایل را هماهنگ کنید زیرا ما آن را با NetBSD به اشتراک می‌گذاریم تا به تسهیل یک مرکز تسویه مشترک برای این اطلاعات کمک کنیم. برای مثال، در اینجا چند شناسه فروشنده اول آمده است:

source: vendor FUJITSU 0x0004 Fujitsu Corporation vendor NETGEAR_2 0x000b Netgear vendor PANASONIC 0x0032 Matsushita Electric Industrial Co. vendor SANDISK 0x0045 Sandisk Corporation
fa: فروشنده FUJITSU 0x0004 شرکت فوجیتسو فروشنده NETGEAR_2 0x000b شرکت نت‌گیر فروشنده PANASONIC 0x0032 شرکت صنعتی الکتریکی ماتسوشیتا فروشنده SANDISK 0x0045 شرکت سندیسک

source: Chances are very good that the `NETGEAR_2` entry is really an OEM that NETGEAR purchased cards from and the author of support for those cards was unaware at the time that Netgear was using someone else's ID. These entries are fairly straightforward. The vendor keyword denotes the kind of line that this is, followed by the name of the vendor. This name will be repeated later in [.filename]#pccarddevs#, as well as used in the driver's match tables, so keep it short and a valid C identifier. A numeric ID in hex identifies the manufacturer. Do not add IDs of the form `0xffffffff` or `0xffff` because these are reserved IDs (the former is "no ID set" while the latter is sometimes seen in extremely poor quality cards to try to indicate "none"). Finally there is a string description of the company that makes the card. This string is not used in FreeBSD for anything but commentary purposes.
fa: احتمال زیادی وجود دارد که ورودی `NETGEAR_2` در واقع یک تولیدکننده اصلی (OEM) باشد که NETGEAR کارت‌ها را از آن خریداری کرده و نویسنده پشتیبانی از آن کارت‌ها در آن زمان از اینکه Netgear از شناسه شخص دیگری استفاده می‌کند، بی‌اطلاع بوده است. این ورودی‌ها نسبتاً سرراست هستند. کلمه کلیدی vendor نوع خطی را که این خط دنبال می‌کند، نشان می‌دهد و به دنبال آن نام فروشنده می‌آید. این نام بعداً در [.filename]#pccarddevs# تکرار می‌شود و همچنین در جداول تطبیق درایور استفاده می‌شود، بنابراین آن را کوتاه و یک شناسه C معتبر نگه دارید. یک شناسه عددی در هگز، سازنده را مشخص می‌کند. شناسه‌هایی به شکل `0xffffffff` یا `0xffff` اضافه نکنید زیرا این شناسه‌ها رزرو شده هستند (اولی "بدون مجموعه شناسه" است در حالی که دومی گاهی اوقات در کارت‌های با کیفیت بسیار پایین دیده می‌شود تا سعی در نشان دادن "هیچ" داشته باشد). در نهایت، یک توصیف رشته‌ای از شرکت سازنده کارت وجود دارد. این رشته در FreeBSD برای هیچ کاری جز اهداف تفسیر استفاده نمی‌شود.

source: The second section of the file contains the products. As shown in this example, the format is similar to the vendor lines:
fa: بخش دوم فایل شامل محصولات است. همانطور که در این مثال نشان داده شده است، قالب آن مشابه خطوط فروشندگان است:

source: /* Allied Telesis K.K. */ product ALLIEDTELESIS LA_PCM 0x0002 Allied Telesis LA-PCM
fa: /* Allied Telesis K.K. */ محصول ALLIEDTELESIS LA_PCM 0x0002 Allied Telesis LA-PCM

source: /* Archos */ product ARCHOS ARC_ATAPI 0x0043 MiniCD
fa: /* آرکوس */ محصول آرکوس ARC_ATAPI 0x0043 مینی‌سی‌دی

source: The `product` keyword is followed by the vendor name, repeated from above. This is followed by the product name, which is used by the driver and should be a valid C identifier, but may also start with a number. As with the vendors, the hex product ID for this card follows the same convention for `0xffffffff` and `0xffff`. Finally, there is a string description of the device itself. This string typically is not used in FreeBSD, since FreeBSD's pccard bus driver will construct a string from the human readable CIS entries, but it can be used in the rare cases where this is somehow insufficient. The products are in alphabetical order by manufacturer, then numerical order by product ID. They have a C comment before each manufacturer's entries and there is a blank line between entries.
fa: پس از کلمه کلیدی `product` نام فروشنده که از بالا تکرار شده است، می‌آید. پس از آن نام محصول می‌آید که توسط درایور استفاده می‌شود و باید یک شناسه معتبر C باشد، اما می‌تواند با یک عدد نیز شروع شود. همانند فروشندگان، شناسه هگز محصول برای این کارت از همان قرارداد برای `0xffffffff` و `0xffff` پیروی می‌کند. در نهایت، یک توصیف رشته‌ای از خود دستگاه وجود دارد. این رشته معمولاً در FreeBSD استفاده نمی‌شود، زیرا درایور گذرگاه کارت‌های PC در FreeBSD رشته‌ای را از ورودی‌های CIS قابل خواندن توسط انسان می‌سازد، اما در موارد نادری که این به نوعی کافی نیست، می‌توان از آن استفاده کرد. محصولات به ترتیب حروف الفبا بر اساس سازنده و سپس به ترتیب عددی بر اساس شناسه محصول هستند. آنها قبل از ورودی‌های هر سازنده یک نظر C دارند و بین ورودی‌ها یک خط خالی وجود دارد.

source: The third section is like the previous vendor section, but with all of the manufacturer numeric IDs set to `-1`, meaning "match anything found" in the FreeBSD pccard bus code. Since these are C identifiers, their names must be unique. Otherwise the format is identical to the first section of the file.
fa: بخش سوم مانند بخش فروشنده قبلی است، اما تمام شناسه‌های عددی سازنده روی `-1` تنظیم شده‌اند، به این معنی که "هر چیزی که در کد گذرگاه کارت‌های PC در FreeBSD یافت شود، مطابقت دارد". از آنجایی که این شناسه‌ها C هستند، نام آنها باید منحصر به فرد باشد. در غیر این صورت، قالب با بخش اول فایل یکسان است.

source: The final section contains the entries for those cards that must be identified by string entries. This section's format is a little different from the generic section:
fa: بخش آخر شامل ورودی‌های مربوط به کارت‌هایی است که باید با ورودی‌های رشته‌ای مشخص شوند. قالب این بخش کمی با بخش عمومی متفاوت است:

source: product ADDTRON AWP100 { "Addtron", "AWP-100&spWireless&spPCMCIA", "Version&sp01.02", NULL } product ALLIEDTELESIS WR211PCM { "Allied&spTelesis&spK.K.", "WR211PCM", NULL, NULL } Allied Telesis WR211PCM
fa: محصول ADDTRON AWP100 { "Addtron", "AWP-100&spWireless&spPCMCIA", "نسخه&sp01.02", NULL } محصول ALLIEDTELESIS WR211PCM { "Allied&spTelesis&spK.K.", "WR211PCM", NULL, NULL } Allied Telesis WR211PCM

source: The familiar `product` keyword is followed by the vendor name and the card name, just as in the second section of the file. Here the format deviates from that used earlier. There is a {} grouping, followed by a number of strings. These strings correspond to the vendor, product, and extra information that is defined in a CIS_INFO tuple. These strings are filtered by the program that generates [.filename]#pccarddevs.h# to replace &sp with a real space. NULL strings mean that the corresponding part of the entry should be ignored. The example shown here contains a bad entry. It should not contain the version number unless that is critical for the operation of the card. Sometimes vendors will have many different versions of the card in the field that all work, in which case that information only makes it harder for someone with a similar card to use it with FreeBSD. Sometimes it is necessary when a vendor wishes to sell many different parts under the same brand due to market considerations (availability, price, and so forth). Then it can be critical to disambiguating the card in those rare cases where the vendor kept the same manufacturer/product pair. Regular expression matching is not available at this time.
fa: کلمه کلیدی آشنای `product` به دنبال نام فروشنده و نام کارت می‌آید، درست مانند بخش دوم فایل. در اینجا فرمت با آنچه قبلاً استفاده شده متفاوت است. یک گروه‌بندی {} وجود دارد که به دنبال آن تعدادی رشته می‌آید. این رشته‌ها مربوط به فروشنده، محصول و اطلاعات اضافی است که در یک تاپل CIS_INFO تعریف شده است. این رشته‌ها توسط برنامه‌ای که ‎[.filename]#pccarddevs.h#‎ را تولید می‌کند، فیلتر می‌شوند تا &sp را با یک فاصله واقعی جایگزین کنند. رشته‌های NULL به این معنی است که بخش مربوطه از ورودی باید نادیده گرفته شود. مثال نشان داده شده در اینجا شامل یک ورودی بد است. نباید شامل شماره نسخه باشد، مگر اینکه برای عملکرد کارت حیاتی باشد. گاهی اوقات فروشندگان نسخه‌های مختلف زیادی از کارت را در این زمینه دارند که همه کار می‌کنند، در این صورت این اطلاعات فقط استفاده از آن را با FreeBSD برای کسی که کارت مشابهی دارد، دشوارتر می‌کند. گاهی اوقات لازم است که یک فروشنده به دلیل ملاحظات بازار (موجود بودن، قیمت و غیره) قطعات مختلف زیادی را تحت یک برند بفروشد. سپس، در موارد نادری که فروشنده جفت تولیدکننده/محصول یکسانی را نگه داشته است، رفع ابهام کارت می‌تواند بسیار مهم باشد. تطبیق عبارت منظم در حال حاضر در دسترس نیست.

source: Sample Probe Routine
fa: روال نمونه‌برداری

source: To understand how to add a device to the list of supported devices, one must understand the probe and/or match routines that many drivers have. It is complicated a little in FreeBSD 5.x because there is a compatibility layer for OLDCARD present as well. Since only the window-dressing is different, an idealized version will be presented here.
fa: برای درک نحوه اضافه کردن یک دستگاه به لیست دستگاه‌های پشتیبانی‌شده، باید روال‌های کاوش و/یا تطبیق را که بسیاری از درایورها دارند، درک کرد. این کار در FreeBSD 5.x کمی پیچیده است زیرا یک لایه سازگاری برای OLDCARD نیز وجود دارد. از آنجایی که فقط ظاهر آن متفاوت است، یک نسخه ایده‌آل در اینجا ارائه خواهد شد.

source: static const struct pccard_product wi_pccard_products[] = { PCMCIA_CARD(3COM, 3CRWE737A, 0), PCMCIA_CARD(BUFFALO, WLI_PCM_S11, 0), PCMCIA_CARD(BUFFALO, WLI_CF_S11G, 0), PCMCIA_CARD(TDK, LAK_CD011WL, 0), { NULL } };
fa: ‎ایستا const struct pccard_product wi_pccard_products[] = { ‎PCMCIA_CARD(3COM, 3CRWE737A, 0), ‎PCMCIA_CARD(BUFFALO, WLI_PCM_S11, 0), ‎PCMCIA_CARD(BUFFALO, WLI_CF_S11G, 0), ‎PCMCIA_CARD(TDK, LAK_CD011WL, 0), ‎{NULL} ‎};‎

source: static int wi_pccard_probe(dev) device_t dev; { const struct pccard_product *pp;
fa: ‎متغیر استاتیک از نوع int wi_pccard_probe(dev) dev_t dev; { const struct pccard_product *pp;‎

source: if ((pp = pccard_product_lookup(dev, wi_pccard_products, sizeof(wi_pccard_products[0]), NULL)) != NULL) { if (pp->pp_name != NULL) device_set_desc(dev, pp->pp_name); return (0); } return (ENXIO); }
fa: اگر ((pp = pccard_product_lookup(dev, wi_pccard_products, sizeof(wi_pccard_products[0]), NULL)) != NULL) { اگر (pp->pp_name != NULL) device_set_desc(dev, pp->pp_name); return (0); } return (ENXIO); }

source: Here we have a simple pccard probe routine that matches a few devices. As stated above, the name may vary (if it is not `foo_pccard_probe()` it will be `foo_pccard_match()`). The function `pccard_product_lookup()` is a generalized function that walks the table and returns a pointer to the first entry that it matches. Some drivers may use this mechanism to convey additional information about some cards to the rest of the driver, so there may be some variance in the table. The only requirement is that each row of the table must have a `struct pccard_product` as the first element.
fa: در اینجا ما یک روال ساده برای جستجوی کارت‌های pccard داریم که با چند دستگاه مطابقت دارد. همانطور که در بالا ذکر شد، نام آن ممکن است متفاوت باشد (اگر `foo_pccard_probe()` نباشد، `foo_pccard_match()` خواهد بود). تابع `pccard_product_lookup()` یک تابع تعمیم‌یافته است که جدول را پیمایش می‌کند و یک اشاره‌گر به اولین ورودی که با آن مطابقت دارد، برمی‌گرداند. برخی از درایورها ممکن است از این مکانیسم برای انتقال اطلاعات اضافی در مورد برخی کارت‌ها به بقیه درایور استفاده کنند، بنابراین ممکن است در جدول کمی اختلاف وجود داشته باشد. تنها شرط لازم این است که هر ردیف جدول باید یک `struct pccard_product` به عنوان عنصر اول داشته باشد.
