Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/leap-seconds/_index.po
Languages: nl_nl

source: A short description of how leap seconds are handled on FreeBSD
nl_nl: Een korte beschrijving over hoe FreeBSD met schrikkelseconden omgaat

source: FreeBSD Support for Leap Seconds
nl_nl: Ondersteuning voor schrikkelseconden in FreeBSD

source: Introduction
nl_nl: Introductie

source: A _leap second_ is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
nl_nl: Een _schrikkelseconde_ is een aanpassing aan UTC van één seconde op specifieke tijden in het jaar om atomaire tijdschalen met variaties in de aardrotatie te synchroniseren. Dit artikel beschrijft hoe FreeBSD omgaat met schrikkelseconden.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
nl_nl: Op het moment van schrijven zal de volgende schrikkelseconde plaatsvinden op 30 juni 2015 om 23:59:60 UTC. Deze schrikkelseconde zal plaatsvinden op een werkdag voor Noord- en Zuid-Amerika en het Aziatische/Pacifische gebied.

source: Leap seconds are announced by https://www.iers.org/IERS/EN/Home/home_node.html[IERS] on https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].
nl_nl: Schrikkelseconden worden aangekondigd door https://www.iers.org/IERS/EN/Home/home_node.html[IERS] op https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].

source: Standard leap second behavior is described in https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Also see man:time2posix[3].
nl_nl: Standaardgedrag voor schrikkelseconden is beschreven in https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Zie ook man:time2posix[3].

source: Default Leap Second Handling on FreeBSD
nl_nl: De standaardomgang met schrikkelseconden op FreeBSD

source: The easiest way to handle leap seconds is with the POSIX time rules FreeBSD uses by default, combined with extref:{handbook}[NTP, network-ntp]. When man:ntpd[8] is running and the time is synchronized with upstream NTP servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
nl_nl: De eenvoudigste manier om met schrikkelseconden om te gaan is met de tijdregels van POSIX die FreeBSD standaard gebruikt, gecombineerd met extref:{handbook}[NTP, network-ntp]. Wanneer man:ntpd[8] draait en de tijd is gesynchroniseerd met bovenliggende NTP-servers welke correct met schrikkelseconden omgaan, dan zal de schrikkelseconde ervoor zorgen dat het systeem automatisch de laatste seconde van de dag herhaalt. Er zijn geen verdere aanpassingen nodig.

source: If the upstream NTP servers do not handle leap seconds correctly, man:ntpd[8] will step the time by one second after the errant upstream server has noticed and stepped itself.
nl_nl: Als de bovenliggende NTP-servers onjuist met schrikkelseconden omgaan, zal man:ntpd[8] de tijd met één seconde vooruitzetten nadat de afdwalende bovenliggende server het heeft opgemerkt en zichzelf heeft aangepast.

source: If NTP is not being used, manual adjustment of the system clock will be required after the leap second has passed.
nl_nl: Wanneer NTP niet wordt gebruikt zijn handmatige aanpassingen van de systeemklok nodig nadat de schrikkelseconde heeft plaatsgevonden.

source: Cautions
nl_nl: Waarschuwingen

source: Leap seconds are inserted at the same instant all over the world: UTC midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
nl_nl: Schrikkelseconden worden wereldwijd op hetzelfde moment ingevoegd: middernacht UTC. In Japan is dat het midden van de ochtend, in het Pacifisch gebied in de middag, in Amerika in de late middag en in Europa in de nacht.

source: We believe and expect that FreeBSD, if provided correct and stable NTP service, will work as designed during this leap second, as it did during the previous ones.
nl_nl: We verwachten dat FreeBSD, mits voorzien van een correcte en stabiele NTP-dienst, zal werken zoals verwacht tijdens deze schrikkelseconde, net zoals het bij de vorige deed.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
nl_nl: We waarschuwen echter dat praktisch geen enkele toepassing de kernel ooit om schrikkelseconden heeft gevraagd. Onze verwachting is dat, zoals ontworpen, schrikkelseconden in feite een herhaling zijn van de seconde voor de schrikkelseconde, wat een verassing is voor de meeste toepassingsprogrammeurs.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable NTP service will not know anything about leap seconds at all.
nl_nl: Andere besturingssystemen en andere computers kunnen anders met de schrikkelseconde omgaan dan FreeBSD, en systemen zonder een correcte en stabiele NTP-dienst zullen helemaal niks van schrikkelseconden afweten.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public NTP servers might handle and announce the leap second incorrectly.
nl_nl: Het komt voor dat computers crashen vanwege schrikkelseconden, en ervaring laat zien dat een groot gedeelte van alle publieke NTP-servers de schrikkelseconde onjuist kunnen aankondigen en afhandelen.

source: Please try to make sure nothing horrible happens because of the leap second.
nl_nl: Probeer er alstublieft voor te zorgen dat er niks ergs gebeurt vanwege de schrikkelseconde.

source: Testing
nl_nl: Testen

source: It is possible to test whether a leap second will be used. Due to the nature of NTP, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the NTP daemon:
nl_nl: Het is mogelijk om te kijken of een schrikkelseconde zal worden gebruikt. Vanwege de aard van NTP kan de test tot 24 uur voor de schrikkelseconde werken. Sommige grote bronnen van referentieklokken kondigen schrikkelseconden slechts één uur van te voren aan. Ondervraag het NTP-daemon:

source: Output that includes `leap_add_sec` indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, `leap_none` will be shown.
nl_nl: Uitvoer welke `leap_add_sec` bevat wijst op correcte ondersteuning van de schrikkelseconde. Voorafgaand aan de 24 uur die tot de schrikkelseconde leiden, of nadat de schrikkelseconde is verstreken, zal `leap_none` zichtbaar zijn.

source: Conclusion
nl_nl: Conclusie

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
nl_nl: In de praktijk zijn schrikkelseconden meestal geen probleem op FreeBSD. We hopen dat dit overzicht helpt met wat te verwachten en hoe schrikkelseconden soepeler te laten verlopen.
