Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bibliography/_index.po
Languages: ru

source: FreeBSD Handbook Bibliography
ru: Библиография Руководства FreeBSD

source: Part V. Appendices
ru: Часть V. Приложения

source: Appendix B. Bibliography
ru: Приложение B. Библиография

source: Bibliography
ru: Библиография

source: While manual pages provide a definitive reference for individual pieces of the FreeBSD operating system, they seldom illustrate how to put the pieces together to make the whole operating system run smoothly. For this, there is no substitute for a good book or users' manual on UNIX(R) system administration.
ru: Хотя справочные страницы (man-страницы) предоставляют точную информацию об отдельных компонентах операционной системы FreeBSD, они редко показывают, как объединить эти компоненты, чтобы обеспечить бесперебойную работу всей системы. В этом случае нет замены хорошей книге или руководству пользователя по администрированию UNIX(R).

source: FreeBSD Bibliography
ru: Библиография FreeBSD

source: *Absolute FreeBSD: The Complete Guide To FreeBSD*, Third Edition, published by link:https://nostarch.com/absfreebsd3[No Starch Press], 2018. ISBN: 978-1593278922
ru: *Absolute FreeBSD: The Complete Guide To FreeBSD*, третье издание, издано link:https://nostarch.com/absfreebsd3[No Starch Press], 2018. ISBN: 978-1593278922

source: *FreeBSD Mastery: Storage Essentials*, published by link:https://www.tiltedwindmillpress.com/product/freebsd-mastery-storage-essentials/[Tilted Windmill Press], 2014. ISBN: 978-1642350098
ru: *FreeBSD Mastery: Storage Essentials*, издано link:https://www.tiltedwindmillpress.com/product/freebsd-mastery-storage-essentials/[Tilted Windmill Press], 2014. ISBN: 978-1642350098

source: *FreeBSD Mastery: Specialty Filesystems*, published by link:https://www.tiltedwindmillpress.com/product/fmspf/[Tilted Windmill Press], 2015. ISBN: 978-1642350111
ru: *FreeBSD Mastery: Specialty Filesystems*, издано link:https://www.tiltedwindmillpress.com/product/fmspf/[Tilted Windmill Press], 2015. ISBN: 978-1642350111

source: *FreeBSD Mastery: ZFS*, published by link:https://www.tiltedwindmillpress.com/product/fmzfs/[Tilted Windmill Press], 2015. ISBN: 978-1642350005
ru: *FreeBSD Mastery: ZFS*, издано link:https://www.tiltedwindmillpress.com/product/fmzfs/[Tilted Windmill Press], 2015. ISBN: 978-1642350005

source: *FreeBSD Mastery: Advanced ZFS*, published by link:https://www.tiltedwindmillpress.com/product/fmaz/[Tilted Windmill Press], 2016. ISBN: 978-0692688687
ru: *FreeBSD Mastery: Advanced ZFS*, издано link:https://www.tiltedwindmillpress.com/product/fmaz/[Tilted Windmill Press], 2016. ISBN: 978-0692688687

source: *FreeBSD Mastery: Jails*, published by link:https://www.tiltedwindmillpress.com/product/fmjail/[Tilted Windmill Press], 2019. ISBN: 978-1642350241
ru: *FreeBSD Mastery: Jails*, издано link:https://www.tiltedwindmillpress.com/product/fmjail/[Tilted Windmill Press], 2019. ISBN: 978-1642350241

source: *FreeBSD Device Drivers: A Guide for the Intrepid*, published by link:https://nostarch.com/bsddrivers.htm[No Starch Press], 2012. ISBN: 978-1593272043
ru: *FreeBSD Device Drivers: A Guide for the Intrepid*, издано link:https://nostarch.com/bsddrivers.htm[No Starch Press], 2012. ISBN: 978-1593272043

source: *The Design And Implementation Of The Freebsd Operating System*, Second Edition, published by link:https://www.pearson.com/store/p/design-and-implementation-of-the-freebsd-operating-system-the/P200000000463/9780321968975[Pearson Education, Inc.], 2014. ISBN: 978-0321968975
ru: *The Design And Implementation Of The Freebsd Operating System*, второе издание, издано link:https://www.pearson.com/store/p/design-and-implementation-of-the-freebsd-operating-system-the/P200000000463/9780321968975[Pearson Education, Inc.], 2014. ISBN: 978-0321968975

source: *UNIX and Linux System Administration Handbook*, Fifth Edition, published by link:https://www.pearson.com/en-us/subject-catalog/p/unix-and-linux-system-administration-handbook/P200000000513/9780137460359[Pearson Education, Inc.], 2017. ISBN: 978-0134277554
ru: *UNIX and Linux System Administration Handbook*, пятое издание, издано link:https://www.pearson.com/en-us/subject-catalog/p/unix-and-linux-system-administration-handbook/P200000000513/9780137460359[Pearson Education, Inc.], 2017. ISBN: 978-0134277554

source: *Designing BSD Rootkits*, published by link:https://nostarch.com/rootkits.htm[No Starch Press], 2007. ISBN: 978-1593271428
ru: *Designing BSD Rootkits*, издано link:https://nostarch.com/rootkits.htm[No Starch Press], 2007. ISBN: 978-1593271428

source: *FreeBSD Jails using VNETs*, published in link:https://rderik.gumroad.com/l/uwOLZ[gumroad]
ru: *FreeBSD Jails using VNETs*, опубликовано в link:https://rderik.gumroad.com/l/uwOLZ[gumroad]

source: Security Reference
ru: Издания о безопасности

source: *The Book of PF: A No-Nonsense Guide to the OpenBSD Firewall*, Third Edition, published by link:https://nostarch.com/pf3[No Starch Press], 2014. ISBN: 978-1593275891
ru: *The Book of PF: A No-Nonsense Guide to the OpenBSD Firewall*, третье издание, издано link:https://nostarch.com/pf3[No Starch Press], 2014. ISBN: 978-1593275891

source: *SSH Mastery: OpenSSH, PuTTY, Tunnels, and Keys*, Second Edition, 2018. ISBN: 978-1642350029
ru: *SSH Mastery: OpenSSH, PuTTY, Tunnels, and Keys*, второе издание, 2018. ISBN: 978-1642350029

source: UNIX(R) History
ru: История UNIX(R)

source: Lion, John _Lion's Commentary on UNIX, 6th Ed. With Source Code_. ITP Media Group, 1996. ISBN 1573980137
ru: Lion, John _Lion's Commentary on UNIX, 6-е изд. С исходным кодом_. ITP Media Group, 1996. ISBN 1573980137

source: Raymond, Eric S. _The New Hacker's Dictionary, 3rd edition_. MIT Press, 1996. ISBN 0-262-68092-0. Also known as the http://www.catb.org/~esr/jargon/html/index.html[Jargon File]
ru: Raymond, Eric S.. _The New Hacker's Dictionary, 3rd edition_. MIT Press, 1996. ISBN 0-262-68092-0. Также известен как http://www.catb.org/~esr/jargon/html/index.html[Jargon File]

source: Salus, Peter H. _A quarter century of UNIX_. Addison-Wesley Publishing Company, Inc., 1994. ISBN 0-201-54777-5
ru: Salus, Peter H. _A quarter century of UNIX_. Издано Addison-Wesley Publishing Company, Inc., 1994. ISBN 0-201-54777-5

source: Simon Garfinkel, Daniel Weise, Steven Strassmann. _The UNIX-HATERS Handbook_. IDG Books Worldwide, Inc., 1994. ISBN 1-56884-203-1. Out of print, but available http://www.simson.net/ref/ugh.pdf[online].
ru: Simon Garfinkel, Daniel Weise, Steven Strassmann. _The UNIX-HATERS Handbook_. IDG Books Worldwide, Inc., 1994. ISBN 1-56884-203-1. Книга снята с печати, но доступна http://www.simson.net/ref/ugh.pdf[онлайн].

source: Don Libes, Sandy Ressler _Life with UNIX_ - special edition. Prentice-Hall, Inc., 1989. ISBN 0-13-536657-7
ru: Don Libes, Sandy Ressler _Life with UNIX_ - специальное издание. Prentice-Hall, Inc., 1989. ISBN 0-13-536657-7

source: _The BSD family tree_. https://cgit.freebsd.org/src/tree/share/misc/bsd-family-tree[https://cgit.freebsd.org/src/tree/share/misc/bsd-family-tree] or link:file://localhost/usr/share/misc/bsd-family-tree[/usr/share/misc/bsd-family-tree] on a FreeBSD machine.
ru: _Генеалогическое древо BSD_. https://cgit.freebsd.org/src/tree/share/misc/bsd-family-tree[https://cgit.freebsd.org/src/tree/share/misc/bsd-family-tree] или link:file://localhost/usr/share/misc/bsd-family-tree[/usr/share/misc/bsd-family-tree] на машине с FreeBSD.

source: _Networked Computer Science Technical Reports Library_.
ru: _Сетевая библиотека технических отчетов по компьютерным наукам_.

source: _Old BSD releases from the Computer Systems Research group (CSRG)_. http://www.mckusick.com/csrg/[http://www.mckusick.com/csrg/]: The 4CD set covers all BSD versions from 1BSD to 4.4BSD and 4.4BSD-Lite2 (but not 2.11BSD, unfortunately). The last disk also holds the final sources plus the SCCS files.
ru: _Старые выпуски BSD от группы исследования компьютерных систем (CSRG)_. http://www.mckusick.com/csrg/[http://www.mckusick.com/csrg/]: Набор из 4 дисков включает все версии BSD от 1BSD до 4.4BSD и 4.4BSD-Lite2 (но, к сожалению, не 2.11BSD). На последнем диске также находятся окончательные исходные тексты вместе с файлами SCCS.

source: Kernighan, Brian _Unix: A History and a Memoir_. Kindle Direct Publishing, 2020. ISBN 978-169597855-3
ru: Керниган, Брайан _Unix: История и мемуары_. Kindle Direct Publishing, 2020. ISBN 978-169597855-3

source: Periodicals, Journals, and Magazines
ru: Периодические издания, журналы и газеты

source: https://www.admin-magazin.de/[Admin Magazin] (in German), published by Medialinx AG. ISSN: 2190-1066
ru: https://www.admin-magazin.de/[Admin Magazin] (на немецком языке), издательство Medialinx AG. ISSN: 2190-1066

source: https://www.bsdnow.tv/[BSD Now - Video Podcast], published by Jupiter Broadcasting LLC
ru: https://www.bsdnow.tv/[BSD Now - Video Podcast], издано Jupiter Broadcasting LLC

source: https://freebsdfoundation.org/our-work/journal/[FreeBSD Journal], published by S&W Publishing, sponsored by The FreeBSD Foundation. ISBN: 978-0-615-88479-0
ru: https://freebsdfoundation.org/our-work/journal/[FreeBSD Journal], издаваемый S&W Publishing при спонсорской поддержке The FreeBSD Foundation. ISBN: 978-0-615-88479-0
