Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/contributors/_index.po
Languages: ru

source: A list of organizations and individuals who have contributed to FreeBSD
ru: Список организаций и частных лиц, внесших вклад в FreeBSD

source: Contributors to FreeBSD
ru: Участники проекта FreeBSD

source: Abstract
ru: Аннотация

source: This article lists individuals and organizations who have made a contribution to FreeBSD. To see the current list of FreeBSD Committers you can take a look at the following crossref:contributors[staff-committers, list].
ru: В этой статье перечислены люди и организации, внесшие вклад в FreeBSD. Чтобы увидеть текущий список коммиттеров FreeBSD, можно ознакомиться со следующим разделом: crossref:contributors[staff-committers, список].

source: The FreeBSD Developers
ru: Разработчики FreeBSD

source: This list, which includes all members of the Core Team, names everyone who has commit privileges for one or more of the three source trees (doc, ports and src). To see the current Core Team members you can take a look at the link:https://www.freebsd.org/administration/#t-core[administration page].
ru: Этот список, включающий всех членов Основной Команды (Core Team), содержит имена всех, у кого есть права на коммит в одном или нескольких из трёх деревьев исходников (doc, ports и src). Текущий состав основной команды можно посмотреть на link:https://www.freebsd.org/administration/#t-core[странице администрации].

source: (in alphabetical order by last name):
ru: (в алфавитном порядке по фамилии):

source: Core Team Alumni
ru: Бывшие участники основной команды (Core Team)

source: The following people were members of the FreeBSD core team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
ru: Следующие люди были членами основной команды FreeBSD в указанные периоды. Мы благодарим их за прошлые усилия на благо проекта FreeBSD.

source: _In rough reverse chronological order:_
ru: _В приблизительном обратном хронологическом порядке:_

source: Development Team Alumni
ru: Бывшие участники команды разработчиков

source: The following people were members of the FreeBSD development team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
ru: Следующие люди были членами команды разработчиков FreeBSD в указанные периоды. Мы благодарим их за прошлые усилия на благо проекта FreeBSD.

source: Ports Management Team Alumni
ru: Команда управления портами: бывшие участники

source: The following people were members of the FreeBSD portmgr team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
ru: Следующие люди были членами команды portmgr FreeBSD в указанные периоды. Мы благодарим их за прошлые усилия на службе проекта FreeBSD.

source: Development Team: In Memoriam
ru: Команда разработчиков: Памяти ушедших

source: During the many years that the FreeBSD Project has been in existence, sadly, some of our developers have passed away. Here are some remembrances.
ru: В течение многих лет существования проекта FreeBSD, к сожалению, некоторые из наших разработчиков ушли из жизни. Вот несколько воспоминаний.

source: _In rough reverse chronological order of their passing:_
ru: _В приблизительном обратном хронологическом порядке их ухода:_

source: Derived Software Contributors
ru: Участники разработки производного программного обеспечения

source: This software was originally derived from William F. Jolitz's 386BSD release 0.1, though almost none of the original 386BSD specific code remains. This software has been essentially re-implemented from the 4.4BSD-Lite release provided by the Computer Science Research Group (CSRG) at the University of California, Berkeley and associated academic contributors.
ru: Это программное обеспечение изначально было получено из релиза 386BSD 0.1 Уильяма Ф. Джолитца, хотя почти ни один из оригинальных фрагментов кода, специфичных для 386BSD, не сохранился. Данное программное обеспечение было практически полностью переработано на основе релиза 4.4BSD-Lite, предоставленного Исследовательской группой компьютерных наук (CSRG) Калифорнийского университета в Беркли и связанными с ней академическими участниками.

source: There are also portions of NetBSD and OpenBSD that have been integrated into FreeBSD as well, and we would therefore like to thank all the contributors to NetBSD and OpenBSD for their work.
ru: В FreeBSD также включены части NetBSD и OpenBSD, поэтому мы хотели бы поблагодарить всех участников разработки NetBSD и OpenBSD за их труд.

source: Additional FreeBSD Contributors
ru: Дополнительные участники проекта FreeBSD

source: (in alphabetical order by first name):
ru: (в алфавитном порядке по имени):

source: 386BSD Patch Kit Patch Contributors
ru: Участники, внесшие вклад в набор исправлений 386BSD

source: Donors Gallery
ru: Галерея доноров

source: The FreeBSD Foundation thanks https://freebsdfoundation.org/our-donors/donors/[financial and in-kind donors].
ru: Фонд FreeBSD благодарит https://freebsdfoundation.org/our-donors/donors/[финансовых доноров и доноров оборудования].

source: The https://www.freebsd.org/donations/[FreeBSD Donations Liaison] area includes a https://www.freebsd.org/donations/donors/[list of donated hardware].
ru: https://www.freebsd.org/donations/[FreeBSD Donations Liaison] включает https://www.freebsd.org/donations/donors/[список пожертвованного оборудования].

source: The FreeBSD Project thanks all donors!
ru: Проект FreeBSD благодарит всех предоставивших помощь!

source: As of 2010, the section below was several years out-of-date.
ru: По состоянию на 2010 год, приведённый ниже раздел уже несколько лет устарел.

source: Contributors to the central server project
ru: Участники проекта центрального сервера

source: The following individuals and businesses made it possible for the FreeBSD Project to build a new central server machine, which has replaced `freefall.FreeBSD.org` at one point, by donating the following items:
ru: Следующие частные лица и компании сделали возможным для проекта FreeBSD создание нового центрального серверного оборудования, которое в определённый момент заменило `freefall.FreeBSD.org`, пожертвовав следующие компоненты:

source: {mbarkah} and his employer, http://www.hemi.com/[Hemisphere Online], donated a _Pentium Pro (P6) 200MHz CPU_.
ru: {mbarkah} и его работодатель, http://www.hemi.com/[Hemisphere Online], пожертвовали процессор _Pentium Pro (P6) 200 МГц_.

source: http://www.asacomputers.com/[ASA Computers] donated a _Tyan 1662 motherboard_.
ru: http://www.asacomputers.com/[ASA Computers] подарили _материнскую плату Tyan 1662_.

source: Joe McGuckin <mailto:joe@via.net[joe@via.net]> of http://www.via.net/[ViaNet Communications] donated a _Kingston ethernet controller_.
ru: Джо МакГакин <mailto:joe@via.net[joe@via.net]> из http://www.via.net/[ViaNet Communications] пожертвовал _контроллер Ethernet от Kingston_.

source: Jack O'Neill <mailto:jack@diamond.xtalwind.net[jack@diamond.xtalwind.net]> donated an _NCR 53C875 SCSI controller card_.
ru: Джек О'Нил <mailto:jack@diamond.xtalwind.net[jack@diamond.xtalwind.net]> пожертвовал _SCSI-контроллер NCR 53C875_.

source: Ulf Zimmermann <mailto:ulf@Alameda.net[ulf@Alameda.net]> of http://www.Alameda.net/[Alameda Networks] donated _128MB of memory_, a _4 Gb disk drive and the case_.
ru: Ульф Циммерманн <mailto:ulf@Alameda.net[ulf@Alameda.net]> из http://www.Alameda.net/[Alameda Networks] пожертвовал _128 МБ памяти_, _4 ГБ жёсткого диска и корпус_.

source: Direct funding
ru: Прямое финансирование

source: The following individuals and businesses have generously contributed direct funding to the project:
ru: Следующие частные лица и компании щедро внесли прямые финансовые вклады в проект:

source: Kenneth P. Stox <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> of http://www.imagescape.com/[Imaginary Landscape, LLC.].
ru: Кеннет П. Стокс <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> из http://www.imagescape.com/[Imaginary Landscape, LLC.].

source: http://www.cdrom.co.jp/[Laser5] of Japan (a portion of the profits from sales of their various FreeBSD CDROMs).
ru: http://www.cdrom.co.jp/[Laser5] из Японии (часть прибыли от продаж их различных FreeBSD CDROM идет на поддержку проекта).

source: http://www.mmjp.or.jp/fuki/[Fuki Shuppan Publishing Co.] donated a portion of their profits from _Hajimete no FreeBSD_ (FreeBSD, Getting started) to the FreeBSD and XFree86 projects.
ru: http://www.mmjp.or.jp/fuki/[Fuki Shuppan Publishing Co.] пожертвовала часть прибыли от книги _Hajimete no FreeBSD_ (FreeBSD, начало работы) проектам FreeBSD и XFree86.

source: http://www.ascii.co.jp/[ASCII Corp.] donated a portion of their profits from several FreeBSD-related books to the FreeBSD project.
ru: http://www.ascii.co.jp/[ASCII Corp.] пожертвовала часть прибыли от нескольких книг, связанных с FreeBSD, проекту FreeBSD.

source: http://www.yokogawa.co.jp/[Yokogawa Electric Corp] has generously donated significant funding to the FreeBSD project.
ru: http://www.yokogawa.co.jp/[Yokogawa Electric Corp] щедро предоставила значительное финансирование проекту FreeBSD.

source: Hardware contributors
ru: Участники разработки аппаратного обеспечения

source: The following individuals and businesses have generously contributed hardware for testing and device driver development/support:
ru: Следующие частные лица и компании любезно предоставили оборудование для тестирования и разработки/поддержки драйверов устройств:

source: BSDi for providing the Pentium P5-90 and 486/DX2-66 EISA/VL systems that are being used for our development work, to say nothing of the network access and other donations of hardware resources.
ru: BSDi за предоставление систем Pentium P5-90 и 486/DX2-66 EISA/VL, которые используются в нашей разработке, не говоря уже о сетевом доступе и других пожертвованиях аппаратных ресурсов.

source: http://www.compaq.com[Compaq] has donated a variety of Alpha systems to the FreeBSD Project. Among the many generous donations are 4 AlphaStation DS10s, an AlphaServer DS20, AlphaServer 2100s, an AlphaServer 4100, 8 500Mhz Personal Workstations, 4 433Mhz Personal Workstations, and more! These machines are used for release engineering, package building, SMP development, and general development on the Alpha architecture.
ru: http://www.compaq.com[Compaq] пожертвовал FreeBSD Project разнообразные системы Alpha. Среди множества щедрых пожертвований — 4 AlphaStation DS10, AlphaServer DS20, AlphaServer 2100, AlphaServer 4100, 8 персональных рабочих станций с частотой 500 МГц, 4 персональные рабочие станции с частотой 433 МГц и многое другое! Эти машины используются для сборки релизов, создания пакетов, разработки SMP и общей разработки архитектуры Alpha.

source: TRW Financial Systems, Inc. provided 130 PCs, three 68 GB file servers, twelve Ethernets, two routers and an ATM switch for debugging the diskless code
ru: TRW Financial Systems, Inc. предоставила 130 ПК, три файловых сервера по 68 ГБ, двенадцать сетей Ethernet, два маршрутизатора и коммутатор ATM для отладки кода бездисковой системы

source: Dermot McDonnell donated the Toshiba XM3401B CDROM drive currently used in _freefall_.
ru: Дермот МакДоннелл предоставил привод CDROM Toshiba XM3401B, который в настоящее время используется в _freefall_.

source: Chuck Robey <mailto:chuckr@glue.umd.edu[chuckr@glue.umd.edu]> contributed his floppy tape streamer for experimental work.
ru: Чак Роби <mailto:chuckr@glue.umd.edu[chuckr@glue.umd.edu]> предоставил свой потоковый накопитель на гибких дисках для экспериментальной работы.

source: Larry Altneu <mailto:larry@alr.com[larry@alr.com],> and {wilko}, provided Wangtek and Archive QIC-02 tape drives to improve the [.filename]#wt# driver.
ru: Ларри Альтной <mailto:larry@alr.com[larry@alr.com],> и {wilko} предоставили стримеры Wangtek и Archive QIC-02 для улучшения драйвера [.filename]#wt#.

source: Ernst Winter (http://berklix.org/ewinter/[Deceased]) contributed a 2.88 MB floppy drive to the project. This will hopefully increase the pressure for rewriting the floppy disk driver.
ru: Эрнст Винтер (http://berklix.org/ewinter/[Умер]) предоставил проекту дисковод на 2,88 МБ. Надеемся, это усилит внимание к необходимости переписать драйвер для дискет.

source: http://www.tekram.com/[Tekram Technologies] sent one each of their DC-390, DC-390U and DC-390F FAST and ULTRA SCSI host adapter cards for regression testing of the NCR and AMD drivers with their cards. They are also to be applauded for making driver sources for free operating systems available from their FTP server link:ftp://ftp.tekram.com/scsi/FreeBSD/[ftp://ftp.tekram.com/scsi/FreeBSD/].
ru: http://www.tekram.com/[Tekram Technologies] предоставили по одному экземпляру своих SCSI-адаптеров DC-390, DC-390U и DC-390F FAST и ULTRA для регрессионного тестирования драйверов NCR и AMD с их картами. Также их стоит похвалить за предоставление исходных кодов драйверов для свободных операционных систем на их FTP-сервере link:ftp://ftp.tekram.com/scsi/FreeBSD/[ftp://ftp.tekram.com/scsi/FreeBSD/].

source: Larry M. Augustin contributed not only a Symbios Sym8751S SCSI card, but also a set of data books, including one about the forthcoming Sym53c895 chip with Ultra-2 and LVD support, and the latest programming manual with information on how to safely use the advanced features of the latest Symbios SCSI chips. Thanks a lot!
ru: Ларри М. Аугустин предоставил не только SCSI-карту Symbios Sym8751S, но и набор технической документации, включая руководство по предстоящему чипу Sym53c895 с поддержкой Ultra-2 и LVD, а также последнюю версию руководства по программированию с информацией о безопасном использовании расширенных функций новейших SCSI-чипов Symbios. Большое спасибо!

source: {kuku} donated an FX120 12 speed Mitsumi CDROM drive for IDE CDROM driver development.
ru: {kuku} пожертвовал FX120 12-скоростной Mitsumi CD-ROM привод для разработки драйвера IDE CD-ROM.

source: Mike Tancsa <mailto:mike@sentex.ca[mike@sentex.ca]> donated four various ATM PCI cards to help increase support of these cards as well as help support the development effort of the netatm ATM stack.
ru: Mike Tancsa <mailto:mike@sentex.ca[mike@sentex.ca]> пожертвовал четыре различные PCI-карты ATM для расширения поддержки этих карт, а также для помощи в разработке стека netatm ATM.

source: Special contributors
ru: Особые участники

source: http://www.osd.bsdi.com/[BSDi] (formerly Walnut Creek CDROM) has donated almost more than we can say (see the 'About the FreeBSD Project' section of the extref:{handbook}[FreeBSD Handbook] for more details). In particular, we would like to thank them for the original hardware used for `freefall.FreeBSD.org`, our primary development machine, and for `thud.FreeBSD.org`, a testing and build box. We are also indebted to them for funding various contributors over the years and providing us with unrestricted use of their T1 connection to the Internet.
ru: http://www.osd.bsdi.com/[BSDi] (ранее Walnut Creek CDROM) пожертвовали больше, чем мы можем выразить (подробности см. в разделе 'О проекте FreeBSD' extref:{handbook}[FreeBSD Handbook]). В частности, мы хотели бы поблагодарить их за первоначальное оборудование, использованное для `freefall.FreeBSD.org`, нашей основной машины разработки, и для `thud.FreeBSD.org`, тестовой и сборочной системы. Мы также благодарны им за финансирование различных участников на протяжении многих лет и предоставление неограниченного доступа к их T1-подключению к Интернету.

source: The http://www.interface-business.de/[interface business GmbH, Dresden] has been patiently supporting {joerg} who has often preferred FreeBSD work over paid work, and used to fall back to their (quite expensive) EUnet Internet connection whenever his private connection became too slow or flaky to work with it.
ru: Компания http://www.interface-business.de/[interface business GmbH, Дрезден] терпеливо поддерживала {joerg}, который часто отдавал предпочтение работе с FreeBSD вместо оплачиваемой работы и использовал их (довольно дорогое) интернет-подключение EUnet, когда его личное соединение становилось слишком медленным или ненадежным для работы.

source: http://www.bsdi.com/[Berkeley Software Design, Inc.] has contributed their DOS emulator code to the remaining BSD world, which is used in the `doscmd` command.
ru: http://www.bsdi.com/[Berkeley Software Design, Inc.] предоставила свой код эмулятора DOS для остального мира BSD, который используется в команде `doscmd`.
