Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/contributors/contrib-develinmemoriam.po
Languages: es

source: Bruce D. Evans (1991 - 2019; RIP 2019)
es: Bruce D. Evans (1991 - 2019; DEP 2019)

source: Bruce was a programming giant who made FreeBSD his home.
es: Bruce era un gigante de la programación que hizo de FreeBSD su hogar.

source: Back before FreeBSD and Linux there was Minix, a toy "unix" written by Andy Tannenbaum, released in 1987, sold with complete sources on three floppy disks, for $99.
es: Antes de FreeBSD y Linux existía Minix, un juego "unix" escrito por Andy Tannenbaum, lanzado en 1987, vendido con las fuentes completas en tres disquetes, por 99 dólares.

source: Bruce ported Minix to the i386 around 1989.
es: Bruce portó a Minix a la i386 alrededor de 1989.

source: Linus Torvalds used Minix/386 to develop his own kernel, and Bruce was the first person he thanked in the release-announcement.
es: Linus Torvalds usó Minix/386 para desarrollar su propio núcleo, y Bruce fue la primera persona a la que agradeció en el anuncio de la liberación.

source: When Bill Jolitz released 386BSD 0.1 in 1992, Bruce was listed as a contributor.
es: Cuando Bill Jolitz publicó 386BSD 0.1 en 1992, Bruce fue incluido como colaborador.

source: Bruce co-founded the FreeBSD project, and served on core.0, but he was never partisan, and over the years many other projects have benefitted from his patches, advice and wisdom.
es: Bruce co-fundó el proyecto FreeBSD, y sirvió en el core.0, pero nunca fue partidario, y a lo largo de los años muchos otros proyectos se han beneficiado de sus parches, consejos y sabiduría.

source: Code reviews from Bruce came in three flavours, "mild", "brucified" and "brucifiction", but they were never personal: It was always only about the code, the mistakes, the sloppy thinking, the missing historical context, the ambiguous standards - and the style(9) transgressions.
es: Las reseñas de códigos de Bruce se presentaron en tres sabores, " mild", " brucified" y " brucifiction", pero nunca fueron personales: siempre se trató sólo del código, los errores, el pensamiento descuidado, el contexto histórico faltante, las normas ambiguas - y las transgresiones de estilo(9).

source: As Bruce gave more code reviews than anybody else in the history of the FreeBSD project, the commit logs hide the true scale of his impact until you pay attention to "Submitted by", "Reviewed by" and "Pointed out by".
es: Puesto que Bruce hizo más revisiones de código que cualquier otra persona en la historia del proyecto FreeBSD, los logs de commit esconden la verdadera escal de su impacto hasta que se presta atención a "Submitted by", "Reviewed by" y "Pointed out by".

source: Being hard of hearing, Bruce did not attend conferences.
es: Siendo duro de oído, Bruce no asistió a las conferencias.

source: The notable exception was the 1999 BSDcon in California, where his core team colleagues greeted him with "We're not worthy!" in Wayne's World fashion.
es: La notable excepción fue en la BSDcon de 1999 en California, donde sus colegas del equipo central lo saludaron con un "¡No somos dignos!" a la manera de Wayne's World.

source: Twenty years later we're still not.
es: Veinte años después todavía no lo somos.

source: Kurt Lidl (2015 - 2019; RIP 2019)
es: Kurt Lidl (2015 - 2019; DEP 2019)

source: Kurt first got involved with BSD while it was still a project at the University of California at Berkeley. Shortly after personalized license plates became available in Maryland, he got "BSDWZRD".
es: Kurt se involucró por primera vez con BSD cuando todavía era un proyecto de la Universidad de California en Berkeley. Poco después de que las matrículas personalizadas estuvieran disponibles en Maryland, obtuvo "BSDWZRD".

source: He began contributing to FreeBSD shortly after the conception of the project. He became a FreeBSD source committer in October 2015.
es: Empezó a contribuir a FreeBSD poco después de la concepción del proyecto. Se convirtió en un committer de código fuente de FreeBSD en octubre de 2015.

source: Kurt's most well known FreeBSD project was man:blacklistd[8] which blocks and releases ports on demand to avoid DoS abuse. He has also made many other bug fixes and enhancements to DTrace, boot loaders, and other bits and pieces of the FreeBSD infrastructure.
es: El proyecto más conocido de Kurt en FreeBSD fue man:blacklistd[8] que bloquea y libera puertos bajo demanda para evitar abuso mediante DoS. También a corregido numerosos fallos y ha realizado mejoras a DTrace, cargadores de arranque, y otras piezas de la infraestructura de FreeBSD.

source: Earlier work included the game XTank, an author on RFC 2516 https://tools.ietf.org/html/rfc2516["A Method for Transmitting PPP Over Ethernet (PPPoE)"], and the USENIX paper https://www.usenix.org/conference/usenix-winter-1994-technical-conference/drinking-firehose-multicast-usenet-news["Drinking from the Firehose: Multicast USENET News"].
es: Los trabajos anteriores incluyeron el juego XTank, un autor en RFC 2516 https://tools.ietf.org/html/rfc2516["Un método para transmitir PPP a través de Ethernet (PPPoE)"], y el artículo de USENIX https://www.usenix.org/conference/usenix-winter-1994-technical-conference/drinking-firehose-multicast-usenet-news["Beber de la manguera de incendios": Multicast USENET News"].

source: Frank Durda IV (1995 - 2003; RIP 2018)
es: Frank Durda IV (1995 - 2003; DEP 2018)

source: Frank had been around the project since the very early days, contributing code to the 1.x line before becoming a committer.
es: Frank había estado en el proyecto desde los primeros días, contribuyendo con código a la rama 1.x antes de convertirse en un committer.

source: Andrey A. Chernov (1993 - 2017; RIP 2017)
es: Andrey A. Chernov (1993 - 2017; DEP 2017)

source: Andrey contributions to FreeBSD can not be overstated. Having been involved for a long there is hardly an area which he did not touch.
es: Las contribuciones de Andrey a FreeBSD fueron muchas. Después de haber estado involucrado durante mucho tiempo, apenas no hay un área en la que no haya tocado.

source: Jürgen Lock (2006 - 2015; RIP 2015)
es: Jürgen Lock (2006 - 2015; DEP 2015)

source: Jürgen made a number of contributions to FreeBSD, including work on libvirt, the graphics stack, and QEMU. Jürgen's contributions and helpfulness were appreciated by people around the world. That work continues to improve the lives of thousands every day.
es: Jürgen ha realizado una serie de contribuciones a FreeBSD, incluido el trabajo en libvirt, el stack gráfico y QEMU. Las contribuciones y la ayuda de Jürgen fueron apreciadas por personas de todo el mundo. Este trabajo continúa mejorando la vida de miles de personas todos los días.

source: {alexbl} (2006 - 2011; RIP 2012)
es: {alexbl} (2006 - 2011; DEP 2012)

source: http://www.legacy.com/obituaries/sfgate/obituary.aspx?pid=159801494[Alexander] was best known as a major contributor to FreeBSD's Python ports and a founding member of {python} as well as his work on XMMS2.
es: http://www.legacy.com/obituaries/sfgate/obituary.aspx?pid=159801494[Alexander] fue principalmente conocido como un contribuidor importante a los ports de Python de FreeBSD y como miembro fundador de {python} así como por su trabajo en XMMS2.

source: {jb} (1997 - 2009; RIP 2009)
es: {jb} (1997 - 2009; DEP 2009)

source: http://hub.opensolaris.org/bin/view/Community+Group+ogb/In+Memoriam[John] made major contributions to FreeBSD, the best known of which is the import of the man:dtrace[1] code. John's unique sense of humor and plain-spokenness either ruffled feathers or made him quick friends. At the end of his life, he had moved to a rural area and was attempting to live with as minimal impact to the planet as possible, while at the same time still working in the high-tech area.
es: http://hub.opensolaris.org/bin/view/Community+Group+ogb/In+Memoriam[John] hizo contribuciones importantes a FreeBSD, la más conocida de ellas es la importación del código de man:dtrace[1]. El sentido del humor único de John y su sencillez al hablar hacían que enfadara o se hiciera amigo de la gente rápidamente. Al final de sus días, se mudó a un área rural y estuvo tentado de vivir provocando el menor impacto posible sobre el planeta, a la vez que seguía trabajando en el área de alta tecnología.

source: {jmz} (1994 - 2009; RIP 2009)
es: {jmz} (1994 - 2009; DEP 2009)

source: http://www.obs-besancon.fr/article.php3?id_article=323[Jean-Marc] was an astrophysicist who made important contributions to the modeling of the atmospheres of both planets and comets at http://www.obs-besancon.fr/[l'Observatoire de Besançon] in Besançon, France. While there, he participated in the conception and construction of the Vega tricanal spectrometer that studied Halley's Comet. He had also been a long-time contributor to FreeBSD.
es: http://www.obs-besancon.fr/article.php3?id_article=323[Jean-Marc] fue un astrofísico que hizo importantes contribuciones al modelado de atmósferas tanto de planetas como de cometas en http://www.obs-besancon.fr/[l'Observatoire de Besançon] en Besançon, Francia. Mientras estuvo allí, participó en la concepción y construcción del espectrómetro tricanal Vega que estudió el Cometa Halley. También fue un contribuyente de largo recorrido en FreeBSD.

source: {itojun} (1997 - 2001; RIP 2008)
es: {itojun} (1997 - 2001; DEP 2008)

source: Known to everyone as http://astralblue.livejournal.com/350702.html[itojun], Jun-ichiro Hagino was a core researcher at the http://www.kame.net/[KAME Project], which aimed to provide IPv6 and IPsec technology in freely redistributable form. Much of this code was incorporated into FreeBSD. Without his efforts, the state of IPv6 on the Internet would be much different.
es: Conocido por todos como http://astralblue.livejournal.com/350702.html[itojun], Jun-ichiro Hagino fue el investigador principal del http://www.kame.net/[Proyecto KAME], que tenía como objetivo proporcionar la tecnología IPv6 e IPsec de forma que pudiera distribuirse libremente. Gran parte de este código se ha incorporado a FreeBSD. Sin sus esfuerzos, el estado de IPv6 en Internet sería muy diferente.

source: {cg} (1999 - 2005; RIP 2005)
es: {cg} (1999 - 2005; DEP 2005)

source: http://www.dbsi.org/cam/[Cameron] was a unique individual who contributed to the project despite serious physical disabilities. He was responsible for a complete rewrite of our sound system during the late 1990s. Many of those who corresponded with him had no idea of his limited mobility, due to his cheerful spirit and willingness to help others.
es: http://www.dbsi.org/cam/[Cameron] fue una persona única, que contribuyó al proyecto a pesar de serias discapacidades físicas. Fue responsable de la reescritura completa de nuestro sistema de sonido a finales de la década de 1990. Muchos de los que se comunicaron con él no tenían ni idea de su movilidad limitada, debido a su espíritu alegre y su disposición a ayudar a los demás.

source: {alane} (2002 - 2003; RIP 2003)
es: {alane} (2002 - 2003; DEP 2003)

source: http://freebsd.kde.org/memoriam/alane.php[Alan] was a major contributor to the KDE on FreeBSD group. In addition, he maintained many other difficult and time-consuming ports such as autoconf, CUPS, and python. Alan's path was not an easy one but his passion for FreeBSD, and dedication to programming excellence, won him many friends.
es: http://freebsd.kde.org/memoriam/alane.php[Alan] fue un importante contribuyente al grupo de KDE en FreeBSD. Además, mantuvo muchos otros puertos complicados y que requerían de mucho tiempo tales como autoconf, CUPS y python. El camino de Alan no fue fácil pero su pasión por FreeBSD, y dedicación a la excelencia en la programación, le granjeó muchos amigos.
