Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/security/_index.po
Languages: es

source: Security instructions when making a FreeBSD Port
es: Instrucciones de seguridad al hacer un port a FreeBSD

source: Chapter 12. Security
es: Capítulo 12. Seguridad

source: Security
es: Seguridad

source: Why Security is So Important
es: Por qué es tan importante la seguridad

source: Bugs are occasionally introduced to the software. Arguably, the most dangerous of them are those opening security vulnerabilities. From the technical viewpoint, such vulnerabilities are to be closed by exterminating the bugs that caused them. However, the policies for handling mere bugs and security vulnerabilities are very different.
es: De vez en cuando se introducen errores en el software. Podría decirse que los más peligrosos son los que abren vulnerabilidades de seguridad. Desde el punto de vista técnico, esas vulnerabilidades deben cerrarse exterminando los bugs que las causaron. Sin embargo, las políticas de gestión de los meros bugs y de las vulnerabilidades de seguridad son muy diferentes.

source: A typical small bug affects only those users who have enabled some combination of options triggering the bug. The developer will eventually release a patch followed by a new version of the software, free of the bug, but the majority of users will not take the trouble of upgrading immediately because the bug has never vexed them. A critical bug that may cause data loss represents a graver issue. Nevertheless, prudent users know that a lot of possible accidents, besides software bugs, are likely to lead to data loss, and so they make backups of important data; in addition, a critical bug will be discovered really soon.
es: Un pequeño fallo típico afecta sólo a los usuarios que han activado alguna combinación de opciones que desencadenan el fallo. Con el tiempo, el desarrollador lanzará un parche seguido de una nueva versión del software, libre del fallo, pero la mayoría de los usuarios no se tomarán la molestia de actualizar inmediatamente porque el fallo nunca les ha molestado. Un fallo crítico que pueda causar la pérdida de datos representa un problema más grave. No obstante, los usuarios prudentes saben que hay muchos accidentes posibles, además de los fallos de software, que pueden provocar la pérdida de datos, por lo que hacen copias de seguridad de los datos importantes; además, un fallo crítico se descubrirá muy pronto.

source: A security vulnerability is all different. First, it may remain unnoticed for years because often it does not cause software malfunction. Second, a malicious party can use it to gain unauthorized access to a vulnerable system, to destroy or alter sensitive data; and in the worst case the user will not even notice the harm caused. Third, exposing a vulnerable system often assists attackers to break into other systems that could not be compromised otherwise. Therefore closing a vulnerability alone is not enough: notify the audience of it in the most clear and comprehensive manner, which will allow them to evaluate the danger and take appropriate action.
es: Una vulnerabilidad de seguridad es muy diferente. En primer lugar, puede pasar desapercibida durante años porque a menudo no provoca un mal funcionamiento del software. En segundo lugar, un malintencionado puede utilizarla para acceder sin autorización a un sistema vulnerable, destruir o alterar datos sensibles y, en el peor de los casos, el usuario ni siquiera se dará cuenta del daño causado. En tercer lugar, exponer un sistema vulnerable a menudo ayuda a los atacantes a entrar en otros sistemas que de otro modo no podrían verse comprometidos. Por lo tanto, no basta con cerrar una vulnerabilidad: hay que notificarla de la manera más clara y completa posible, lo que permitirá al público evaluar el peligro y tomar las medidas oportunas.

source: Fixing Security Vulnerabilities
es: Corrección de las vulnerabilidades de seguridad

source: While on the subject of ports and packages, a security vulnerability may initially appear in the original distribution or in the port files. In the former case, the original software developer is likely to release a patch or a new version instantly. Update the port promptly with respect to the author's fix. If the fix is delayed for some reason, either crossref:porting-dads[dads-noinstall,mark the port as `FORBIDDEN`] or introduce a patch file to the port. In the case of a vulnerable port, just fix the port as soon as possible. In either case, follow crossref:port-upgrading[port-upgrading,the standard procedure for submitting changes] unless having rights to commit it directly to the ports tree.
es: Hablando de puertos y paquetes, una vulnerabilidad de seguridad puede aparecer inicialmente en la distribución original o en los archivos del puerto. En el primer caso, es probable que el desarrollador del software original publique un parche o una nueva versión al instante. Actualiza el port rápidamente con respecto a la corrección del autor. Si la corrección se retrasa por alguna razón, o bien crossref:porting-dads[dads-noinstall,marque el port como `FORBIDDEN`] o introduzca un archivo de parche en el port. En el caso de un port vulnerable, simplemente arregle el port lo antes posible. En cualquier caso, siga crossref:port-upgrading[port-upgrading,el procedimiento estándar para enviar cambios] a menos que tenga derechos para confirmarlo directamente en el árbol de ports.

source: Being a ports committer is not enough to commit to an arbitrary port. Remember that ports usually have maintainers, must be respected.
es: Ser committer de un puerto no es suficiente para comprometerse con un puerto arbitrario. Recuerda que los ports suelen tener mantenedores, hay que respetarlos.

source: Please make sure that the port's revision is bumped as soon as the vulnerability has been closed. That is how the users who upgrade installed packages on a regular basis will see they need to run an update. Besides, a new package will be built and distributed over FTP and WWW mirrors, replacing the vulnerable one. Bump `PORTREVISION` unless `DISTVERSION` has changed in the course of correcting the vulnerability. That is, bump `PORTREVISION` if adding a patch file to the port, but do not bump it if updating the port to the latest software version and thus already touched `DISTVERSION`. Please refer to the crossref:makefiles[makefile-naming-revepoch,corresponding section] for more information.
es: Por favor, asegúrese de que la revisión del puerto se actualiza tan pronto como se haya cerrado la vulnerabilidad. De este modo, los usuarios que actualizan regularmente los paquetes instalados verán que necesitan ejecutar una actualización. Además, se creará un nuevo paquete que se distribuirá a través de las redes FTP y WWW, sustituyendo al paquete vulnerable. Actualice `PORTREVISION` a menos que `DISTVERSION` haya cambiado durante la corrección de la vulnerabilidad. Es decir, active `PORTREVISION` si añade un archivo de parche al puerto, pero no lo active si actualiza el puerto a la última versión de software y, por tanto, ya ha tocado `DISTVERSION`. Por favor, consulte la referencia cruzada:makefiles[makefile-naming-revepoch,sección correspondiente] para más información.

source: Keeping the Community Informed
es: Mantener informada a la comunidad

source: The VuXML Database
es: La base de datos VuXML

source: A very important and urgent step to take as early after a security vulnerability is discovered as possible is to notify the community of port users about the jeopardy. Such notification serves two purposes. First, if the danger is really severe it will be wise to apply an instant workaround. For example, stop the affected network service or even deinstall the port completely until the vulnerability is closed. Second, a lot of users tend to upgrade installed packages only occasionally. They will know from the notification that they _must_ update the package without delay as soon as a corrected version is available.
es: Un paso muy importante y urgente que hay que dar lo antes posible tras el descubrimiento de una vulnerabilidad de seguridad es notificar el peligro a la comunidad de usuarios del puerto. Esta notificación tiene dos objetivos. En primer lugar, si el peligro es realmente grave, será prudente aplicar una solución inmediata. Por ejemplo, detener el servicio de red afectado o incluso desinstalar el puerto por completo hasta que se cierre la vulnerabilidad. En segundo lugar, muchos usuarios tienden a actualizar los paquetes instalados sólo de vez en cuando. Sabrán por la notificación que _deben_ actualizar el paquete sin demora en cuanto esté disponible una versión corregida.

source: Given the huge number of ports in the tree, a security advisory cannot be issued on each incident without creating a flood and losing the attention of the audience when it comes to really serious matters. Therefore security vulnerabilities found in ports are recorded in https://vuxml.freebsd.org/[the FreeBSD VuXML database]. The Security Officer Team members also monitor it for issues requiring their intervention.
es: Dado el enorme número de ports que hay en el árbol, no se puede emitir un aviso de seguridad sobre cada incidente sin crear una avalancha y perder la atención del público cuando se trata de asuntos realmente serios. Por eso las vulnerabilidades de seguridad encontradas en los ports se registran en https://vuxml.freebsd.org/[la base de datos VuXML de FreeBSD]. Los miembros del equipo de responsables de seguridad también la monitorizan en busca de problemas que requieran su intervención.

source: Committers can update the VuXML database themselves, assisting the Security Officer Team and delivering crucial information to the community more quickly. Those who are not committers or have discovered an exceptionally severe vulnerability should not hesitate to contact the Security Officer Team directly, as described on the https://www.freebsd.org/security/#how[FreeBSD Security Information] page.
es: Los committers pueden actualizar ellos mismos la base de datos VuXML, ayudando así al equipo de responsables de seguridad y proporcionando información crucial a la comunidad con mayor rapidez. Aquellos que no sean committers o hayan descubierto una vulnerabilidad excepcionalmente grave no deben dudar en contactar directamente con el Equipo de Responsables de Seguridad, tal y como se describe en la página https://www.freebsd.org/security/#how[Información de seguridad de FreeBSD].

source: The VuXML database is an XML document. Its source file [.filename]#vuln.xml# is kept right inside the port package:security/vuxml[]. Therefore the file's full pathname will be [.filename]#PORTSDIR/security/vuxml/vuln.xml#. Each time a security vulnerability is discovered in a port, please add an entry for it to that file. Until familiar with VuXML, the best thing to do is to find an existing entry fitting the case at hand, then copy it and use it as a template.
es: La base de datos VuXML es un documento XML. Su archivo fuente [.filename]#vuln.xml# se guarda dentro del paquete port:security/vuxml[]. Por lo tanto, la ruta completa del archivo será [.filename]#PORTSDIR/security/vuxml/vuln.xml#. Cada vez que se descubra una vulnerabilidad de seguridad en un puerto, añada una entrada para ella en ese archivo. Hasta que no esté familiarizado con VuXML, lo mejor que puede hacer es encontrar una entrada existente que se ajuste al caso en cuestión, copiarla y utilizarla como plantilla.

source: A Short Introduction to VuXML
es: Una breve introducción a VuXML

source: The full-blown XML format is complex, and far beyond the scope of this book. However, to gain basic insight on the structure of a VuXML entry only the notion of tags is needed. XML tag names are enclosed in angle brackets. Each opening <tag> must have a matching closing </tag>. Tags may be nested. If nesting, the inner tags must be closed before the outer ones. There is a hierarchy of tags, that is, more complex rules of nesting them. This is similar to HTML. The major difference is that XML is e__X__tensible, that is, based on defining custom tags. Due to its intrinsic structure XML puts otherwise amorphous data into shape. VuXML is particularly tailored to mark up descriptions of security vulnerabilities.
es: El formato XML completo es complejo y va mucho más allá del alcance de este libro. Sin embargo, para tener una idea básica de la estructura de una entrada VuXML sólo es necesario conocer la noción de etiquetas. Los nombres de las etiquetas XML van entre corchetes angulares. Cada <tag> de apertura debe tener una </tag> de cierre correspondiente. Las etiquetas pueden estar anidadas. Si se anidan, las etiquetas interiores deben cerrarse antes que las exteriores. Existe una jerarquía de etiquetas, es decir, reglas más complejas para anidarlas. Esto es similar a HTML. La principal diferencia es que XML es e__X__tensible, es decir, se basa en la definición de etiquetas personalizadas. Gracias a su estructura intrínseca, XML da forma a datos que de otro modo serían amorfos. VuXML está especialmente adaptado para marcar descripciones de vulnerabilidades de seguridad.

source: Now consider a realistic VuXML entry:
es: Consideremos ahora una entrada VuXML realista:

source: The tag names are supposed to be self-explanatory so we shall take a closer look only at fields which needs to be filled in:
es: Se supone que los nombres de las etiquetas se explican por sí mismos, así que vamos a echar un vistazo más de cerca sólo a los campos que hay que rellenar:

source: This is the top-level tag of a VuXML entry. It has a mandatory attribute, `vid`, specifying a universally unique identifier (UUID) for this entry (in quotes). Generate a UUID for each new VuXML entry (and do not forget to substitute it for the template UUID unless writing the entry from scratch). Use man:uuidgen[1] to generate a VuXML UUID.
es: Es la etiqueta de nivel superior de una entrada VuXML. Tiene un atributo obligatorio, `vid`, que especifica un identificador único universal (UUID) para esta entrada (entre comillas). Genere un UUID para cada nueva entrada VuXML (y no olvide sustituirlo por el UUID de la plantilla a menos que escriba la entrada desde cero). Utilice man:uuidgen[1] para generar un UUID VuXML.

source: This is a one-line description of the issue found.
es: Esta es una descripción de una línea del problema encontrado.

source: The names of packages affected are listed there. Multiple names can be given since several packages may be based on a single master port or software product. This may include stable and development branches, localized versions, and slave ports featuring different choices of important build-time configuration options.
es: Allí se enumeran los nombres de los paquetes afectados. Pueden darse varios nombres, ya que varios paquetes pueden basarse en un único port maestro o producto de software. Esto puede incluir ramas estables y de desarrollo, versiones localizadas y ports esclavos con diferentes opciones de configuración en tiempo de compilación.

source: Affected versions of the package(s) are specified there as one or more ranges using a combination of `<lt>`, `<le>`, `<eq>`, `<ge>`, and `<gt>` elements. Check that the version ranges given do not overlap. In a range specification, `\*` (asterisk) denotes the smallest version number. In particular, `2.*` is less than `2.a`. Therefore an asterisk may be used for a range to match all possible `alpha`, `beta`, and `RC` versions. For instance, `<ge>2.*</ge><lt>3.*</lt>` will selectively match every `2.x` version while `<ge>2.0</ge><lt>3.0</lt>` will not since the latter misses `2.r3` and matches `3.b`. The above example specifies that affected are versions `1.6` and up to but not including `1.9`, versions `2.x` before `2.4_1`, and version `3.0b1`.
es: Las versiones afectadas del paquete o paquetes se especifican como uno o más rangos utilizando una combinación de elementos `<lt>`, `<le>`, `<eq>`, `<ge>` y `<gt>`. Compruebe que los rangos de versiones indicados no se solapan. En una especificación de rango, `\*` (asterisco) indica el número de versión más pequeño. En concreto, `2.*` es menor que `2.a`. Por lo tanto, se puede utilizar un asterisco para que un rango coincida con todas las posibles versiones `alpha`, `beta` y `RC`. Por ejemplo, `<ge>2.*</ge><lt>3.*</lt>` coincidirá de forma selectiva con todas las versiones `2.x`, mientras que `<ge>2.0</ge><lt>3.0</lt>` no lo hará, ya que esta última omite `2.r3` y coincide con `3.b`. El ejemplo anterior especifica que están afectadas las versiones `1.6` y hasta la `1.9`, pero sin incluirla, las versiones `2.x` anteriores a la `2.4_1` y la versión `3.0b1`.

source: Several related package groups (essentially, ports) can be listed in the `<affected>` section. This can be used if several software products (say FooBar, FreeBar and OpenBar) grow from the same code base and still share its bugs and vulnerabilities. Note the difference from listing multiple names within a single <package> section.
es: Se pueden listar varios grupos de paquetes relacionados (esencialmente, puertos) en la sección `<affected>`. Esto puede usarse si varios productos de software (digamos FooBar, FreeBar y OpenBar) crecen a partir de la misma base de código y aún así comparten sus fallos y vulnerabilidades. Nótese la diferencia con listar varios nombres dentro de una misma sección <package>.

source: The version ranges have to allow for `PORTEPOCH` and `PORTREVISION` if applicable. Please remember that according to the collation rules, a version with a non-zero `PORTEPOCH` is greater than any version without `PORTEPOCH`, for example, `3.0,1` is greater than `3.1` or even than `8.9`.
es: Los rangos de versiones deben tener en cuenta `PORTEPOCH` y `PORTREVISION` si procede. Recuerde que, de acuerdo con las reglas de cotejo, una versión con un `PORTEPOCH` distinto de cero es mayor que cualquier versión sin `PORTEPOCH`, por ejemplo, `3.0,1` es mayor que `3.1` o incluso que `8.9`.

source: This is a summary of the issue. XHTML is used in this field. At least enclosing `<p>` and `</p>` has to appear. More complex mark-up may be used, but only for the sake of accuracy and clarity: No eye candy please.
es: Este es un resumen de la cuestión. En este campo se utiliza XHTML. Como mínimo deben aparecer `<p>` y `</p>`. Se puede utilizar un marcado más complejo, pero sólo en aras de la precisión y la claridad: Nada de adornos.

source: This section contains references to relevant documents. As many references as apply are encouraged.
es: Esta sección contiene referencias a documentos pertinentes. Se recomienda incluir tantas referencias como sea posible.

source: This is a https://www.freebsd.org/security/#adv[FreeBSD security advisory].
es: Este es un https://www.freebsd.org/security/#adv[aviso de seguridad de FreeBSD].

source: This is a https://www.freebsd.org/support/[FreeBSD problem report].
es: Este es un https://www.freebsd.org/support/[Informe de problemas de FreeBSD.

source: This is a https://cve.mitre.org/[MITRE CVE] identifier.
es: Este es un identificador https://cve.mitre.org/[MITRE CVE].

source: This is a https://www.kb.cert.org/vuls/[US-CERT] vulnerability note.
es: Esta es una nota de vulnerabilidad de https://www.kb.cert.org/vuls/[US-CERT].

source: This is a https://www.cisa.gov/news-events/cybersecurity-advisories[US-CERT] Technical Cyber Security Alert.
es: Esta es una alerta de ciberseguridad técnica de https://www.cisa.gov/news-events/cybersecurity-advisories[US-CERT].

source: This is a URL to an archived posting in a mailing list. The attribute `msgid` is optional and may specify the message ID of the posting.
es: Se trata de una URL a un mensaje archivado en una lista de correo. El atributo `msgid` es opcional y puede especificar el ID del mensaje.

source: This is a generic URL. Only it if none of the other reference categories apply.
es: Esta es una URL genérica. Utilícela sólo si no se aplica ninguna de las otras categorías de referencia.

source: This is the date when the issue was disclosed (_YYYY-MM-DD_).
es: Esta es la fecha en la que se dio a conocer el problema (_AAAA-MM-DD_).

source: This is the date when the entry was added (_YYYY-MM-DD_).
es: Esta es la fecha en la que se añadió la entrada (_AAAA-MM-DD_).

source: This is the date when any information in the entry was last modified (_YYYY-MM-DD_). New entries must not include this field. Add it when editing an existing entry.
es: Ésta es la fecha en la que se modificó por última vez la información de la entrada (_AAAA-MM-DD_). Las entradas nuevas no deben incluir este campo. Añádalo al editar una entrada existente.

source: Testing Changes to the VuXML Database
es: Comprobación de cambios en la base de datos VuXML

source: This example describes a new entry for a vulnerability in the package `dropbear` that has been fixed in version `dropbear-2013.59`.
es: Este ejemplo describe una nueva entrada para una vulnerabilidad en el paquete `dropbear` que ha sido corregida en la versión `dropbear-2013.59`.

source: As a prerequisite, install a fresh version of package:security/vuxml[] port.
es: Como requisito previo, instale una nueva versión del paquete:security/vuxml[] port.

source: First, check whether there already is an entry for this vulnerability. If there were such an entry, it would match the previous version of the package, `2013.58`:
es: En primer lugar, comprueba si ya existe una entrada para esta vulnerabilidad. Si existiera tal entrada, coincidiría con la versión anterior del paquete, `2013.58`:

source: If there is none found, add a new entry for this vulnerability.
es: Si no se encuentra ninguna, añada una nueva entrada para esta vulnerabilidad.

source: If the vulnerability has a https://cve.mitre.org/[MITRE CVE] identifier, the following command can be used instead:
es: Si la vulnerabilidad tiene un identificador https://cve.mitre.org/[MITRE CVE], se puede utilizar el siguiente comando en su lugar:

source: where `CVE-YYYYY-XXXX` is a valid CVE identifier.
es: donde `CVE-YYYYY-XXXX` es un identificador CVE válido.

source: If the vulnerability is a FreeBSD Security Advisory, the following command can be used instead:
es: Si la vulnerabilidad es un aviso de seguridad de FreeBSD, se puede utilizar la siguiente orden en su lugar:

source: where `FreeBSD-SA-YY-XXXXXX.asc` is a published https://www.freebsd.org/security/advisories/[FreeBSD Security Advisory].
es: donde `FreeBSD-SA-YY-XXXXXX.asc` es un aviso de seguridad publicado en https://www.freebsd.org/security/advisories/[Aviso de seguridad de FreeBSD].

source: Verify its syntax and formatting:
es: Compruebe su sintaxis y formato:

source: The previous command generates the [.filename]#vuln-flat.xml# file. It can also be generated with:
es: El comando anterior genera el archivo [.filename]#vuln-flat.xml#. También se puede generar con:

source: At least one of these packages needs to be installed: package:textproc/libxml2[], package:textproc/jade[].
es: Es necesario instalar al menos uno de estos paquetes: package:textproc/libxml2[], package:textproc/jade[].

source: Verify that the `<affected>` section of the entry will match the correct packages:
es: Compruebe que la sección `<affected>` de la entrada coincide con los paquetes correctos:

source: Make sure that the entry produces no spurious matches in the output.
es: Asegúrese de que la entrada no produzca coincidencias falsas en la salida.

source: Now check whether the right package versions are matched by the entry:
es: Ahora verifique si las versiones correctas del paquete coinciden con la entrada:

source: 1 problem(s) in the installed packages found.
es: 1 problema(s) en los paquetes instalados encontrados.

source: The former version matches while the latter one does not.
es: La primera versión coincide, mientras que la segunda no.
