Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/security/_index.po
Languages: es

source: VuXML new entry checklist
es: Lista de verificación de nueva entrada de VuXML

source: Check the name of the port. Sometimes the upstream project name is not exactly the same as the port name.
es: Verifique el nombre del puerto. A veces, el nombre del proyecto original no es exactamente el mismo que el nombre del puerto.

source: Add all flavors. When a port has flavors all the package names need to be added as a `<package>` in the entry. Use the following script to generate all flavored package names:
es: Incluye todas las variantes. Cuando un puerto dispone de variantes, todos los nombres de los paquetes deben figurar como un `<package>` en la entrada. Usa el siguiente script para generar todos los nombres de paquetes con variantes:

source: Check if the port has `PORTEPOCH`. The above script snippet helps with that. If the port uses `PORTEPOCH` it is mandatory to add it to the `<range>` tag.
es: Comprueba si el puerto tiene `PORTEPOCH`. El fragmento de script anterior ayuda con eso. Si el puerto usa `PORTEPOCH`, es obligatorio agregarlo a la etiqueta `<range>`.

source: Double check ranges. In the case of ranges limited on both sides, make sure that the `<ge>` and `<lt>` elements are inside the same `<range>` tag. Otherwise the entry might end up defining an overlapping range.
es: Vuelva a verificar los rangos. En el caso de rangos limitados en ambos lados, asegúrese de que los elementos `<ge>` y `<lt>` estén dentro de la misma etiqueta `<range>`. De lo contrario, la entrada podría terminar definiendo un rango superpuesto.

source: Cross-check derivatives. Check whether derivatives or forks of the project included in the ports tree are also affected. For example, if a vulnerability is discovered in package:www/firefox[], assess whether derivatives like package:www/librewolf[], package:www/waterfox[] or other similar projects share the same vulnerability. Include all affected derivatives in the VuXML entry, ensuring that users of these ports are informed. Also check if there are Linux versions of the same port in the tree. For instance, package:databases/sqlite3[] vulnerabilities most likely affect packages like package:databases/linux-c7-sqlite3[] too.
es: Verificar derivados. Comprobar si los derivados o bifurcaciones del proyecto incluidos en el árbol de puertos también están afectados. Por ejemplo, si se descubre una vulnerabilidad en el paquete:www/firefox[], evaluar si derivados como el paquete:www/librewolf[], el paquete:www/waterfox[] u otros proyectos similares comparten la misma vulnerabilidad. Incluir todos los derivados afectados en la entrada de VuXML, asegurando que los usuarios de estos puertos estén informados. También verificar si hay versiones de Linux del mismo puerto en el árbol. Por ejemplo, las vulnerabilidades del paquete:databases/sqlite3[] muy probablemente afectan también a paquetes como el paquete:databases/linux-c7-sqlite3[].

source: Do not commit an entry without running `make validate` first.
es: No hagas una entrada sin ejecutar `make validate` primero.
