Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/see-also/_index.po
Languages: es

source: More information about the FreeBSD Documentation Project
es: Más información sobre el Proyecto de Documentación de FreeBSD

source: Chapter 15. See Also
es: Capítulo 15. Véase también

source: See Also
es: Véase también

source: This document is deliberately not an exhaustive discussion of AsciiDoc and the FreeBSD Documentation Project. For more information about these, you are encouraged to see the following web sites.
es: Este documento no es deliberadamente una discusión exhaustiva de AsciiDoc y el Proyecto de Documentación de FreeBSD. Para más información sobre ellos, le recomendamos que visite los siguientes sitios web.

source: The FreeBSD Documentation Project
es: El proyecto de documentación de FreeBSD

source: link:https://www.FreeBSD.org/docproj/[The FreeBSD Documentation Project web pages]
es: link:https://www.FreeBSD.org/docproj/[Páginas web del Proyecto de Documentación de FreeBSD]

source: extref:{handbook}[The FreeBSD Handbook]
es: extref:{handbook}[El manual de FreeBSD]

source: link:https://gohugo.io/documentation/[Hugo documentation]
es: link:https://gohugo.io/documentation/[Documentación Hugo]

source: link:https://docs.asciidoctor.org/[AsciiDoctor Documentation Portal]
es: link:https://docs.asciidoctor.org/[Portal de documentación AsciiDoctor]

source: link:http://www.w3.org/[The World Wide Web Consortium]
es: link:http://www.w3.org/[Consorcio World Wide Web]

source: link:https://dev.w3.org/html5/spec-LC/[The HTML 5 specification]
es: link:https://dev.w3.org/html5/spec-LC/[Especificaciones de HTML 5]

source: link:https://www.w3.org/Style/CSS/specs.en.html[CSS specification]
es: link:https://www.w3.org/Style/CSS/specs.en.html[Especificaciones CSS]
