Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: _boundary_ - physical address boundary that must not be crossed when allocating the memory. Use value 0 for "no boundary". Applies only to the future `bus_dmamem_alloc()` but not `bus_dmamap_create()` calls. Must be power of 2. If the memory is planned to be used in non-cascaded DMA mode (i.e., the DMA addresses will be supplied not by the device itself but by the ISA DMA controller) then the boundary must be no larger than 64KB (64*1024) due to the limitations of the DMA hardware.
es: _boundary_ - límite de memoria físico que no se debe sobrepasar cuando se reserva la memoria. Usa el valor 0 para "sin límite". Aplica sólo a las llamadas a `bus_dmamem_alloc()` pero no a `bus_dmamap_create()`. Debe ser una potencia de 2. Si la memoria se va a usar en modo DMA sin cascada (es decir, las direcciones DMA serán proporcionadas no por el dispositivo sino por el controlador ISA DMA) entonces el límite no debe ser mayor de 64KB (64*1024) debido a las limitaciones del hardware DMA.
ru: _boundary_ - физическая граница адреса, которую нельзя пересекать при выделении памяти. Используйте значение 0 для обозначения "нет границы". Применяется только к будущим вызовам `bus_dmamem_alloc()`, но не `bus_dmamap_create()`. Должна быть степенью 2. Если память планируется использовать в некаскадном режиме DMA (т.е. адреса DMA будут предоставляться не самим устройством, а контроллером DMA ISA), то граница не должна превышать 64 КБ (64*1024) из-за ограничений аппаратного обеспечения DMA.

source: _lowaddr, highaddr_ - the names are slightly misleading; these values are used to limit the permitted range of physical addresses used to allocate the memory. The exact meaning varies depending on the planned future use:
es: _lowaddr, highaddr_ - los nombres son un poco confusos; estos valores se usan para limitar el rango permitido de direcciones físicas usadas para reservar la memoria. El significado exacto depende del uso que se le vaya a dar:
ru: _lowaddr, highaddr_ - названия немного вводят в заблуждение; эти значения используются для ограничения допустимого диапазона физических адресов, используемых для выделения памяти. Точное значение зависит от предполагаемого будущего использования:

source: For `bus_dmamem_alloc()` all the addresses from 0 to lowaddr-1 are considered permitted, the higher ones are forbidden.
es: Para `bus_dmamem_alloc()` se consideran como permitidas todas las direcciones desde 0 a lowaddr-1, las más altas están prohibidas.
ru: Для `bus_dmamem_alloc()` все адреса от 0 до lowaddr-1 считаются разрешёнными, а более высокие — запрещёнными.

source: For `bus_dmamap_create()` all the addresses outside the inclusive range [lowaddr; highaddr] are considered accessible. The addresses of pages inside the range are passed to the filter function which decides if they are accessible. If no filter function is supplied then all the range is considered unaccessible.
es: Para `bus_dmamap_create()` todas las direcciones fuera del rango cerrado [lowaddr; highaddr] se consideran accesibles. Las direcciones de las páginas dentro del rango se pasan a la función de filtrado que decide si son accesibles. Si no se proporciona una función de filtrado entonces todo el rango se considera inaccesible.
ru: Для `bus_dmamap_create()` все адреса вне включительного диапазона [lowaddr; highaddr] считаются доступными. Адреса страниц внутри диапазона передаются в функцию-фильтр, которая определяет, доступны ли они. Если функция-фильтр не предоставлена, то весь диапазон считается недоступным.

source: For the ISA devices the normal values (with no filter function) are:
es: Para los dispositivos ISA los valores normales (sin función de filtrado) son:
ru: Для устройств ISA обычные значения (без функции фильтрации) следующие:

source: _filter, filterarg_ - the filter function and its argument. If NULL is passed for filter then the whole range [lowaddr, highaddr] is considered unaccessible when doing `bus_dmamap_create()`. Otherwise the physical address of each attempted page in range [lowaddr; highaddr] is passed to the filter function which decides if it is accessible. The prototype of the filter function is: `int filterfunc(void *arg, bus_addr_t paddr)`. It must return 0 if the page is accessible, non-zero otherwise.
es: _filter, filterarg_ - la función de filtrado y su argumento. Si se pasa NULL como filtro entonces todo el rango [lowaddr, highaddr] se considera inaccesible cuando se llama a `bus_dmamap_create()`. De lo contrario la dirección física de cada página en el rango [lowaddr; highaddr] es pasada a la función de filtrado que decide si es accesible. El prototipo de esta función es: `int filterfunc(void *arg, bus_addr_t paddr)`. Debe devolver 0 si la página es accesible, distinto de cero en caso contrario.
ru: _filter, filterarg_ - функция фильтра и её аргумент. Если передаётся NULL для filter, то весь диапазон [lowaddr, highaddr] считается недоступным при выполнении `bus_dmamap_create()`. В противном случае физический адрес каждой страницы в диапазоне [lowaddr; highaddr] передаётся в функцию фильтра, которая определяет, доступна ли она. Прототип функции фильтра: `int filterfunc(void *arg, bus_addr_t paddr)`. Функция должна вернуть 0, если страница доступна, и ненулевое значение в противном случае.

source: _maxsize_ - the maximal size of memory (in bytes) that may be allocated through this tag. In case it is difficult to estimate or could be arbitrarily big, the value for ISA devices would be `BUS_SPACE_MAXSIZE_24BIT`.
es: _maxsize_ - el tamaño máximo de memoria (en bytes) que podría ser reservado a través de esta etiqueta. En caso de que se difícil de estimar o que pudiera ser arbitrariamente grande, el valor para los dispositivos ISA sería `BUS_SPACE_MAXSIZE_24BIT`.
ru: _maxsize_ - максимальный размер памяти (в байтах), который может быть выделен через этот тег. Если сложно оценить или он может быть произвольно большим, для устройств ISA следует использовать значение `BUS_SPACE_MAXSIZE_24BIT`.

source: _nsegments_ - maximal number of scatter-gather segments supported by the device. If unrestricted then the value `BUS_SPACE_UNRESTRICTED` should be used. This value is recommended for the parent tags, the actual restrictions would then be specified for the descendant tags. Tags with nsegments equal to `BUS_SPACE_UNRESTRICTED` may not be used to actually load maps, they may be used only as parent tags. The practical limit for nsegments seems to be about 250-300, higher values will cause kernel stack overflow (the hardware can not normally support that many scatter-gather buffers anyway).
es: _nsegments_ - máximo número de segmentos scatter-gather soportados por el dispositivo. Si no hay restricciones entonces se debería usar el valor `BUS_SPACE_UNRESTRICTED`. Este valor es el recomentado para etiquetas padre, la restricción real sería especificada después por las etiquetas descendientes. Las etiquetas con nsegments igual a `BUS_SPACE_UNRESTRICTED` no se deben usar para cargar mapas, sólo se deben usar como etiquetas padre. El límite práctico para nsegments parece ser alrededor de 250-300, valores más altos provocarán un desbordamiento de pila en el núcleo (el hardware normalmente no puede soportar tantos buffers scatter-gather de todas formas).
ru: _nsegments_ - максимальное количество сегментов scatter-gather, поддерживаемых устройством. Если ограничений нет, следует использовать значение `BUS_SPACE_UNRESTRICTED`. Это значение рекомендуется для родительских тегов, фактические ограничения затем будут указаны для дочерних тегов. Теги с nsegments равным `BUS_SPACE_UNRESTRICTED` не могут использоваться для фактической загрузки отображений, они могут применяться только как родительские теги. Практический предел для nsegments составляет около 250-300, более высокие значения вызовут переполнение стека ядра (аппаратное обеспечение обычно не поддерживает такое большое количество scatter-gather буферов в любом случае).

source: _maxsegsz_ - maximal size of a scatter-gather segment supported by the device. The maximal value for ISA device would be `BUS_SPACE_MAXSIZE_24BIT`.
es: _maxsegsz_ - máximo tamaño de un segmento scatter-gather soportado por el dispositivo. El valor máximo para un dispositivo ISA sería `BUS_SPACE_MAXSIZE_24BIT`.
ru: _maxsegsz_ — максимальный размер сегмента scatter-gather, поддерживаемый устройством. Максимальное значение для устройства ISA будет `BUS_SPACE_MAXSIZE_24BIT`.

source: _flags_ - a bitmap of flags. The only interesting flag is:
es: _flags_ - un mapa de bits de flags. El único flag interesante es:
ru: _flags_ - битовая маска флагов. Единственный интересный флаг:

source: _BUS_DMA_ALLOCNOW_ - requests to allocate all the potentially needed bounce pages when creating the tag.
es: _BUS_DMA_ALLOCNOW_ - solicita reservar todas las páginas "bounce" potencialmente necesarias cuando se crea la etiqueta.
ru: _BUS_DMA_ALLOCNOW_ - запрашивает выделение всех потенциально необходимых промежуточных страниц при создании тега.

source: _dmat_ - pointer to the storage for the new tag to be returned.
es: _dmat_ - puntero al almacenamiento que se devolverá para la nueva etiqueta.
ru: _dmat_ - указатель на хранилище для нового возвращаемого тега.

source: Destroy a tag. Returns 0 on success, the error code otherwise.
es: Destruye una etiqueta. Devuelve 0 en caso de éxito, el código de error en caso contrario.
ru: Уничтожить тег. Возвращает 0 при успехе, код ошибки в противном случае.

source: dmat - the tag to be destroyed.
es: dmat - la etiqueta a destruir.
ru: dmat - тег, который должен быть уничтожен.

source: Allocate an area of contiguous memory described by the tag. The size of memory to be allocated is tag's maxsize. Returns 0 on success, the error code otherwise. The result still has to be loaded by `bus_dmamap_load()` before being used to get the physical address of the memory.
es: Reserva un área contigua de memoria descrita por la etiqueta. El tamaño de la memoria a reservar es el maxsize de la etiqueta. Devuelve 0 en caso de éxito, el código de error en caso contrario. El resultado todavía tiene que ser cargado con `bus_dmamap_load()` antes de ser usado para obtener la dirección física de la memoria.
ru: Выделить область непрерывной памяти, описанную тегом. Размер выделяемой памяти соответствует maxsize тега. Возвращает 0 при успехе, иначе код ошибки. Результат всё ещё должен быть загружен с помощью `bus_dmamap_load()` перед использованием для получения физического адреса памяти.

source: _dmat_ - the tag
es: _dmat_ - la etiqueta
ru: _dmat_ - тег

source: _vaddr_ - pointer to the storage for the kernel virtual address of the allocated area to be returned.
es: _vaddr_ - puntero al almacenamiento para la dirección virtual del núcleo del área reservada que será devuelta.
ru: _vaddr_ - указатель на хранилище для возвращаемого виртуального адреса ядра выделенной области.

source: flags - a bitmap of flags. The only interesting flag is:
es: flags - un mapa de bits de flags. El único flag interesante es:
ru: flags - битовая карта флагов. Единственный интересный флаг:

source: _BUS_DMA_NOWAIT_ - if the memory is not immediately available return the error. If this flag is not set then the routine is allowed to sleep until the memory becomes available.
es: _BUS_DMA_NOWAIT_ - si la memoria no está disponible inmediatamente devuelve el error. Si este flag no se usa entonces se permite dormir a la rutina hasta que la memoria esté disponible.
ru: _BUS_DMA_NOWAIT_ - если память недоступна немедленно, вернуть ошибку. Если этот флаг не установлен, то процедуре разрешено ожидать до тех пор, пока память не станет доступной.

source: _mapp_ - pointer to the storage for the new map to be returned.
es: _mapp_ - puntero al almacenamiento para el nuevo mapa que será devuelto.
ru: _mapp_ - указатель на хранилище для возвращаемой новой карты.

source: Free the memory allocated by `bus_dmamem_alloc()`. At present, freeing of the memory allocated with ISA restrictions is not implemented. Due to this the recommended model of use is to keep and re-use the allocated areas for as long as possible. Do not lightly free some area and then shortly allocate it again. That does not mean that `bus_dmamem_free()` should not be used at all: hopefully it will be properly implemented soon.
es: Libera la memoria reservada por `bus_dmamem_alloc()`. En este momento, liberar la memoria reservada con restricciones ISA no está implementado. Debido a esto el modo de uso recomendado es mantener y reutilizar las áreas reservadas tanto tiempo como sea posible. No liberes áreas alegremente y luego vuelvas a reservarlas. Eso no significa que `bus_dmamem_free()`no deba usarse nunca: con suerte será implementada pronto.
ru: Освободить память, выделенную `bus_dmamem_alloc()`. В настоящее время освобождение памяти, выделенной с ограничениями ISA, не реализовано. В связи с этим рекомендуется сохранять и повторно использовать выделенные области как можно дольше. Не следует без необходимости освобождать область и вскоре снова её выделять. Это не означает, что `bus_dmamem_free()` не следует использовать вовсе: есть надежда, что вскоре она будет реализована должным образом.

source: _vaddr_ - the kernel virtual address of the memory
es: _vaddr_ - la dirección virtual del núcleo para la memoria
ru: _vaddr_ - виртуальный адрес памяти ядра

source: _map_ - the map of the memory (as returned from `bus_dmamem_alloc()`)
es: _map_ - el mapa de memoria (como lo devuelve `bus_dmamem_alloc()`)
ru: _map_ - карта памяти (как возвращается из `bus_dmamem_alloc()`)

source: Create a map for the tag, to be used in `bus_dmamap_load()` later. Returns 0 on success, the error code otherwise.
es: Crea un mapa para la etiqueta, para ser usado después en `bus_dmamap_load()`. Devuelve 0 en caso de éxito, el código de error en caso contrario.
ru: Создать карту для тега, которая будет использоваться в `bus_dmamap_load()` позже. Возвращает 0 при успехе, в противном случае — код ошибки.

source: _flags_ - theoretically, a bit map of flags. But no flags are defined yet, so at present it will be always 0.
es: _flags_ - en teoría, un mapa de bits de flags. Pero no hay flags definidos todavía, así que actualmente será siempre 0.
ru: _flags_ - теоретически, битовая карта флагов. Однако пока никакие флаги не определены, поэтому в настоящее время значение всегда будет 0.

source: _mapp_ - pointer to the storage for the new map to be returned
es: _mapp_ - puntero al almacenamiento para el nuevo mapa que será devuelto
ru: _mapp_ - указатель на хранилище для новой карты, которая будет возвращена

source: Destroy a map. Returns 0 on success, the error code otherwise.
es: Destruye un mapa. Devuelve 0 en caso de éxito, el código de error en caso contrario.
ru: Уничтожить карту. Возвращает 0 при успехе, в противном случае — код ошибки.

source: dmat - the tag to which the map is associated
es: dmat - la etiqueta a la que está asociado el mapa
ru: dmat - тег, с которым ассоциирована карта

source: map - the map to be destroyed
es: map - el mapa a destruir
ru: map - карта, подлежащая уничтожению

source: Load a buffer into the map (the map must be previously created by `bus_dmamap_create()` or `bus_dmamem_alloc()`). All the pages of the buffer are checked for conformance to the tag requirements and for those not conformant the bounce pages are allocated. An array of physical segment descriptors is built and passed to the callback routine. This callback routine is then expected to handle it in some way. The number of bounce buffers in the system is limited, so if the bounce buffers are needed but not immediately available the request will be queued and the callback will be called when the bounce buffers will become available. Returns 0 if the callback was executed immediately or `EINPROGRESS` if the request was queued for future execution. In the latter case the synchronization with queued callback routine is the responsibility of the driver.
es: Carga un búfer en el mapa (el mapa debe haber sido creado previamente con `bus_dmamap_create()` o `bus_dmamem_alloc()`). Se comprueban todos los búfers para asegurar que siguen los requisitos de la etiqueta y para aquellos que no lo hacen se reservan páginas "bounce". Un array de descriptores de segmentos físicos es construido y pasado a la rutina de callback. Se espera que esta rutina de callback lo maneje de alguna forma. El número de búfers "bounce" en el sistema está limitado, así que si los búfers "bounce" son necesarios pero no están disponibles inmediatamente se encolará la solicitud y el callback se llamará cuando estén disponibles. Devuelve 0 si el callback se ejecutó inmediatamente o `EINPROGRESS` si la solicitud fue encolada para ejecutarse más tarde. En este último caso la sincronización con la rutina de callback es responsabilidad del controlador.
ru: Загрузить буфер в карту (карта должна быть предварительно создана с помощью `bus_dmamap_create()` или `bus_dmamem_alloc()`). Все страницы буфера проверяются на соответствие требованиям тега, и для несоответствующих выделяются промежуточные страницы. Создается массив дескрипторов физических сегментов и передается в подпрограмму обратного вызова. Ожидается, что эта подпрограмма обработает его каким-либо образом. Количество промежуточных буферов в системе ограничено, поэтому, если эти буферы требуются, но недоступны немедленно, запрос будет поставлен в очередь, и обратный вызов будет выполнен, когда промежуточные буферы станут доступны. Возвращает 0, если обратный вызов был выполнен немедленно, или `EINPROGRESS`, если запрос был поставлен в очередь для выполнения в будущем. В последнем случае синхронизация с подпрограммой обратного вызова, поставленной в очередь, является обязанностью драйвера.

source: _map_ - the map
es: _map_ - el mapa
ru: _map_ - карта

source: _buf_ - kernel virtual address of the buffer
es: _buf_ - dirección virtual del núcleo para el búfer
ru: _buf_ - виртуальный адрес буфера в пространстве ядра

source: _buflen_ - length of the buffer
es: _buflen_ - longitud del búfer
ru: _buflen_ - длина буфера

source: _callback_, `callback_arg` - the callback function and its argument
es: _callback_, `callback_arg` - la función de callback y su argumento
ru: _callback_, `callback_arg` - функция обратного вызова и её аргумент

source: The prototype of callback function is: `void callback(void *arg, bus_dma_segment_t *seg, int nseg, int error)`
es: El prototipo de la función de callback es: `void callback(void *arg, bus_dma_segment_t *seg, int nseg, int error)`
ru: Прототип функции обратного вызова: `void callback(void *arg, bus_dma_segment_t *seg, int nseg, int error)`

source: _arg_ - the same as callback_arg passed to `bus_dmamap_load()`
es: _arg_ - el mismo que callback_arg que se pasa a `bus_dmamap_load()`
ru: _arg_ - то же самое, что и callback_arg, переданный в `bus_dmamap_load()`

source: _seg_ - array of the segment descriptors
es: _seg_ - array de descriptores de segmento
ru: _seg_ - массив дескрипторов сегментов

source: _nseg_ - number of descriptors in array
es: _nseg_ - número de descriptores en el array
ru: _nseg_ - количество дескрипторов в массиве

source: _error_ - indication of the segment number overflow: if it is set to `EFBIG` then the buffer did not fit into the maximal number of segments permitted by the tag. In this case only the permitted number of descriptors will be in the array. Handling of this situation is up to the driver: depending on the desired semantics it can either consider this an error or split the buffer in two and handle the second part separately
es: _error_ - indicación de desbordamiento del número de segmento: si se establece a `EFBIG` entonces el búfer no entró dentro del máximo número de segmentos permitido por la etiqueta. En este caso sólo el número de descriptores permitidos estará en el array. Manejar esta situación es cosa del controlador: dependiendo de la semántica que se quiere se puede considerar un error o partir el búfer en dos y manejar la segunda parte de forma separada
ru: _error_ - указание на переполнение номера сегмента: если установлено значение `EFBIG`, значит буфер не поместился в максимальное количество сегментов, разрешённых тегом. В этом случае в массиве будет только разрешённое количество дескрипторов. Обработка этой ситуации зависит от драйвера: в зависимости от желаемой семантики он может либо считать это ошибкой, либо разделить буфер на две части и обработать вторую часть отдельно

source: Each entry in the segments array contains the fields:
es: Cada entrada en el array de segmentos contiene los campos:
ru: Каждая запись в массиве segments содержит поля:

source: _ds_addr_ - physical bus address of the segment
es: _ds_addr_ - dirección física del bus para el segmento
ru: _ds_addr_ - физический адрес шины сегмента

source: _ds_len_ - length of the segment
es: _ds_len_ - longitud del segmento
ru: _ds_len_ - длина сегмента

source: unload the map.
es: descarga un mapa.
ru: выгрузить карту.

source: _dmat_ - tag
es: _dmat_ - etiqueta
ru: _dmat_ - тег

source: _map_ - loaded map
es: _map_ - mapa cargado
ru: _map_ - загруженная карта

source: Synchronise a loaded buffer with its bounce pages before and after physical transfer to or from device. This is the function that does all the necessary copying of data between the original buffer and its mapped version. The buffers must be synchronized both before and after doing the transfer.
es: Sincroniza un búfer cargado con sus páginas "bounce" antes y después de una transferencia física a o desde el dispositivo. Esta es la función que hace todas las copias de datos necesarias entre el búfer original y su versión mapeada. Los búfers deben ser sincronizados tanto antes como después de la transferencia.
ru: Синхронизировать загруженный буфер с его промежуточными страницами до и после физической передачи на устройство или с устройства. Это функция, которая выполняет все необходимое копирование данных между исходным буфером и его отображенной версией. Буферы должны быть синхронизированы как до, так и после выполнения передачи.

source: _op_ - type of synchronization operation to perform:
es: _op_ - la operación de sincronización a realizar:
ru: _op_ - тип операции синхронизации для выполнения:

source: `BUS_DMASYNC_PREREAD` - before reading from device into buffer
es: `BUS_DMASYNC_PREREAD` - antes de leer desde el dispositivo y hacia el búfer
ru: `BUS_DMASYNC_PREREAD` - перед чтением с устройства в буфер

source: `BUS_DMASYNC_POSTREAD` - after reading from device into buffer
es: `BUS_DMASYNC_POSTREAD` - después de leer desde el dispositivo hacia el búfer
ru: `BUS_DMASYNC_POSTREAD` - после чтения из устройства в буфер

source: `BUS_DMASYNC_PREWRITE` - before writing the buffer to device
es: `BUS_DMASYNC_PREWRITE` - antes de escribir el búfer en el dispositivo
ru: `BUS_DMASYNC_PREWRITE` - перед записью буфера в устройство

source: `BUS_DMASYNC_POSTWRITE` - after writing the buffer to device
es: `BUS_DMASYNC_POSTWRITE` - después de escribir el búfer en el dispositivo
ru: `BUS_DMASYNC_POSTWRITE` - после записи буфера в устройство

source: As of now PREREAD and POSTWRITE are null operations but that may change in the future, so they must not be ignored in the driver. Synchronization is not needed for the memory obtained from `bus_dmamem_alloc()`.
es: Actualmente PREREAD y POSTWRITE son operaciones null pero esto podría cambiar en el futuro, de forma que no deben ignorarse en el controlador. La sincronización no es necesaria para la memoria obtenida mediante `bus_dmamem_alloc()`.
ru: На данный момент PREREAD и POSTWRITE являются пустыми операциями, но это может измениться в будущем, поэтому их нельзя игнорировать в драйвере. Синхронизация не требуется для памяти, полученной из `bus_dmamem_alloc()`.
