Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: Normally drivers do not set up the interrupt handlers until the attach routine. Instead they do probes in the polling mode using the `DELAY()` function for timeout. The probe routine must never hang forever, all the waits for the device must be done with timeouts. If the device does not respond within the time it is probably broken or misconfigured and the driver must return error. When determining the timeout interval give the device some extra time to be on the safe side: although `DELAY()` is supposed to delay for the same amount of time on any machine it has some margin of error, depending on the exact CPU.
es: Normalmente los controladores con configuran manejadores de interrupción hasta la rutina de adjuntar. En su lugar sondean en modo encuesta usando la función `DELAY()` como timeout. La rutina de sondeo nunca debe esperar para siempre, todas las esperas del dispositivo deben hacerse con timeouts. Si el dispositivo no responde dentro del tiempo está probablemente roto o mal configurado y el controlador debe devolver error. Cuando determines el intervalo de timeout concede algo de tiempo extra el dispositivo para asegurarte: aunque se supone que `DELAY()` debe esperar la misma cantidad de tiempo en cualquier máquina tiene algo de margen de error, dependiendo de la CPU exacta.
ru: Обычно драйверы не настраивают обработчики прерываний до вызова процедуры присоединения. Вместо этого они выполняют проверки в режиме опроса, используя функцию `DELAY()` для таймаута. Процедура проверки никогда не должна зависать навсегда, все ожидания ответа от устройства должны выполняться с таймаутами. Если устройство не отвечает в течение заданного времени, вероятно, оно неисправно или неправильно настроено, и драйвер должен вернуть ошибку. При определении интервала таймаута следует давать устройству дополнительное время для надежности: хотя предполагается, что `DELAY()` задерживает выполнение на одинаковое время на любой машине, существует некоторая погрешность, зависящая от конкретного процессора.

source: If the probe routine really wants to check that the interrupts really work it may configure and probe the interrupts too. But that is not recommended.
es: Si la rutina de sondeo realmente quiere comprobar que las interrupciones funcionan puede configurar y sondear las interrupciones. Pero no se recomienda.
ru: Если процедура проверки действительно хочет убедиться, что прерывания работают, она может также настроить и провести обнаружение прерываний. Однако это не рекомендуется.

source: The function `xxx_probe_ports()` may also set the device description depending on the exact model of device it discovers. But if there is only one supported device model this can be as well done in a hardcoded way. Of course, for the PnP devices the PnP support sets the description from the table automatically.
es: La función `xxx_probe_ports()`también puede establecer la descripción del dispositivo dependiendo del modelo exacto que descubre. Pero si sólo hay un modelo de dispositivo soportado también se puede establecer estáticamente. Por supuesto, para los dispositivos PnP el soporte de PnP establece la descripción desde la tabla automáticamente.
ru: Функция `xxx_probe_ports()` также может устанавливать описание устройства в зависимости от конкретной модели обнаруженного устройства. Но если поддерживается только одна модель устройства, это можно сделать и жёстко заданным способом. Конечно, для PnP-устройств поддержка PnP автоматически устанавливает описание из таблицы.

source: Then the probe routine should either discover the ranges of all the resources by reading the device configuration registers or make sure that they were set explicitly by the user. We will consider it with an example of on-board memory. The probe routine should be as non-intrusive as possible, so allocation and check of functionality of the rest of resources (besides the ports) would be better left to the attach routine.
es: Después la rutina de sondeo debería descubrir los rangos de todos los recursos mediante la lectura de los registros de configuración del dispositivo o asegurarse de que fueron configurados explícitamente por el usuario. Lo consideraremos con el ejemplo de una memoria. La rutina de sondeo debería ser lo menos intrusiva posible, de forma que la reserva y comprobación de funcionalidad y resto de recursos (aparte de los puertos) sería mejor dejarlos para la rutina de adjuntar.
ru: Затем процедура обнаружения должна либо определить диапазоны всех ресурсов, читая регистры конфигурации устройства, либо убедиться, что они были явно заданы пользователем. Мы рассмотрим это на примере встроенной памяти. Процедура обнаружения должна быть как можно менее навязчивой, поэтому выделение и проверку функциональности остальных ресурсов (кроме портов) лучше оставить для процедуры присоединения.

source: The memory address may be specified in the kernel configuration file or on some devices it may be pre-configured in non-volatile configuration registers. If both sources are available and different, which one should be used? Probably if the user bothered to set the address explicitly in the kernel configuration file they know what they are doing and this one should take precedence. An example of implementation could be:
es: La dirección de memoria puede ser especificada en el fichero de configuración del núcleo o en algunos dispositivos puede estar preconfigurada en registros de configuración no volátiles. Si ambas fuentes están disponibles y son distintas, ¿cuál se debería usar? Probablemente si el usuario se ha molestado en establecer la dirección explícitamente en el fichero de configuración del núcleo entonces sabe lo que está haciendo y éste debería tomar precedencia. Un ejemplo de implementación podría ser:
ru: Адрес памяти может быть указан в конфигурационном файле ядра, а на некоторых устройствах он может быть предварительно настроен в энергонезависимых конфигурационных регистрах. Если доступны оба источника, и они различаются, какой из них следует использовать? Вероятно, если пользователь явно указал адрес в конфигурационном файле ядра, он знает, что делает, и этот адрес должен иметь приоритет. Пример реализации может выглядеть так:

source: Resources for IRQ and DRQ are easy to check by analogy.
es: Los recursos para las IRQ y DRQ son fáciles de comprobar de forma análoga.
ru: Ресурсы для IRQ и DRQ легко проверить по аналогии.

source: If all went well then release all the resources and return success.
es: Si todo fue bien entonces libera todos los recursos y devuelve éxito.
ru: Если всё прошло успешно, то освободите все ресурсы и верните успешный статус.

source: Finally, handle the troublesome situations. All the resources should be deallocated before returning. We make use of the fact that before the structure softc is passed to us it gets zeroed out, so we can find out if some resource was allocated: then its descriptor is non-zero.
es: Por último, maneja las situaciones problemáticas. Todos los recursos se deberían liberar antes de volver. Utilizamos el echo de que la estructura softc que se nos pasa está inicializada a cero, de forma que podemos averiguar si algún recurso ha sido reservado: entonces su descriptor es distinto de cero.
ru: Наконец, обработайте проблемные ситуации. Все ресурсы должны быть освобождены перед возвратом. Мы используем тот факт, что перед передачей нам структуры `softc` она обнуляется, поэтому мы можем определить, был ли выделен какой-либо ресурс: если его дескриптор не равен нулю.

source: That would be all for the probe routine. Freeing of resources is done from multiple places, so it is moved to a function which may look like:
es: Eso sería todo para la rutina de comprobación. La liberación de los recursos se hace desde distintos sitios, de forma que se mueve a una función que podría parecerse a esta:
ru: Вот и всё для процедуры обнаружения. Освобождение ресурсов выполняется из нескольких мест, поэтому оно вынесено в функцию, которая может выглядеть так:

source: The attach routine actually connects the driver to the system if the probe routine returned success and the system had chosen to attach that driver. If the probe routine returned 0 then the attach routine may expect to receive the device structure softc intact, as it was set by the probe routine. Also if the probe routine returns 0 it may expect that the attach routine for this device shall be called at some point in the future. If the probe routine returns a negative value then the driver may make none of these assumptions.
es: La rutina de adjuntar conecta el controlador al sistema si la rutina de sondeo devolvió éxito y si el sistema ha escogido adjuntar el controlar. Si la rutina de sondeo devolvió 0 entonces la rutina puede esperar recibir una estructura de dispositivo softc intacta, tal como ha sido configurada por la rutina de sondeo. Además si la rutina de sondeo devuelve 0 puede esperar que la rutina de adjuntar para este dispositivo se llame en algún momento en el futuro. Si la rutina de sondeo devuelve un valor negativo entonces el controlador no puede asumir ninguna de estas cosas.
ru: Процедура присоединения фактически подключает драйвер к системе, если процедура обнаружения вернула успех, и система решила подключить этот драйвер. Если процедура обнаружения вернула 0, то процедура присоединения может ожидать, что получит структуру устройства `softc` в неизменном виде, как она была установлена процедурой обнаружения. Также, если обнаружение возвращает 0, она можно ожидать, что процедура присоединения для этого устройства будет вызвана в какой-то момент в будущем. Если процедура обнаружения возвращает отрицательное значение, то драйвер не может делать никаких из этих предположений.

source: The attach routine returns 0 if it completed successfully or error code otherwise.
es: La rutina de adjuntar devuelve 0 si ha finalizado correctamente y devuelve un error en caso contrario.
ru: Процедура присоединение возвращает 0 при успешном завершении или код ошибки в противном случае.

source: The attach routine starts just like the probe routine, with getting some frequently used data into more accessible variables.
es: La rutina de adjuntar comienza como cualquier otra rutina de comprobación, obteniendo datos accedidos frecuentemente y guardándolos en variables más accesibles.
ru: Процедура присоединения начинается так же, как и процедура обнаружения, с помещения часто используемых данных в более доступные переменные.

source: Then allocate and activate all the necessary resources. As normally the port range will be released before returning from probe, it has to be allocated again. We expect that the probe routine had properly set all the resource ranges, as well as saved them in the structure softc. If the probe routine had left some resource allocated then it does not need to be allocated again (which would be considered an error).
es: Después reserva y activa todos los recursos necesarios. Como en general el rango de puertos será liberado antes de volver del sondeo, tiene que ser reservado de nuevo. Esperamos que la rutina de sondeo haya establecido correctamente todos los rangos de recursos, así como haberlos salvado en la estructura softc. Si la rutina de sondeo ha dejado algunos recursos reservados entonces no tiene que reservarlos de nuevo (lo que sería considerado un error).
ru: Затем выделите и активируйте все необходимые ресурсы. Обычно диапазон портов освобождается перед возвратом из обнаружения, поэтому его необходимо выделить снова. Мы предполагаем, что процедура обнаружения корректно установила все диапазоны ресурсов, а также сохранила их в структуре softc. Если процедура обнаружения оставила некоторые ресурсы выделенными, то их не нужно выделять снова (это будет считаться ошибкой).

source: The DMA request channel (DRQ) is allocated likewise. To initialize it use functions of the `isa_dma*()` family. For example:
es: El canal de peticiones de DMA (DRQ) se reserva del mismo modo. Para inicializarlo utiliza funciones de la familia de `isa_dma*()`. Por ejemplo:
ru: Канал запроса DMA (DRQ) выделяется аналогично. Для его инициализации используйте функции семейства `isa_dma*()`. Например:

source: The interrupt request line (IRQ) is a bit special. Besides allocation the driver's interrupt handler should be associated with it. Historically in the old ISA drivers the argument passed by the system to the interrupt handler was the device unit number. But in modern drivers the convention suggests passing the pointer to structure softc. The important reason is that when the structures softc are allocated dynamically then getting the unit number from softc is easy while getting softc from the unit number is difficult. Also this convention makes the drivers for different buses look more uniform and allows them to share the code: each bus gets its own probe, attach, detach and other bus-specific routines while the bulk of the driver code may be shared among them.
es: La línea de petición de interrupción (IRQ) es un poco especial. Además de la asignación el manejador de interrupción del controlador debería estar asociado a ella. Históricamente en los controladores ISA antiguos el argumento que el sistema pasaba al manejador de interrupción era el número de unidad del dispositivo. Pero en controladores modernos la convención sugiere pasar un puntero a la estructura softc. La razón importante es que cuando las structuras softc son asignadas dinámicamente obtener el número a partir de softc es fácil mientras que obtener softc a partir del número de unidad es difícil. Además esta convención hace que los controladores de los diferentes buses parezcan más uniformes y les permite compartir código: cada bus tiene su propio sondeo, adjuntar, liberar y otras rutinas de bus específicas mientras que el grueso del código del controlador puede estar compartido entre ellos.
ru: Строка запроса прерывания (IRQ) является особенной. Помимо выделения, обработчик прерывания драйвера должен быть связан с ней. Исторически в старых драйверах ISA аргумент, передаваемый системой обработчику прерывания, был номером устройства. Однако в современных драйверах принято передавать указатель на структуру `softc`. Важная причина этого заключается в том, что когда структуры `softc` выделяются динамически, получение номера устройства из `softc` является простым, в то время как получение `softc` из номера устройства затруднительно. Кроме того, такое соглашение делает драйверы для различных шин более однородными и позволяет им совместно использовать код: каждая шина получает свои собственные процедуры обнаружения, присоединения, отсоединения и другие специфичные для шины функции, в то время как основная часть кода драйвера может быть общей для них.

source: If the device needs to make DMA to the main memory then this memory should be allocated like described before:
es: Si el dispositivo necesita hacer DMA a la memoria principal entonces esta memoria se debería asignar como se describe anteriormente:
ru: Если устройству необходимо выполнять DMA в основную память, то эта память должна быть выделена, как описано ранее:

source: After all the necessary resources are allocated the device should be initialized. The initialization may include testing that all the expected features are functional.
es: Después de que todos los recursos necesarios estén asignados el dispositivo se debería inicializar. La inicialización podría incluir la comprobación de que todas las características esperadas son funcionales.
ru: После выделения всех необходимых ресурсов устройство должно быть инициализировано. Инициализация может включать проверку работоспособности всех ожидаемых функций.

source: The bus subsystem will automatically print on the console the device description set by probe. But if the driver wants to print some extra information about the device it may do so, for example:
es: El subsistema del bus imprimirá automáticamente en la consola la descripción del dispositivo establecida mediante el sondeo. Pero si un controlador quiere imprimir información extra acerca del dispositivo puede hacerlo, por ejemplo:
ru: Подсистема шины автоматически выводит на консоль описание устройства, установленное при проверке. Однако, если драйвер хочет вывести дополнительную информацию об устройстве, он может это сделать, например:

source: If the initialization routine experiences any problems then printing messages about them before returning error is also recommended.
es: Si la rutina de inicialización sufre algún problema entonces también es recomendable imprimir mensajes sobre ellos antes de devolver error.
ru: Если в процессе выполнения инициализации возникают какие-либо проблемы, рекомендуется выводить сообщения об этих проблемах перед возвратом ошибки.

source: The final step of the attach routine is attaching the device to its functional subsystem in the kernel. The exact way to do it depends on the type of the driver: a character device, a block device, a network device, a CAM SCSI bus device and so on.
es: El paso final de la rutina de adjuntar es adjuntar el dispositivo al su subsistema funcional en el núcleo. La forma exacta de hacerlo depende del tipo de controlador: un dispositivo de caracteres, un dispositivo de bloques, un dispositivo de red, un dispositivo de bus CAM SCSI y así.
ru: Последним шагом процедуры присоединения является подключение устройства к его функциональной подсистеме в ядре. Конкретный способ зависит от типа драйвера: символьное устройство, блочное устройство, сетевое устройство, устройство шины CAM SCSI и так далее.

source: If all went well then return success.
es: Si todo ha ido bien entonces devuelve éxito.
ru: Если всё прошло успешно, вернуть успех.

source: Finally, handle the troublesome situations. All the resources should be deallocated before returning an error. We make use of the fact that before the structure softc is passed to us it gets zeroed out, so we can find out if some resource was allocated: then its descriptor is non-zero.
es: Por último, maneja las situaciones problemáticas. Todos los recursos deberían ser desasignados antes de devolver un error. Utilizamos el hecho de que la estructura softc se pone a cero antes de que se nos pase, de forma que podemos averiguar si se ha asignado algún recurso: entonces su descriptor no es cero.
ru: Наконец, обработаем проблемные ситуации. Все ресурсы должны быть освобождены перед возвратом ошибки. Мы используем тот факт, что перед передачей структуры `softc` она обнуляется, поэтому мы можем определить, был ли выделен какой-либо ресурс: если его дескриптор ненулевой.

source: That would be all for the attach routine.
es: Eso sería todo para la rutina de adjuntar.
ru: Вот и всё для процедуры присоединения.

source: If this function is present in the driver and the driver is compiled as a loadable module then the driver gets the ability to be unloaded. This is an important feature if the hardware supports hot plug. But the ISA bus does not support hot plug, so this feature is not particularly important for the ISA devices. The ability to unload a driver may be useful when debugging it, but in many cases installation of the new version of the driver would be required only after the old version somehow wedges the system and a reboot will be needed anyway, so the efforts spent on writing the detach routine may not be worth it. Another argument that unloading would allow upgrading the drivers on a production machine seems to be mostly theoretical. Installing a new version of a driver is a dangerous operation which should never be performed on a production machine (and which is not permitted when the system is running in secure mode). Still, the detach routine may be provided for the sake of completeness.
es: Si esta función está presente en el controlador y éste está compilado como un módulo cargable entonces el controlador tiene la habilidad de ser descargado. Esta es una característica importante si el hardware soporta ser enchufado en caliente. Pero el bus ISA no soporta enchufes en caliente, así que esta característica no es particularmente importante para los dispositivos ISA. La habilidad para descargar un controlador podría ser útil al depurar, pero en muchos casos la instalación de una nueva versión del controlador sólo sería requerida si de algún modo la antigua versión del hace que se necesite reiniciar, de forma que los esfuerzos en escribir la rutina de desadjuntar podrían no merecer la pena. Argumentar que la descarga permitiría actualizar los controladores en una máquina de producción parece más bien teórico. Instalar una nueva versión de un controlador es una operación peligrosa que nunca se debería hacer en una máquina en producción (y que no se permite cuando el sistema está corriendo en modo seguro). Aún así, la rutina de desadjuntar podría proporcionarse por consistencia.
ru: Если эта функция присутствует в драйвере и драйвер скомпилирован как загружаемый модуль, то драйвер получает возможность быть выгруженным. Это важная функция, если оборудование поддерживает горячее подключение. Однако шина ISA не поддерживает горячее подключение, поэтому эта функция не особенно важна для устройств ISA. Возможность выгрузки драйвера может быть полезна при его отладке, но во многих случаях установка новой версии драйвера потребуется только после того, как старая версия каким-то образом заблокирует систему и перезагрузка все равно будет необходима, поэтому усилия, затраченные на написание процедуры отсоединения, могут не окупиться. Другой аргумент, что выгрузка позволит обновлять драйверы на рабочей машине, кажется в основном теоретическим. Установка новой версии драйвера — это опасная операция, которую никогда не следует выполнять на рабочей машине (и которая не разрешена, когда система работает в безопасном режиме). Тем не менее, процедура отсоединения может быть предоставлена для полноты.

source: The detach routine returns 0 if the driver was successfully detached or the error code otherwise.
es: La rutina de desadjuntar devuelve 0 si el controlador se desadjuntó correctamente o el código de error en caso contrario.
ru: Процедура отсоединения возвращает 0, если драйвер был успешно отсоединён, или код ошибки в противном случае.

source: The logic of detach is a mirror of the attach. The first thing to do is to detach the driver from its kernel subsystem. If the device is currently open then the driver has two choices: refuse to be detached or forcibly close and proceed with detach. The choice used depends on the ability of the particular kernel subsystem to do a forced close and on the preferences of the driver's author. Generally the forced close seems to be the preferred alternative.
es: La lógica para desadjuntar es un espejo de la de adjuntar. Lo primero que se hace es desconectar el controlador del subsistema del núcleo. Si el dispositivo está abierto el controlador tiene dos opciones: oponerse a ser desconectado o forzar que se cierre y proseguir. La opción depende de la habilidad de un subsistema particular del núcleo para hacer un cierre forzado según las preferencias del autor del controlador. Normalmente forzar el cierre parece ser la alternativa preferida.
ru: Логика отсоединения является зеркальной по отношению к присоединению. Первое, что нужно сделать, — это отсоединить драйвер от его подсистемы ядра. Если устройство в настоящее время открыто, у драйвера есть два варианта: отказаться от отсоединения или принудительно закрыть устройство и продолжить отсоединение. Выбор зависит от возможности конкретной подсистемы ядра выполнить принудительное закрытие и от предпочтений автора драйвера. Как правило, принудительное закрытие кажется предпочтительным вариантом.
