Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: _RF_SHAREABLE_ - resource may be shared at the same time by multiple drivers.
es: _RF_SHAREABLE_ - el recurso puede ser compartido al mismo tiempo por varios controladores.
ru: _RF_SHAREABLE_ - ресурс может использоваться одновременно несколькими драйверами.

source: _RF_TIMESHARE_ - resource may be time-shared by multiple drivers, i.e., allocated at the same time by many but activated only by one at any given moment of time.
es: _RF_TIMESHARE_ - el recurso puede ser de tiempo compartido por varios controladores, es decir, asignado al mismo tiempo por muchos pero activado sólo por uno en un momento dado.
ru: _RF_TIMESHARE_ - ресурс может разделяться по времени несколькими драйверами, т.е. выделяться одновременно многими, но активироваться только одним в любой момент времени.

source: Returns 0 on error. The allocated values may be obtained from the returned handle using methods `rhand_*()`.
es: Devuelve 0 en caso de error. Los valores asignados se pueden obtener del manejador devuelto usando los métodos `rhand_*()`.
ru: Возвращает 0 при ошибке. Выделенные значения могут быть получены из возвращённого дескриптора с использованием методов `rhand_*()`.

source: Release the resource, r is the handle returned by `bus_alloc_resource()`. Returns 0 on success, error code otherwise.
es: Libera el recurso, r es el manejador devuelto por `bus_alloc_resource()`. Devuelve 0 en caso de éxito, un código de error en caso contrario.
ru: Освобождает ресурс, r — это дескриптор, возвращённый `bus_alloc_resource()`. Возвращает 0 при успехе, код ошибки в противном случае.

source: Activate or deactivate resource. Return 0 on success, error code otherwise. If the resource is time-shared and currently activated by another driver then `EBUSY` is returned.
es: Activa o desactiva un recurso. Devuelve 0 en caso de éxito, un código de error en caso contrario. Si el recurso es de tiempo compartido y actualmente está activado por otro controlador entonces se devuelve `EBUSY`.
ru: Активирует или деактивирует ресурс. Возвращает 0 при успехе, в противном случае — код ошибки. Если ресурс разделяемый и в данный момент активирован другим драйвером, возвращается `EBUSY`.

source: Associate or de-associate the interrupt handler with a device. Return 0 on success, error code otherwise.
es: Asocia o elimina la asociación de un manejador de interrupciones con un dispositivo. Devuelve 0 en caso de éxito, un código de error en caso contrario.
ru: Связывает или разрывает связь обработчика прерывания с устройством. Возвращает 0 при успехе, код ошибки в противном случае.

source: r - the activated resource handler describing the IRQ
es: r - el manejador del recurso activado que describe la IRQ
ru: r - активированный обработчик ресурсов, описывающий IRQ

source: flags - the interrupt priority level, one of:
es: flags - el nivel de prioridad de la interrupción, uno de:
ru: flags - уровень приоритета прерывания, один из:

source: `INTR_TYPE_TTY` - terminals and other likewise character-type devices. To mask them use `spltty()`.
es: `INTR_TYPE_TTY` - terminales y otros dispositivos tipo carácter. Para enmascaracrlos utiliza `spltty()`.
ru: `INTR_TYPE_TTY` - терминалы и другие аналогичные символьные устройства. Для их маскировки используйте `spltty()`.

source: `(INTR_TYPE_TTY | INTR_TYPE_FAST)` - terminal type devices with small input buffer, critical to the data loss on input (such as the old-fashioned serial ports). To mask them use `spltty()`.
es: `(INTR_TYPE_TTY | INTR_TYPE_FAST)` - dispositivos tipo terminal con búfers de entrada pequeños, críticos respecto a la pérdida de datos de entrada (como los antiguos puertos serie). Para enmascararlos utiliza `spltty()`.
ru: `(INTR_TYPE_TTY | INTR_TYPE_FAST)` - терминальные устройства с малым буфером ввода, критичные к потере данных на входе (например, устаревшие последовательные порты). Для их маскирования используйте `spltty()`.

source: `INTR_TYPE_BIO` - block-type devices, except those on the CAM controllers. To mask them use `splbio()`.
es: `INTR_TYPE_BIO` - dispositivos de bloques, excepto aquellos en los controladores CAM. Para enmascararlos utiliza `splbio()`.
ru: `INTR_TYPE_BIO` - блочные устройства, за исключением тех, что подключены к контроллерам CAM. Для их маскирования используйте `splbio()`.

source: `INTR_TYPE_CAM` - CAM (Common Access Method) bus controllers. To mask them use `splcam()`.
es: `INTR_TYPE_CAM` - controladores de bus CAM (Common Access Method). Para enmascararlos utiliza `splcam()`.
ru: `INTR_TYPE_CAM` - контроллеры шины CAM (Common Access Method). Для их маскирования используйте `splcam()`.

source: `INTR_TYPE_NET` - network interface controllers. To mask them use `splimp()`.
es: `INTR_TYPE_NET` - controladores de interfaces de red. Para enmascararlos utiliza `splimp()`.
ru: `INTR_TYPE_NET` - контроллеры сетевых интерфейсов. Для их маскирования используйте `splimp()`.

source: `INTR_TYPE_MISC` - miscellaneous devices. There is no other way to mask them than by `splhigh()` which masks all interrupts.
es: `INTR_TYPE_MISC` - dispositivos varios. No hay otra forma de enmascararlos que no sea con `splhigh()` que enmascara todas las interrupciones.
ru: `INTR_TYPE_MISC` — прочие устройства. Нет другого способа их маскировки, кроме `splhigh()`, который маскирует все прерывания.

source: When an interrupt handler executes all the other interrupts matching its priority level will be masked. The only exception is the MISC level for which no other interrupts are masked and which is not masked by any other interrupt.
es: Cuando se ejecuta un manejador de interrupción todas las demás interrupciones que tengan su mismo nivel de prioridad serán enmascaradas. La única excepción es el nivel MISC para el cual no se enmascara ninguna otra interrupción y que no es enmascarado por ninguna otra interrupción.
ru: Когда обработчик прерывания выполняется, все другие прерывания, соответствующие его уровню приоритета, будут заблокированы. Единственное исключение — уровень MISC, для которого никакие другие прерывания не блокируются и который сам не блокируется другими прерываниями.

source: _handler_ - pointer to the handler function, the type driver_intr_t is defined as `void driver_intr_t(void *)`
es: _handler_ - puntero a la función del manejeador, el tipo driver_intr_t se define como `void driver_intr_t(void *)`
ru: _handler_ - указатель на функцию-обработчик, тип driver_intr_t определён как `void driver_intr_t(void *)`

source: _arg_ - the argument passed to the handler to identify this particular device. It is cast from void* to any real type by the handler. The old convention for the ISA interrupt handlers was to use the unit number as argument, the new (recommended) convention is using a pointer to the device softc structure.
es: _arg_ - el argumento pasado al menejador para identificar este dispositivo en particular. El manejador lo transforma desde void* a cualquier tipo real. La antigua convención para los menejadores de interrupción ISA era usar el número de unidad como argumento, la nueva (recomendada) convención es usar un puntero a la estructura softc del dispositivo.
ru: _arg_ - аргумент, передаваемый обработчику для идентификации конкретного устройства. Приводится обработчиком от void* к фактическому типу. Старая конвенция для обработчиков прерываний ISA предполагала использование номера устройства в качестве аргумента, новая (рекомендуемая) конвенция предполагает использование указателя на структуру softc устройства.

source: _cookie[p]_ - the value received from `setup()` is used to identify the handler when passed to `teardown()`
es: _cookie[p]_ - el valor recibido desde `setup()` se usa para identificar el manejador cuando se pasa a `teardown()`
ru: _cookie[p]_ - значение, полученное из `setup()`, используется для идентификации обработчика при передаче в `teardown()`

source: A number of methods are defined to operate on the resource handlers (struct resource *). Those of interest to the device driver writers are:
es: Un cierto número de métodos se definen para operar sobre los manejadores de recursos (struct resource *). Aquellos de interés para los creadores de controladores de dispositivos son:
ru: Определены несколько методов для работы с обработчиками ресурсов (struct resource *). Вот те из них, которые представляют интерес для разработчиков драйверов устройств:

source: `u_long rman_get_start(r) u_long rman_get_end(r)` Get the start and end of allocated resource range.
es: `u_long rman_get_start(r) u_long rman_get_end(r)` Obtener el comienzo y el final de un rango de recursos reservados.
ru: `u_long rman_get_start(r) u_long rman_get_end(r)` Получают начало и конец выделенного диапазона ресурсов.

source: `void *rman_get_virtual(r)` Get the virtual address of activated memory resource.
es: `void *rman_get_virtual(r)` Obtener la dirección virtual de un recurso de memoria activado.
ru: `void *rman_get_virtual(r)` Получает виртуальный адрес активированного ресурса памяти.

source: Bus Memory Mapping
es: Mapeo de Memoria del Bus
ru: Отображение памяти шины

source: In many cases data is exchanged between the driver and the device through the memory. Two variants are possible:
es: En muchos casos los datos se intercambian entre el controlador y el dispositivo a través de memoria. Hay dos posibles variantes:
ru: Во многих случаях данные передаются между драйвером и устройством через память. Возможны два варианта:

source: (a) memory is located on the device card
es: (a) la memoria está reservada en la tarjeta del dispositivo
ru: (а) память расположена на карте устройства

source: (b) memory is the main memory of the computer
es: (b) la memoria está en la memoria principal del ordenador
ru: (b) память — это основная память компьютера

source: In case (a) the driver always copies the data back and forth between the on-card memory and the main memory as necessary. To map the on-card memory into the kernel virtual address space the physical address and length of the on-card memory must be defined as a `SYS_RES_MEMORY` resource. That resource can then be allocated and activated, and its virtual address obtained using `rman_get_virtual()`. The older drivers used the function `pmap_mapdev()` for this purpose, which should not be used directly any more. Now it is one of the internal steps of resource activation.
es: En el caso (a) el controlador siempre copia los datos a y desde la memoria de la tarjeta y la memoria principal cuando sea necesario. Para mapear la memoria de la tarjeta en el espacio de direcciones virtuales del núcleo la dirección física y la longitud de la memoria de la tarjeta se tiene que definir como un recurso `SYS_RES_MEMORY`. Después el recurso puede ser reservado y activado, y su dirección virtual obtenida utilizando `rman_get_virtual()`. Los controladores antiguos usaban la función `pmap_mapdev()` para este propósito, que ya no debería ser usada directamente. Ahora es uno de los pasos internos de la activación de los recursos.
ru: В случае (a) драйвер всегда копирует данные между памятью на карте и основной памятью по мере необходимости. Для отображения памяти на карте в виртуальное адресное пространство ядра физический адрес и длина памяти на карте должны быть определены как ресурс `SYS_RES_MEMORY`. Этот ресурс может быть затем выделен и активирован, а его виртуальный адрес получен с помощью `rman_get_virtual()`. Более старые драйверы использовали для этой цели функцию `pmap_mapdev()`, которую больше не следует использовать напрямую. Теперь это один из внутренних шагов активации ресурса.

source: Most of the ISA cards will have their memory configured for physical location somewhere in range 640KB-1MB. Some of the ISA cards require larger memory ranges which should be placed somewhere under 16MB (because of the 24-bit address limitation on the ISA bus). In that case if the machine has more memory than the start address of the device memory (in other words, they overlap) a memory hole must be configured at the address range used by devices. Many BIOSes allow configuration of a memory hole of 1MB starting at 14MB or 15MB. FreeBSD can handle the memory holes properly if the BIOS reports them properly (this feature may be broken on old BIOSes).
es: La mayoría de las tarjetas ISA tendrán su memoria configurada para la dirección física en algún punto en el rango 640KB-1MB. Algunas tarjetas ISA requieren rangos de memoria más amplios que deberían situarse en algún punto por debajo de 16MB (por la limitación de los 24-bit de direccionamiento en el bus ISA). En ese caso si la máquina tiene más memoria que la dirección de inicio de la memoria del dispositivo (en otras palabras, se superponen) se tiene que configurar un agujero de memoria en el rango de direcciones usado por los dispositivos. Muchas BIOS permiten configurar un agujero de memoria de 1MB empezando en 14MB o 15 MB. FreeBSD puede manejar los agujeros de memoria de forma adecuada si la BIOS los reporta de forma apropiada (esta característica podría estar rota en BIOS antiguas).
ru: Большинство ISA-карт имеют память, настроенную на физическое расположение в диапазоне 640 КБ–1 МБ. Некоторые ISA-карты требуют большего диапазона памяти, который должен быть размещён ниже 16 МБ (из-за 24-битного ограничения адресации на шине ISA). В таком случае, если в машине больше памяти, чем начальный адрес памяти устройства (другими словами, они пересекаются), необходимо настроить "дыру" в памяти по диапазону адресов, используемому устройствами. Многие BIOS позволяют настроить "дыру" в памяти размером 1 МБ, начиная с 14 МБ или 15 МБ. FreeBSD корректно обрабатывает "дыры" в памяти, если BIOS правильно их сообщает (эта функция может не работать в старых BIOS).

source: In case (b) just the address of the data is sent to the device, and the device uses DMA to actually access the data in the main memory. Two limitations are present: First, ISA cards can only access memory below 16MB. Second, the contiguous pages in virtual address space may not be contiguous in physical address space, so the device may have to do scatter/gather operations. The bus subsystem provides ready solutions for some of these problems, the rest has to be done by the drivers themselves.
es: En el caso (b) sólo se pasa al dispositivo la dirección del dato, y el dispositivo utiliza DMA para acceder a los datos en la memoria principal. Hay dos limitaciones: Primero, las tarjetas ISA sólo pueden acceder a la memoria por debajo de 16MB. Segundo, las páginas que son contiguas en el espacio virtual de direcciones podrían no serlo en el espacio físico de direcciones, por lo que el dispositivo tiene que realizar operaciones scatter/gather. El subsistema del bus proporciona soluciones para algunos de estos problemas, el resto tienen que ser realizadas por los controladores mismos.
ru: В случае (b) только адрес данных отправляется на устройство, и устройство использует DMA для фактического доступа к данным в основной памяти. Существуют два ограничения: во-первых, карты ISA могут обращаться только к памяти ниже 16 МБ. Во-вторых, непрерывные страницы в виртуальном адресном пространстве могут не быть непрерывными в физическом адресном пространстве, поэтому устройству может потребоваться выполнять операции scatter/gather. Подсистема шины предоставляет готовые решения для некоторых из этих проблем, остальное должно быть реализовано самими драйверами.

source: Two structures are used for DMA memory allocation, `bus_dma_tag_t` and `bus_dmamap_t`. Tag describes the properties required for the DMA memory. Map represents a memory block allocated according to these properties. Multiple maps may be associated with the same tag.
es: Se usan dos estructuras para realizar la reserva de memoria de DMA, `bus_dma_tag_t` y `bus_dmamap_t`. La etiqueta describe las propiedades requeridas para la memoria DMA. El mapa representa un bloque de memoria reservado conforme a esas propiedades. Se pueden asociar múltiples mapas con la misma etiqueta.
ru: Для выделения памяти DMA используются две структуры: `bus_dma_tag_t` и `bus_dmamap_t`. Тег (`tag`) описывает свойства, необходимые для памяти DMA. Карта (`map`) представляет собой блок памяти, выделенный в соответствии с этими свойствами. С одним тегом может быть связано несколько карт.

source: Tags are organized into a tree-like hierarchy with inheritance of the properties. A child tag inherits all the requirements of its parent tag, and may make them more strict but never more loose.
es: Las etiquetas se organizan en una jerarquía tipo árbol con herencia de propiedades. Una etiqueta hija hereda todos los requisitos de su etiqueta padre, y puede hacerlas más estrictas pero nunca más relajadas.
ru: Теги организованы в иерархию в виде дерева с наследованием свойств. Дочерний тег наследует все требования родительского тега и может делать их более строгими, но никогда более мягкими.

source: Normally one top-level tag (with no parent) is created for each device unit. If multiple memory areas with different requirements are needed for each device then a tag for each of them may be created as a child of the parent tag.
es: Normalmente se crea una etiqueta de primer nivel (sin padre) para cada unidad de dispositivo. Si se necesitan múltiples áreas de memoria con diferentes requisitos para cada dispositivo entonces se puede crear una etiqueta para cada uno de ellos como hijas de la etiqueta padre.
ru: Обычно создается один корневой тег (без родителя) для каждого устройства. Если для каждого устройства требуется несколько областей памяти с разными требованиями, то для каждой из них может быть создан тег как дочерний по отношению к родительскому тегу.

source: The tags can be used to create a map in two ways.
es: Las etiquetas se pueden usar para crear mapas de dos formas.
ru: Теги могут быть использованы для создания карты двумя способами.

source: First, a chunk of contiguous memory conformant with the tag requirements may be allocated (and later may be freed). This is normally used to allocate relatively long-living areas of memory for communication with the device. Loading of such memory into a map is trivial: it is always considered as one chunk in the appropriate physical memory range.
es: Primero, se reserva un bloque contiguo de memoria (que luego puede ser liberado) que cumple con los requisitos de la etiqueta. Esto normalmente se usa para reservar áreas de memoria que van a tener una vida relativamente larga para comunicarse con el dispositivo. La carga de esa memoria en un mapa es trivial: siempre se considera como un sólo bloque en el rango físico de memoria apropiado.
ru: Сначала может быть выделен (а затем освобожден) блок непрерывной памяти, соответствующий требованиям тега. Обычно это используется для выделения относительно долгоживущих областей памяти для взаимодействия с устройством. Загрузка такой памяти в карту тривиальна: она всегда рассматривается как один блок в соответствующем диапазоне физической памяти.

source: Second, an arbitrary area of virtual memory may be loaded into a map. Each page of this memory will be checked for conformance to the map requirement. If it conforms then it is left at its original location. If it is not then a fresh conformant "bounce page" is allocated and used as intermediate storage. When writing the data from the non-conformant original pages they will be copied to their bounce pages first and then transferred from the bounce pages to the device. When reading the data would go from the device to the bounce pages and then copied to their non-conformant original pages. The process of copying between the original and bounce pages is called synchronization. This is normally used on a per-transfer basis: buffer for each transfer would be loaded, transfer done and buffer unloaded.
es: Segundo, se puede cargar en un mapa un área arbitraria de memoria virtual. Cada página de esta memoria se comprobará para ver si cumple con los requisitos del mapa. Si lo hace entonces se deja en su situación original. Si no entonces se reserva una página "bounce" que cumpla los requisitos y se usa como almacenamiento intermedio. Cuando se escriben datos desde las páginas originales se copiarán primero a las páginas "bounce" y luego serán transferidos de estas hasta el dispositivo. Cuando se lee los datos irían desde el dispositivo hasta las páginas "bounce" y después se copiarían a las páginas originales. El proceso de copiado entre las páginas originales y las páginas "bounce" se llama sincronización. Normalmente esto se usa en cada transferencia: se cargaría el búfer de cada transferencia, se realiza la transferencia y se descarga el búfer.
ru: Второй момент: произвольная область виртуальной памяти может быть загружена в карту. Каждая страница этой памяти будет проверяться на соответствие требованиям карты. Если она соответствует, то остается на своем исходном месте. Если нет, то выделяется новая соответствующая промежуточная страница (bounce page), которая используется как промежуточное хранилище. При записи данных с несоответствующих исходных страниц они сначала копируются на свои промежуточные страницы, а затем передаются с промежуточных страниц на устройство. При чтении данные поступают с устройства на промежуточные страницы, а затем копируются на свои несоответствующие исходные страницы. Процесс копирования между исходными и промежуточными страницами называется синхронизацией. Обычно это используется для каждой передачи: буфер для каждой передачи загружается, передача выполняется, и буфер выгружается.

source: The functions working on the DMA memory are:
es: Las funciones que trabajan con la memoria DMA son:
ru: Функции, работающие с памятью DMA:

source: Create a new tag. Returns 0 on success, the error code otherwise.
es: Crea una nueva etiqueta. Devuelve 0 en caso de éxito, el código de error en caso contrario.
ru: Создать новый тег. Возвращает 0 при успехе, код ошибки в противном случае.

source: _parent_ - parent tag, or NULL to create a top-level tag.
es: _parent_ - la etiqueta padre, o NULL para crear una etiqueta de primer nivel.
ru: _parent_ - родительский тег, или NULL для создания тега верхнего уровня.

source: _alignment_ - required physical alignment of the memory area to be allocated for this tag. Use value 1 for "no specific alignment". Applies only to the future `bus_dmamem_alloc()` but not `bus_dmamap_create()` calls.
es: _alignment_ - alineamiento físico requerido para el área de memoria que va a ser reservado para esta etiqueta. Usa el valor 1 para "ningún alineamiento específico". Sólo aplica para las llamadas a `bus_dmamem_alloc()` pero no a las de `bus_dmamap_create()`.
ru: _alignment_ - требуемое физическое выравнивание области памяти, которая будет выделена для этого тега. Используйте значение 1 для "без специфического выравнивания". Применяется только к будущим вызовам `bus_dmamem_alloc()`, но не `bus_dmamap_create()`.
