Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: The probe routines of non-PnP devices marked as `sensitive` are called. If probe for a device went successfully, the attach routine is called for it.
es: Se llama a las rutinas de sondeo para dispositivos no-PnP marcadas como `sensitive`. Si un sondeo de dispositivo tiene éxito, se llama a la rutina para adjuntarlo.
ru: Вызываются процедуры обнаружения для устройств, не поддерживающих PnP, помеченных как `sensitive`. Если процедура обнаружения для устройства завершилась успешно, вызывается процедура присоединения для него.

source: The probe and attach routines of all non-PNP devices are called likewise.
es: Se llama a las rutinas de sondeo y de ajuntar para todos los dispositivos no-PnP.
ru: Вызов процедур обнаружения и присоединения всех устройств, не поддерживающих PNP, выполняется аналогичным образом.

source: The PnP devices are brought back from the sleep state and assigned the resources they request: I/O and memory address ranges, IRQs and DRQs, all of them not conflicting with the attached legacy devices.
es: Se despierta a los dispositivos PnP y se les asigna los recursos que soliciten: rangos de E/S y memoria, IRQs y DRQs, todos los que no entren en conflicto con los dispositivos antiguos adjuntados.
ru: Устройства PnP выводятся из состояния сна и получают запрошенные ресурсы: диапазоны адресов ввода-вывода и памяти, IRQ и DRQ, причем все они не конфликтуют с подключенными устаревшими устройствами.

source: Then for each PnP device the probe routines of all the present ISA drivers are called. The first one that claims the device gets attached. It is possible that multiple drivers would claim the device with different priority; in this case, the highest-priority driver wins. The probe routines must call `ISA_PNP_PROBE()` to compare the actual PnP ID with the list of the IDs supported by the driver and if the ID is not in the table return failure. That means that absolutely every driver, even the ones not supporting any PnP devices must call `ISA_PNP_PROBE()`, at least with an empty PnP ID table to return failure on unknown PnP devices.
es: Después se llama a las rutinas de sondeo para cada dispositivo PnP de todos los controladores ISA presentes. El primero que reclame el dispositivo se adjunta. Es posible que varios controladores reclamen el dispositivo con diferentes prioridades; en este caso gana el controlador con la prioridad más alta. Las rutinas de sondeo deben llamar a `ISA_PNP_PROBE()` para comparar el ID PnP actual con la lista de IDs soportada por el controlador y si el ID no está en la tabla devolver fallo. Eso significa que absolutamente todos los controladores, incluso los que no soportan ningún dispositivo PnP deben llamar a `ISA_PNP_PROBE()`, al menos con una tabla de IDs PnP vacía para devolver fallo en los dispositivos PnP desconocidos.
ru: Затем для каждого устройства PnP вызываются процедуры обнаружения всех присутствующих драйверов ISA. Первый драйвер, который заявит о поддержке устройства, будет присоединен. Возможна ситуация, когда несколько драйверов заявят о поддержке устройства с разным приоритетом; в этом случае побеждает драйвер с наивысшим приоритетом. Процедуры обнаружения должны вызывать `ISA_PNP_PROBE()` для сравнения фактического PnP ID со списком ID, поддерживаемых драйвером, и если ID отсутствует в таблице, возвращать ошибку. Это означает, что абсолютно каждый драйвер, даже те, которые не поддерживают никакие PnP устройства, должны вызывать `ISA_PNP_PROBE()`, хотя бы с пустой таблицей PnP ID, чтобы возвращать ошибку для неизвестных PnP устройств.

source: The probe routine returns a positive value (the error code) on error, zero or negative value on success.
es: Las rutinas de sondeo devuelven un valor positivo (el código de error) si hay error, cero o valor negativo en caso de éxito.
ru: Процедура обнаружения возвращает положительное значение (код ошибки) в случае ошибки, ноль или отрицательное значение в случае успеха.

source: The negative return values are used when a PnP device supports multiple interfaces. For example, an older compatibility interface and a newer advanced interface which are supported by different drivers. Then both drivers would detect the device. The driver which returns a higher value in the probe routine takes precedence (in other words, the driver returning 0 has highest precedence, returning -1 is next, returning -2 is after it and so on). In result the devices which support only the old interface will be handled by the old driver (which should return -1 from the probe routine) while the devices supporting the new interface as well will be handled by the new driver (which should return 0 from the probe routine). If multiple drivers return the same value then the one called first wins. So if a driver returns value 0 it may be sure that it won the priority arbitration.
es: Los valores de retorno negativos se usan cuando un dispositivo PnP soporta múltiples interfaces. Por ejemplo, una interfaz de compatibilidad más antigua y una interfaz avanzada más modernas que se soportan en diferentes controladores. Después ambos controladores detectarían el dispositivo. El controlador que devuelve el valor más alto en la rutina de sondeo tiene preferencia (en otras palabras, el controlador que devuelve 0 tiene mayor preferencia, el que devuelve -1 es el siguiente, el que devuelve -2 el siguiente y así sucesivamente). Como resultado los dispositivos que soportan sólo el interfaz antiguo serán manejados por el controlador antiguo (que debería devolver -1 en su rutina de sondeo) mientras que los dispositivos que soportan también el interfaz nuevo serán manejados por el controlador nuevo (que debería devolver 0 en la rutina de sondeo). Si varios controladores devuelven el mismo valor entonces el que se haya llamado primero gana. De forma que si un controlador devuelve 0 puede asegurarse que ha ganado el arbitraje.
ru: Отрицательные возвращаемые значения используются, когда устройство PnP поддерживает несколько интерфейсов. Например, старый совместимый интерфейс и новый расширенный интерфейс, которые поддерживаются разными драйверами. В этом случае оба драйвера обнаружат устройство. Драйвер, возвращающий большее значение в процедуре обнаружения, получает приоритет (другими словами, драйвер, возвращающий 0, имеет наивысший приоритет, возвращающий -1 — следующий, возвращающий -2 — за ним и так далее). В результате устройства, поддерживающие только старый интерфейс, будут обрабатываться старым драйвером (который должен возвращать -1 из процедуры обнаружения), тогда как устройства, поддерживающие также новый интерфейс, будут обрабатываться новым драйвером (который должен возвращать 0 из процедуры обнаружения). Если несколько драйверов возвращают одинаковое значение, побеждает тот, который был вызван первым. Таким образом, если драйвер возвращает значение 0, он может быть уверен, что выиграл арбитраж приоритетов.

source: The device-specific identify routines can also assign not a driver but a class of drivers to the device. Then all the drivers in the class are probed for this device, like the case with PnP. This feature is not implemented in any existing driver and is not considered further in this document.
es: Las rutinas de identificación específicas del dispositivo no sólo pueden asociar un controlador sino una clase de controladores a un dispositivo. En este caso se sondean todos los controladores de la clase para este dispositivo, como el caso con PnP. Esta característica no está implementada en ningún controlador y no se considera a lo largo de este documento.
ru: Процедуры идентификации, специфичные для устройства, также могут назначать устройству не драйвер, а класс драйверов. Затем все драйверы в этом классе проверяются на совместимость с устройством, как в случае с PnP. Эта возможность не реализована ни в одном существующем драйвере и далее в этом документе не рассматривается.

source: As the PnP devices are disabled when probing the legacy devices they will not be attached twice (once as legacy and once as PnP). But in case of device-dependent identify routines it is the responsibility of the driver to make sure that the same device will not be attached by the driver twice: once as legacy user-configured and once as auto-identified.
es: Como los dispositivos PnP se desactivan mientras se están sondeando los dispositivos antiguos estos no se adjuntarán dos veces (una como dispositivo antiguo y una como PnP). Pero en el caso de rutinas de identificación dependientes del dispositivo es responsabilidad del controlador asegurarse que el mismo dispositivo no será adjuntado dos veces por el controlador: una como dispositivo antiguo configurador por el usuario y otra como auto-identificado.
ru: Поскольку устройства PnP отключены при проверке устаревших устройств, они не будут присоединены дважды (один раз как устаревшие и один раз как PnP). Однако в случае процедур идентификации, зависящих от устройства, ответственность за то, чтобы одно и то же устройство не было присоединено драйвером дважды (один раз как настроенное пользователем устаревшее и один раз как автоматически идентифицированное), лежит на драйвере.

source: Another practical consequence for the auto-identified devices (both PnP and device-specific) is that the flags can not be passed to them from the kernel configuration file. So they must either not use the flags at all or use the flags from the device unit 0 for all the auto-identified devices or use the sysctl interface instead of flags.
es: Otra consecuencia práctica de los dispositivos auto-identificados (tanto PnP como específicos del dispositivo) es que los flags no se pueden pasar desde el fichero de configuración del kernel. Se debe no usar flags en absoluto o usar los flags de la unida de dispositivo 0 para todos los dispositivos auto-identificados o usar el interfaz sysctl en lugar de flags.
ru: Еще одно практическое следствие для автоматически определяемых устройств (как PnP, так и специфичных для устройства) заключается в том, что флаги не могут быть переданы им из файла конфигурации ядра. Поэтому они либо не должны использовать флаги вообще, либо использовать флаги из устройства unit 0 для всех автоматически определяемых устройств, либо использовать интерфейс sysctl вместо флагов.

source: Other unusual configurations may be accommodated by accessing the configuration resources directly with functions of families `resource_query_*()` and `resource_*_value()`. Their implementations are located in [.filename]#kern/subr_bus.c#. The old IDE disk driver [.filename]#i386/isa/wd.c# contains examples of such use. But the standard means of configuration must always be preferred. Leave parsing the configuration resources to the bus configuration code.
es: Se pueden acomodar otras configuraciones menos usuarios accediendo directamente a los recursos de configuración con funciones de las familias `resource_query_*()` y `resource_*_value()`. Sus implementaciones están en [.filename]#kern/subr_bus.c#. El antiguo controlador de disco IDE [.filename]#i386/isa/wd.c# contiene ejemplos de cómo usarlas. Pero el estándar especifica que siempre se debe preferir la configuración. Deja el parseo de los recursos de configuración al código de configuración del bus.
ru: Другие нестандартные конфигурации могут быть реализованы путем прямого доступа к ресурсам конфигурации с использованием функций семейств `resource_query_*()` и `resource_*_value()`. Их реализации находятся в [.filename]#kern/subr_bus.c#. Примеры такого использования есть в старом драйвере диска IDE [.filename]#i386/isa/wd.c#. Однако стандартные методы конфигурации всегда должны быть предпочтительны. Оставьте разбор ресурсов конфигурации коду настройки шины.

source: Resources
es: Recursos
ru: Ресурсы

source: The information that a user enters into the kernel configuration file is processed and passed to the kernel as configuration resources. This information is parsed by the bus configuration code and transformed into a value of structure device_t and the bus resources associated with it. The drivers may access the configuration resources directly using functions `resource_*` for more complex cases of configuration. However, generally this is neither needed nor recommended, so this issue is not discussed further here.
es: La información que el usuario introducen el fichero de configuración del kernel se procesa y se le pasa al kernel como recursos de configuración. Esta información se parsea con el código de configuración del bus y se transforma en un valor de una estructura device_t y los recursos del bus asociados con él. Los controladores pueden acceder directamente a los recursos de configuración usando funciones `resource_*` para casos de configuración más complejos. Sin embargo, generalmente esto no es ni necesario ni recomendado, de forma que no discutiremos más este asunto.
ru: Информация, которую пользователь вводит в файл конфигурации ядра, обрабатывается и передаётся ядру в виде ресурсов конфигурации. Эта информация анализируется кодом конфигурации шины и преобразуется в значение структуры `device_t` и связанные с ней ресурсы шины. Драйверы могут напрямую обращаться к ресурсам конфигурации, используя функции `resource_*` для более сложных случаев конфигурации. Однако, как правило, в этом нет необходимости, и это не рекомендуется, поэтому данный вопрос далее не рассматривается.

source: The bus resources are associated with each device. They are identified by type and number within the type. For the ISA bus the following types are defined:
es: Los recursos del bus se asocian con cada dispositivo. Se identifican por un tipo y un número dentro del tipo. Para el bus ISA se definen los siguientes tipos:
ru: Ресурсы шины связаны с каждым устройством. Они идентифицируются по типу и номеру внутри типа. Для шины ISA определены следующие типы:

source: _SYS_RES_IRQ_ - interrupt number
es: _SYS_RES_IRQ_ - número de interrupción
ru: _SYS_RES_IRQ_ - номер прерывания

source: _SYS_RES_DRQ_ - ISA DMA channel number
es: _SYS_RES_DRQ_ - número de canal DMA ISA
ru: _SYS_RES_DRQ_ - номер канала ISA DMA

source: _SYS_RES_MEMORY_ - range of device memory mapped into the system memory space
es: _SYS_RES_MEMORY_ - rango de memoria del dispositivo mapeado en el espacio de memoria del sistema
ru: _SYS_RES_MEMORY_ - диапазон памяти устройства, отображенный в системное адресное пространство

source: _SYS_RES_IOPORT_ - range of device I/O registers
es: _SYS_RES_IOPORT_ - rango de registros de E/S del dispositivo
ru: _SYS_RES_IOPORT_ - диапазон регистров ввода-вывода устройства

source: The enumeration within types starts from 0, so if a device has two memory regions it would have resources of type `SYS_RES_MEMORY` numbered 0 and 1. The resource type has nothing to do with the C language type, all the resource values have the C language type `unsigned long` and must be cast as necessary. The resource numbers do not have to be contiguous, although for ISA they normally would be. The permitted resource numbers for ISA devices are:
es: Las enumeraciones en los tipos empiezan en 0, de forma que si un dispositivo tiene dos regiones de memoria tendría recursos de tipo `SYS_RES_MEMORY` enumerados 0 y 1. El tipo de recurso no tiene nada que ver con el tipo en el lenguaje C, todos los recursos tienen valores con tipo `unsigned long` en lenguaje C y se deben convertir como sea necesario. Los números de recurso no tienen que ser contiguos, aunque para ISA normalmente lo son. Los números de recurso permitidos para los dispositivos ISA son:
ru: Перечисление внутри типов начинается с 0, поэтому если устройство имеет две области памяти, оно будет иметь ресурсы типа `SYS_RES_MEMORY` с номерами 0 и 1. Тип ресурса не связан с типом языка C, все значения ресурсов имеют тип `unsigned long` в языке C и должны быть приведены по мере необходимости. Номера ресурсов не обязательно должны быть последовательными, хотя для ISA они обычно таковыми являются. Допустимые номера ресурсов для устройств ISA:

source: All the resources are represented as ranges, with a start value and count. For IRQ and DRQ resources the count would normally be equal to 1. The values for memory refer to the physical addresses.
es: Todos los recursos se representan como rangos, con un valor de comienzo y un contador. Para los recursos IRQ y DRQ el contador normalmente será 1. Los valores para memoria se refieren a las direcciones físicas.
ru: Все ресурсы представлены в виде диапазонов с начальным значением и количеством. Для ресурсов IRQ и DRQ количество обычно равно 1. Значения для памяти относятся к физическим адресам.

source: Three types of activities can be performed on resources:
es: Se pueden realizar tres tipos de actividades sobre los recursos:
ru: Три типа действий могут выполняться над ресурсами:

source: set/get
ru: Установка — set/get

source: allocate/release
ru: Выделение — allocate/release

source: activate/deactivate
ru: Активация — activate/deactivate

source: Setting sets the range used by the resource. Allocation reserves the requested range that no other driver would be able to reserve it (and checking that no other driver reserved this range already). Activation makes the resource accessible to the driver by doing whatever is necessary for that (for example, for memory it would be mapping into the kernel virtual address space).
es: Los ajustes establecen el rango usado por el recurso. La asignación reserva el rango solicitado de forma que ningún otro controlador puede reservarlo (y comprueba que ningún otro controlador haya reservado este rango con anterioridad). La activación hace que el recurso sea accesible por el controlador haciendo lo que sea necesario (por ejemplo, para la memoria sería mapearla en el espacio de direcciones virtuales del kernel).
ru: Установка задает диапазон, используемый ресурсом. Выделение резервирует запрошенный диапазон, чтобы никакой другой драйвер не смог его зарезервировать (и проверяет, что никакой другой драйвер уже не зарезервировал этот диапазон). Активация делает ресурс доступным для драйвера, выполняя все необходимые для этого действия (например, для памяти это может быть отображение в виртуальное адресное пространство ядра).

source: The functions to manipulate resources are:
es: Las funciones para manipular recursos son:
ru: Функции для управления ресурсами:

source: Set a range for a resource. Returns 0 if successful, error code otherwise. Normally, this function will return an error only if one of `type`, `rid`, `start` or `count` has a value that falls out of the permitted range.
es: Establece un rango para un recurso. Devuelve 0 en caso de éxito, en caso contrario un código de error. Normalmente, esta función sólo devolverá un error si `type`, `rid`, `start` o `count` tienen un valor que está fuera del rango permitido.
ru: Устанавливает диапазон для ресурса. Возвращает 0 при успешном выполнении, в противном случае — код ошибки. Обычно эта функция возвращает ошибку только в том случае, если одно из значений `type`, `rid`, `start` или `count` выходит за пределы допустимого диапазона.

source: dev - driver's device
es: dev - dispositivo del controlador
ru: dev - устройство драйвера

source: type - type of resource, SYS_RES_*
es: type - tipo de recurso, SYS_RES_*
ru: тип - тип ресурса, SYS_RES_*

source: rid - resource number (ID) within type
es: rid - número de recurso (ID) dentro del tipo
ru: rid - номер ресурса (ID) в пределах типа

source: start, count - resource range
es: start, count - rango del recurso
ru: начало, количество - диапазон ресурсов

source: Get the range of resource. Returns 0 if successful, error code if the resource is not defined yet.
es: Obtiene el rango del recurso. Devuelve 0 en caso de éxito, código de error si el recurso no se ha definido todavía.
ru: Получает диапазон ресурса. Возвращает 0 при успехе, код ошибки, если ресурс ещё не определён.

source: `u_long bus_get_resource_start(device_t dev, int type, int rid) u_long bus_get_resource_count (device_t dev, int type, int rid)`
ru: `u_long bus_get_resource_start(device_t dev, int type, int rid) и u_long bus_get_resource_count (device_t dev, int type, int rid)`

source: Convenience functions to get only the start or count. Return 0 in case of error, so if the resource start has 0 among the legitimate values it would be impossible to tell if the value is 0 or an error occurred. Luckily, no ISA resources for add-on drivers may have a start value equal to 0.
es: Funciones de apoyo para obtener sólo el comienzo o el tamaño. Devuelve 0 en caso de error, de forma que si el recurso tiene 0 entre sus valores legítimos sería imposible decir si el valor es 0 o ha ocurrido un error. Afortunadamente, ningún recurso ISA para controladores añadidos puede tener un valor de comienzo igual a 0.
ru: Удобные функции для получения только начала или количества. Возвращают 0 в случае ошибки, поэтому если начало ресурса может законно содержать 0, невозможно определить, является ли значение 0 или произошла ошибка. К счастью, ни один ресурс ISA для дополнительных драйверов не может иметь начальное значение, равное 0.

source: Delete a resource, make it undefined.
es: Borra un recurso, lo hace indefinido.
ru: Удаляет ресурс, делает его неопределённым.

source: Allocate a resource as a range of count values not allocated by anyone else, somewhere between start and end. Alas, alignment is not supported. If the resource was not set yet it is automatically created. The special values of start 0 and end ~0 (all ones) means that the fixed values previously set by `bus_set_resource()` must be used instead: start and count as themselves and end=(start+count), in this case if the resource was not defined before then an error is returned. Although rid is passed by reference it is not set anywhere by the resource allocation code of the ISA bus. (The other buses may use a different approach and modify it).
es: Asigna un recurso como un rango de count valores no asignados por nadie más, en algún punto entre start y end. Lamentablemente, no se soporta alineamiento. Si el recurso no se ha establecido todavía se crea automáticamente. Los valores especiales 0 para start y ~0 para end (todo unos) significan que los valores fijos previamente establecidos por `bus_set_resource()` se tiene que usar en su lugar: start y count como ellos mismos y end=(start+count), en este caso si el recurso no estaba definido anteriormente se devuelve un error. Aunque se pasa rid como referencia el código de asignación del bus ISA no lo establece en ningún sitio. (Los otros buses podrían usar una aproximación diferente y modificarlo).
ru: Выделяет ресурс как диапазон значений count, не выделенных никем другим, где-то между start и end. Увы, выравнивание не поддерживается. Если ресурс ещё не был установлен, он автоматически создаётся. Специальные значения start равное 0 и end равное ~0 (все единицы) означают, что должны использоваться фиксированные значения, ранее установленные `bus_set_resource()`: start и count как есть, а end=(start+count). В этом случае, если ресурс не был определён ранее, возвращается ошибка. Хотя rid передаётся по ссылке, он нигде не устанавливается кодом выделения ресурсов шины ISA. Другие шины могут использовать иной подход и изменять его.

source: Flags are a bitmap, the flags interesting for the caller are:
es: Los flags con un mapa de bits, los flags interesantes para el llamante son:
ru: Флаги представляют собой битовую карту. Интересные для вызывающей стороны флаги:

source: _RF_ACTIVE_ - causes the resource to be automatically activated after allocation.
es: _RF_ACTIVE_ - hace que se active el recurso automáticamente después de la asignación.
ru: _RF_ACTIVE_ - приводит к автоматической активации ресурса после его выделения.
