Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: Before calling the callback function from `bus_dmamap_load()` the segment array is stored in the stack. And it gets pre-allocated for the maximal number of segments allowed by the tag. As a result of this the practical limit for the number of segments on i386 architecture is about 250-300 (the kernel stack is 4KB minus the size of the user structure, size of a segment array entry is 8 bytes, and some space must be left). Since the array is allocated based on the maximal number this value must not be set higher than really needed. Fortunately, for most of hardware the maximal supported number of segments is much lower. But if the driver wants to handle buffers with a very large number of scatter-gather segments it should do that in portions: load part of the buffer, transfer it to the device, load next part of the buffer, and so on.
es: Antes de llamar a la función de callback desde `bus_dmamap_load()` se almacena el array de segmentos en la pila. Y se pre-reserva para el número máximo de segmentos permitidos por la etiqueta. Como resultado el límite práctico para el número de segmentos en arquitectura i386 es de cerca de 250-300 (la pila del núcleo es 4KB menos el tamaño de la estructura de usuario, tamaño de una entrada del array de segmentos es 8 btytes, y se debe dejar algo de espacio). Como el array se reserva basándose en el número máximo este valor no se debe configurar más alto de lo necesario. Afortunadamente, para la mayoría del hardware el máximo soportado es mucho menor. Pero si el controlador quiere manejar búfers con un número muy grande de segmentos scatter-gather debería hacerlo por trozos: carga parte del búfer, lo transfiere al dispositivo, carga la siguiente parte del búfer, etc.
ru: Перед вызовом функции обратного вызова из `bus_dmamap_load()` массив сегментов сохраняется в стеке. Он предварительно выделяется для максимального количества сегментов, разрешенного тегом. В результате этого практический предел количества сегментов на архитектуре i386 составляет около 250-300 (размер стека ядра — 4 КБ минус размер структуры пользователя, размер элемента массива сегментов — 8 байт, и необходимо оставить некоторое пространство). Поскольку массив выделяется исходя из максимального числа, это значение не должно быть установлено выше, чем действительно необходимо. К счастью, для большинства оборудования максимально поддерживаемое количество сегментов значительно ниже. Но если драйвер должен обрабатывать буферы с очень большим количеством сегментов scatter-gather, он должен делать это по частям: загрузить часть буфера, передать его устройству, загрузить следующую часть буфера и так далее.

source: Another practical consequence is that the number of segments may limit the size of the buffer. If all the pages in the buffer happen to be physically non-contiguous then the maximal supported buffer size for that fragmented case would be (nsegments * page_size). For example, if a maximal number of 10 segments is supported then on i386 maximal guaranteed supported buffer size would be 40K. If a higher size is desired then special tricks should be used in the driver.
es: Otra consecuencia práctica es que el número de segmentos podría limitar el tamaño del búfer. Si todas las páginas en el búfer no son contiguas físicamente entonces el tamaño máximo de búfer soportado para ese caso fragmentado sería de (nsegments * page_size). Por ejemplo, si se soporta un número máximo de 10 segmentos entonces en i386 el tamaño máximo de búfer soportado garantizado sería de 40K. Si se desea un tamaño mayor se deben usar trucos especiales en el controlador.
ru: Еще одно практическое следствие заключается в том, что количество сегментов может ограничивать размер буфера. Если все страницы в буфере окажутся физически несмежными, то максимальный поддерживаемый размер буфера для такого фрагментированного случая будет равен (nsegments * page_size). Например, если поддерживается максимальное количество сегментов, равное 10, то на i386 максимальный гарантированно поддерживаемый размер буфера составит 40K. Если требуется больший размер, то в драйвере следует использовать специальные приемы.

source: If the hardware does not support scatter-gather at all or the driver wants to support some buffer size even if it is heavily fragmented then the solution is to allocate a contiguous buffer in the driver and use it as intermediate storage if the original buffer does not fit.
es: Si el hardware no soporta scatter-gather en absoluto o si el controlador quiere soportador un tamaño de búfer incluso si está muy fragmentado entonces la solución es reservar un búfer contiguo en el controlador y usarlo como almacenamiento intermedio si el búfer original no cabe.
ru: Если оборудование не поддерживает scatter-gather вообще или драйвер хочет поддерживать некоторый размер буфера, даже если он сильно фрагментирован, то решение состоит в выделении непрерывного буфера в драйвере и использовании его в качестве промежуточного хранилища, если исходный буфер не подходит.

source: Below are the typical call sequences when using a map depend on the use of the map. The characters -> are used to show the flow of time.
es: Abajo están las secuencias de llamadas típicas cuando se usa un mapa dependiendo del uso del mismo. Los caracteres -> se usan para mostrar el flujo de tiempo.
ru: Ниже представлены типичные последовательности вызовов при использовании карты в зависимости от её назначения. Символы -> используются для обозначения последовательности во времени.

source: For a buffer which stays practically fixed during all the time between attachment and detachment of a device:
es: Para un búfer que permanece prácticamente fijo durante todo el tiempo desde que se adjunta hasta que se libera de un dispositivo:
ru: Для буфера, который остается практически неизменным в течение всего времени между присоединением и отсоединением устройства:

source: For a buffer that changes frequently and is passed from outside the driver:
es: Para un búfer que cambia frecuentemente y que es pasado desde fuera del controlador:
ru: Для буфера, который часто изменяется и передается извне драйвера:

source: When loading a map created by `bus_dmamem_alloc()` the passed address and size of the buffer must be the same as used in `bus_dmamem_alloc()`. In this case it is guaranteed that the whole buffer will be mapped as one segment (so the callback may be based on this assumption) and the request will be executed immediately (EINPROGRESS will never be returned). All the callback needs to do in this case is to save the physical address.
es: Cuando se carga un mapa creado por `bus_dmamem_alloc()` la dirección pasada y el tamaño del búfer deben ser los mismos usados en `bus_dmamem_alloc()`. En este caso se garantiza que todo el búfer se mapeará como un sólo segmente (de forma que el callback puede asumir esto) y la solicitud se ejecutará inmediatamente (nunca se devolverá EINPROGRESS). Todo lo que necesita hacer el callback en este caso es guardar la dirección física.
ru: При загрузке карты, созданной `bus_dmamem_alloc()`, переданные адрес и размер буфера должны быть такими же, как использованные в `bus_dmamem_alloc()`. В этом случае гарантируется, что весь буфер будет отображен как один сегмент (так что обратный вызов может основываться на этом предположении) и запрос будет выполнен немедленно (EINPROGRESS никогда не будет возвращен). Все, что нужно сделать обратному вызову в этом случае, — это сохранить физический адрес.

source: A typical example would be:
es: Un ejemplo típico sería:
ru: Типичный пример:

source: Looks a bit long and complicated but that is the way to do it. The practical consequence is: if multiple memory areas are allocated always together it would be a really good idea to combine them all into one structure and allocate as one (if the alignment and boundary limitations permit).
es: Parece un poco largo y complicado pero es la forma de hacerlo. La consecuencia práctica es: si se reservan múltiples áreas de memoria siempre juntas sería una buena idea combinarlas en una sola estructura y reservarlas como una sola (si el alineamiento y los límites lo permiten).
ru: Выглядит немного длинно и сложно, но это правильный способ. Практическое следствие таково: если несколько областей памяти выделяются всегда вместе, было бы отличной идеей объединить их все в одну структуру и выделять как единое целое (если ограничения выравнивания и границ позволяют).

source: When loading an arbitrary buffer into the map created by `bus_dmamap_create()` special measures must be taken to synchronize with the callback in case it would be delayed. The code would look like:
es: Cuando se carga un búfer arbitrario en el mapa creado por `bus_dmamap_create()` se tienen que tomar medidas especiales para sincronizar el callback en caso de que se retrasara. El código se parecería a :
ru: При загрузке произвольного буфера в карту, созданную `bus_dmamap_create()`, необходимо принять специальные меры для синхронизации с обратным вызовом, если он будет задержан. Код будет выглядеть следующим образом:

source: Two possible approaches for the processing of requests are:
es: Dos posibles aproximaciones para el procesamiento de peticiones son:
ru: Два возможных подхода для обработки запросов:

source: If requests are completed by marking them explicitly as done (such as the CAM requests) then it would be simpler to put all the further processing into the callback driver which would mark the request when it is done. Then not much extra synchronization is needed. For the flow control reasons it may be a good idea to freeze the request queue until this request gets completed.
es: Si las peticiones se completan marcándolas explícitamente como terminadas (como las peticiones CAM) entonces sería más sencillo poner todo el procesamiento siguiente en el callback del controlador que marcaría la petición cuando estuviera hecha. Entonces no se necesita mucha sincronización. Con motivo del flujo de control sería una buena idea congelar la cola de peticiones hasta que la petición se complete.
ru: Если запросы завершаются путём явной пометки их как выполненных (например, запросы CAM), то было бы проще поместить всю дальнейшую обработку в драйвер обратного вызова, который отмечал бы запрос по его завершении. В этом случае не потребуется много дополнительной синхронизации. По соображениям управления потоком может быть полезно заморозить очередь запросов до завершения этого запроса.

source: If requests are completed when the function returns (such as classic read or write requests on character devices) then a synchronization flag should be set in the buffer descriptor and `tsleep()` called. Later when the callback gets called it will do its processing and check this synchronization flag. If it is set then the callback should issue a wakeup. In this approach the callback function could either do all the needed processing (just like the previous case) or simply save the segments array in the buffer descriptor. Then after callback completes the calling function could use this saved segments array and do all the processing.
es: Si las peticiones se completan cuando la función retorna (como una petición clásica de lectura o escritura en un dispositivo de caracteres) entonces se debería establecer un flag de sincronización en el descriptor del búfer y después llamar a `tsleep()`. Más tarde cuando se llama al callback hará el procesamiento que le toque y comprobará el flag de sincronización. Si está establecido entonces el callback debería hacer un wakeup. En esta aproximación la función de callback podría hacer todo el procesamiento necesario (como en el caso anterior) o simplemente guardar el array de segmentos en el descriptor de búfer. Después de que el callback termine la función llamante podría usar este array de segmentos guardado y hacer todo el procesamiento.
ru: Если запросы завершаются при возврате функции (например, классические запросы на чтение или запись для символьных устройств), то в дескрипторе буфера должен быть установлен флаг синхронизации и вызвана функция `tsleep()`. Позже, когда будет вызван обратный вызов, он выполнит свою обработку и проверит этот флаг синхронизации. Если флаг установлен, обратный вызов должен инициировать пробуждение. При таком подходе функция обратного вызова может либо выполнить всю необходимую обработку (как в предыдущем случае), либо просто сохранить массив сегментов в дескрипторе буфера. Затем после завершения обратного вызова вызывающая функция может использовать этот сохранённый массив сегментов и выполнить всю обработку.

source: The Direct Memory Access (DMA) is implemented in the ISA bus through the DMA controller (actually, two of them but that is an irrelevant detail). To make the early ISA devices simple and cheap the logic of the bus control and address generation was concentrated in the DMA controller. Fortunately, FreeBSD provides a set of functions that mostly hide the annoying details of the DMA controller from the device drivers.
es: El Acceso Director a Memoria (DMA) se implementa en el bus ISA mediante el controlador DMA (en realidad, dos de ellos pero es un detalle irrelevante). Para hacer los primeros dispositivos ISA simples y baratos la lógica del bus de control y de generación de direcciones se concentró en el controlador DMA. Afortunadamente, FreeBSD proporciona un conjunto de funciones que ocultan mayoritariamente los detalles molestos del controlador DMA desde el punto de vista de los controladores de dispositivo.
ru: Прямой доступ к памяти (DMA) реализован в шине ISA через контроллер DMA (на самом деле их два, но это несущественная деталь). Чтобы сделать ранние устройства ISA простыми и дешёвыми, логика управления шиной и генерации адресов была сосредоточена в контроллере DMA. К счастью, FreeBSD предоставляет набор функций, которые в основном скрывают раздражающие детали работы контроллера DMA от драйверов устройств.

source: The simplest case is for the fairly intelligent devices. Like the bus master devices on PCI they can generate the bus cycles and memory addresses all by themselves. The only thing they really need from the DMA controller is bus arbitration. So for this purpose they pretend to be cascaded slave DMA controllers. And the only thing needed from the system DMA controller is to enable the cascaded mode on a DMA channel by calling the following function when attaching the driver:
es: El caso más simple es para los dispositivos medianamente inteligentes. Como los dispositivos maestros del bus PCI pueden generar los ciclos del bus y las direcciones de memoria por ellos mismos. Lo único que necesitan realmente del controlador DMA es arbitraje del bus. Para este propósito fingen ser controladores DMA esclavos en cascada. Y lo único que necesitan del controlador DMA es activa el modo en cascada en un canal DMA llamando a la siguiente función cuando se adjunta el controlador:
ru: Самый простой случай — для достаточно интеллектуальных устройств. Например, устройства с bus mastering на PCI могут сами генерировать шинные циклы и адреса памяти. Единственное, что им действительно нужно от контроллера DMA, — это арбитраж шины. Для этой цели они притворяются каскадированными подчинёнными контроллерами DMA. И единственное, что требуется от системного контроллера DMA, — это включить каскадный режим на канале DMA, вызвав следующую функцию при присоединении драйвера:

source: All the further activity is done by programming the device. When detaching the driver no DMA-related functions need to be called.
es: El resto de la actividad se hace programando el dispositivo. Cuando se descarga un controlador no se necesita llamar a funciones de DMA.
ru: Все последующие действия выполняются путем программирования устройства. При отсоединении драйвера нет необходимости вызывать функции, связанные с DMA.

source: For the simpler devices things get more complicated. The functions used are:
es: Para los dispositivos más simples las cosas son más complicadas. Las funciones utilizadas son:
ru: Для более простых устройств всё становится сложнее. Используются следующие функции:

source: Reserve a DMA channel. Returns 0 on success or EBUSY if the channel was already reserved by this or a different driver. Most of the ISA devices are not able to share DMA channels anyway, so normally this function is called when attaching a device. This reservation was made redundant by the modern interface of bus resources but still must be used in addition to the latter. If not used then later, other DMA routines will panic.
es: Reserva un canal DMA. Devuelve 0 en caso de éxito o EBUSY si el cana ya estaba reservado por este u otro controlador. De todos modos la mayoría de los dispositivos ISA no son capaces de compartir canales DMA, así que normalmente esta función se llama cuando se adjunta un dispositivo. Esta reserva se hizo redundante con el interfaz moderno de recursos del bus pero todavía puede ser utilizado con el anterior. Si no se usa, otras rutinas DMA fallarán.
ru: Зарезервировать канал DMA. Возвращает 0 при успехе или EBUSY, если канал уже зарезервирован этим или другим драйвером. Большинство устройств ISA не способны совместно использовать каналы DMA, поэтому обычно эта функция вызывается при присоединении устройства. Это резервирование стало избыточным с появлением современного интерфейса ресурсов шины, но всё ещё должно использоваться в дополнение к последнему. Если резервирование не использовать, то в дальнейшем другие процедуры DMA вызовут панику ядра.

source: Release a previously reserved DMA channel. No transfers must be in progress when the channel is released (in addition the device must not try to initiate transfer after the channel is released).
es: Libera un canal DMA reservado anteriormente. No debe haber transferencias en curso cuando se libera el canal (además el dispositivo no debe intentar iniciar transferencias después de que el canal haya sido liberado).
ru: Освободить ранее зарезервированный канал DMA. На момент освобождения канала не должно быть активных передач (дополнительно устройство не должно пытаться инициировать передачу после освобождения канала).

source: Allocate a bounce buffer for use with the specified channel. The requested size of the buffer can not exceed 64KB. This bounce buffer will be automatically used later if a transfer buffer happens to be not physically contiguous or outside of the memory accessible by the ISA bus or crossing the 64KB boundary. If the transfers will be always done from buffers which conform to these conditions (such as those allocated by `bus_dmamem_alloc()` with proper limitations) then `isa_dmainit()` does not have to be called. But it is quite convenient to transfer arbitrary data using the DMA controller. The bounce buffer will automatically care of the scatter-gather issues.
es: Reserva un búfer "bounce" para usarse con el canal especificado. El tamaño solicitado del búfer no puede exceder los 64KB. Este búfer "bounce" se usará automáticamente si un búfer para una transferencia no es físicamente contiguo o está fuera de la memoria accesible por el bus ISA o cruza el límite de los 64KB. Si las transferencias siempre se van a hacer desde búfers que cumplen estas condiciones (como aquellos reservados por `bus_dmamem_alloc()`con los límites adecuados) entonces no se necesita llamar a `isa_dmainit()`. Pero es muy útil para transferir datos arbitrarios usando el controlador DMA. El búfer "bounce" se encargará automáticamente de los problemas de scatter-gather.
ru: Выделить промежуточный буфер для использования с указанным каналом. Запрашиваемый размер буфера не может превышать 64 КБ. Этот промежуточный буфер будет автоматически использован в дальнейшем, если передаваемый буфер окажется не физически непрерывным, находится вне памяти, доступной шине ISA, или пересекает границу 64 КБ. Если передача всегда будет выполняться из буферов, соответствующих этим условиям (например, выделенных с помощью `bus_dmamem_alloc()` с соответствующими ограничениями), то вызов `isa_dmainit()` не требуется. Однако довольно удобно передавать произвольные данные с использованием контроллера DMA. Промежуточный буфер автоматически решит проблемы в ситуациях, когда данные разбросаны в памяти, и их надо собирать.

source: _chan_ - channel number
es: _chan_ - número de canal
ru: _chan_ - номер канала

source: _bouncebufsize_ - size of the bounce buffer in bytes
es: _bouncebufsize_ - tamaño en bytes del búfer "bounce"
ru: _bouncebufsize_ - размер промежуточного буфера в байтах

source: Prepare to start a DMA transfer. This function must be called to set up the DMA controller before actually starting transfer on the device. It checks that the buffer is contiguous and falls into the ISA memory range, if not then the bounce buffer is automatically used. If bounce buffer is required but not set up by `isa_dmainit()` or too small for the requested transfer size then the system will panic. In case of a write request with bounce buffer the data will be automatically copied to the bounce buffer.
es: Prepara para empezar una transferencia DMA. Esta función se debe llamar para configurar el controlador DMA antes de empezar la transferencia en el dispositivo. Comprueba que el búfer es contiguo y que está dentro del rango de memoria de ISA, si no, se usa el búfer de rebote de forma automática. Si se requiere el búfer de rebote pero no se configura con `isa_dmainit()` o es demasiado pequeño para el tamaño de la transferencia entonces el sistema entrará en pánico. En caso de que se haga una solicitud de escritura con un búfer de rebote los datos se copiarán automáticamente al búfer de rebote.
ru: Подготовка к началу передачи DMA. Эта функция должна быть вызвана для настройки контроллера DMA перед фактическим началом передачи на устройстве. Она проверяет, что буфер является непрерывным и попадает в диапазон памяти ISA, если нет, то автоматически используется промежуточный буфер. Если требуется промежуточный буфер, но он не настроен с помощью `isa_dmainit()` или слишком мал для запрошенного размера передачи, система перейдет в состояние паники. В случае запроса на запись с промежуточным буфером данные будут автоматически скопированы в этот буфер.

source: flags - a bitmask determining the type of operation to be done. The direction bits B_READ and B_WRITE are mutually exclusive.
es: flags - un mapa de bits que determina el tipo de operación a realizar. Los bits de dirección B_READ y B_WRITE son mutuamente excluyentes.
ru: flags - битовая маска, определяющая тип выполняемой операции. Бит направления B_READ и B_WRITE являются взаимоисключающими.

source: B_READ - read from the ISA bus into memory
es: B_READ - lee desde el bus ISA hacia memoria
ru: B_READ - чтение с шины ISA в память

source: B_WRITE - write from the memory to the ISA bus
es: B_WRITE - escribe desde memoria hacia el bus ISA
ru: B_WRITE - запись из памяти на шину ISA
