Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: ISA Device Drivers
es: Controladores de Dispositivos ISA
ru: Драйверы устройств ISA

source: Chapter 10. ISA Device Drivers
es: Capítulo 10. Controladores de Dispositivos ISA
ru: Глава 10. Драйверы устройств ISA

source: Synopsis
es: Sinopsis
ru: Обзор

source: This chapter introduces the issues relevant to writing a driver for an ISA device. The pseudo-code presented here is rather detailed and reminiscent of the real code but is still only pseudo-code. It avoids the details irrelevant to the subject of the discussion. The real-life examples can be found in the source code of real drivers. In particular the drivers `ep` and `aha` are good sources of information.
es: Esta capítulo hace una introducción a los problemas relevantes a la hora de escribir un controlador para un dispositivo ISA. El pseudocódigo presentado aquí es bastante detallado y se asemeja al código real pero sigue siendo pseudocódigo. Evita los detalles irrelevantes para el tema de discusión. Los ejemplos de la vida real se pueden encontrar en el código fuente de los controladores reales. En particular los controladores `ep` y `aha` son buenas fuentes de información.
ru: Эта глава знакомит с вопросами, относящимся к написанию драйвера устройства ISA. Представленный здесь псевдокод довольно детализирован и напоминает реальный код, но всё же остаётся псевдокодом. Он избегает деталей, не относящихся к теме обсуждения. Реальные примеры можно найти в исходном коде настоящих драйверов. В частности, драйверы `ep` и `aha` являются хорошими источниками информации.

source: Basic Information
es: Información Básica
ru: Основная информация

source: A typical ISA driver would need the following include files:
es: Un controlador ISA típico necesitaría incluir los siguientes ficheros:
ru: Типичному драйверу ISA могут потребоваться следующие включаемые файлы:

source: They describe the things specific to the ISA and generic bus subsystem.
es: Describen aspectos específicos de ISA y del subsistema de bus genérico.
ru: Они описывают особенности, специфичные для подсистемы ISA и обобщенной шины.

source: The bus subsystem is implemented in an object-oriented fashion, its main structures are accessed by associated method functions.
es: El subsistema de bus está implementado en forma orientada a objetos, sus estructuras principales se acceden mediante funciones método asociadas.
ru: Подсистема шины реализована в объектно-ориентированном стиле, её основные структуры доступны через методы, связанные с объектами.

source: The list of bus methods implemented by an ISA driver is like one for any other bus. For a hypothetical driver named "xxx" they would be:
es: La lista de los métodos del bus implementados por un controlador ISA es como la de cualquier otro bus. Para un controlador hipotético llamado "xxx" serían:
ru: Список методов шины, реализуемых драйвером ISA, аналогичен списку для любой другой шины. Для гипотетического драйвера с именем "xxx" они будут:

source: `static void xxx_isa_identify (driver_t *, device_t);` Normally used for bus drivers, not device drivers. But for ISA devices this method may have special use: if the device provides some device-specific (non-PnP) way to auto-detect devices this routine may implement it.
es: `static void xxx_isa_identify (driver_t *, device_t);` Normalmente usado por controladores de bus, no de dispositivo. Pero para dispositivos ISA este método puede tener un uso especial: si el dispositivo proporciona alguna forma de auto-detección (no PnP) esta rutina podría implementarlo.
ru: `static void xxx_isa_identify (driver_t *, device_t);` Обычно используется для драйверов шины, а не для драйверов устройств. Однако для устройств ISA этот метод может иметь особое применение: если устройство предоставляет специфический (не PnP) способ автоматического обнаружения устройств, эта процедура может его реализовывать.

source: `static int xxx_isa_probe (device_t dev);` Probe for a device at a known (or PnP) location. This routine can also accommodate device-specific auto-detection of parameters for partially configured devices.
es: `static int xxx_isa_probe (device_t dev);` Comprueba si existe un dispositivo en una localización conocida (o PnP). Esta rutina también puede acomodar parámetros de auto-detección específicos del dispositivo para dispositivos configurados parcialmente.
ru: `static int xxx_isa_probe (device_t dev);` Проверка наличия устройства в известном (или PnP) расположении. Эта процедура также может учитывать автоопределение параметров, специфичных для устройства, в случае частично настроенных устройств.

source: `static int xxx_isa_attach (device_t dev);` Attach and initialize device.
es: `static int xxx_isa_attach (device_t dev);` Adjunta e inicializa el dispositivo.
ru: `static int xxx_isa_attach (device_t dev);` Подключение и инициализация устройства.

source: `static int xxx_isa_detach (device_t dev);` Detach device before unloading the driver module.
es: `static int xxx_isa_detach (device_t dev);` Libera el dispositivo antes de descargar el módulo del controlador.
ru: `static int xxx_isa_detach (device_t dev);` Отсоединение устройства перед выгрузкой модуля драйвера.

source: `static int xxx_isa_shutdown (device_t dev);` Execute shutdown of the device before system shutdown.
es: `static int xxx_isa_shutdown (device_t dev);` Ejecuta el apagado del dispositivo antes del apagado del sistema.
ru: `static int xxx_isa_shutdown (device_t dev);` Выполняет завершение работы устройства перед выключением системы.

source: `static int xxx_isa_suspend (device_t dev);` Suspend the device before the system goes to the power-save state. May also abort transition to the power-save state.
es: `static int xxx_isa_suspend (device_t dev);` Suspende el dispositivo antes de que el sistema entre en estado de ahorro de energía. También puede abortar la transición al estado de ahorro de energía.
ru: `static int xxx_isa_suspend (device_t dev);` Приостанавливает устройство перед переходом системы в энергосберегающий режим. Также может прервать переход в энергосберегающий режим.

source: `static int xxx_isa_resume (device_t dev);` Resume the device activity after return from power-save state.
es: `static int xxx_isa_resume (device_t dev);` Retoma la actividad en el dispositivo después de volver del estado de ahorro de energía.
ru: `static int xxx_isa_resume (device_t dev);` Возобновляет активность устройства после возврата из энергосберегающего состояния.

source: `xxx_isa_probe()` and `xxx_isa_attach()` are mandatory, the rest of the routines are optional, depending on the device's needs.
es: `xxx_isa_probe()` y `xxx_isa_attach()` son obligatorios, el resto de las rutinas son opcionales, dependiendo de las necesidades del dispositivo.
ru: `xxx_isa_probe()` и `xxx_isa_attach()` являются обязательными, остальные процедуры опциональны и зависят от потребностей устройства.

source: The driver is linked to the system with the following set of descriptions.
es: El controlador está enlazado con el sistema con el conjunto de descripciones siguientes.
ru: Драйвер связан с системой следующим набором описаний.

source: Here struct `xxx_softc` is a device-specific structure that contains private driver data and descriptors for the driver's resources. The bus code automatically allocates one softc descriptor per device as needed.
es: Aquí la estructura `xxx_softc` es un estructura específica del dispositivo que contiene datos privados del controlador y descriptores para los recursos del controlador. El código del bus reserva automáticamente un descriptor softc por cada dispositivo según sea necesario.
ru: Здесь структура `xxx_softc` — это специфичная для устройства структура, которая содержит приватные данные драйвера и дескрипторы ресурсов драйвера. Код шины автоматически выделяет один дескриптор softc для каждого устройства по мере необходимости.

source: If the driver is implemented as a loadable module then `load_function()` is called to do driver-specific initialization or clean-up when the driver is loaded or unloaded and load_argument is passed as one of its arguments. If the driver does not support dynamic loading (in other words it must always be linked into the kernel) then these values should be set to 0 and the last definition would look like:
es: Si el controlador se implementa como un módulo cargable entonces se llama a la función `load_function()`para realizar una inicialización específica del dispositivo o una limpieza cuando el controlador es cargado o descargado y se pasa load_argument como uno de sus argumentos. Si el controlador no soporta carga dinámica (en otras palabras siempre tiene que enlazarse en el kernel) entonces estos valores deberían establecerse a 0 y la última definición quedaría así:
ru: Если драйвер реализован в виде загружаемого модуля, то `load_function()` вызывается для выполнения специфичной для драйвера инициализации или очистки при загрузке или выгрузке драйвера, а `load_argument` передаётся в качестве одного из её аргументов. Если драйвер не поддерживает динамическую загрузку (другими словами, он всегда должен быть связан с ядром), то эти значения должны быть установлены в 0, и последнее определение будет выглядеть следующим образом:

source: If the driver is for a device which supports PnP then a table of supported PnP IDs must be defined. The table consists of a list of PnP IDs supported by this driver and human-readable descriptions of the hardware types and models having these IDs. It looks like:
es: Si el controlador es para un dispositivo que soporta PnP entonces se debe definir una tabla de IDs PnP soportados. La tabla consiste en una lista de IDs PnP soportados por este controlador y descripciones legibles de los tipos de hardware y modeles que tienen estos IDs. Tiene este aspecto:
ru: Если драйвер предназначен для устройства с поддержкой PnP, то должна быть определена таблица поддерживаемых PnP ID. Таблица состоит из списка PnP ID, поддерживаемых этим драйвером, и удобочитаемых описаний типов аппаратного обеспечения и моделей, имеющих эти ID. Это выглядит следующим образом:

source: If the driver does not support PnP devices it still needs an empty PnP ID table, like:
es: Si el controlador no soporta dispositivos PnP aún así necesita una tabla PnP vacía como:
ru: Если драйвер не поддерживает устройства PnP, ему все равно нужна пустая таблица идентификаторов PnP, например:

source: `device_t` Pointer
ru: Указатель `device_t`

source: `device_t` is the pointer type for the device structure. Here we consider only the methods interesting from the device driver writer's standpoint. The methods to manipulate values in the device structure are:
es: `device_t` es el tipo puntero para la estructura del dispositivo. Aquí sólo consideramos métodos interesantes desde el punto de vista del programador de controladores de dispositivos. Los métodos para manipular valores en la estructura del dispositivo son:
ru: `device_t` — это тип указателя на структуру устройства. Здесь мы рассматриваем только методы, представляющие интерес с точки зрения разработчика драйверов устройств. Методы для работы со значениями в структуре устройства следующие:

source: `device_t device_get_parent(dev)` Get the parent bus of a device.
es: `device_t device_get_parent(dev)` Obtener el bus padre de un dispositivo.
ru: `device_t device_get_parent(dev)` Получить родительскую шину устройства.

source: `driver_t device_get_driver(dev)` Get pointer to its driver structure.
es: `driver_t device_get_driver(dev)` Obtener un puntero a su estructura de controlador.
ru: `driver_t device_get_driver(dev)` Получить указатель на структуру его драйвера.

source: `char *device_get_name(dev)` Get the driver name, such as `"xxx"` for our example.
es: `char *device_get_name(dev)` Obtener el nombre del controlador, como `"xxx"` en nuestro ejemplo.
ru: `char *device_get_name(dev)` Получить имя драйвера, например `"xxx"` в нашем примере.

source: `int device_get_unit(dev)` Get the unit number (units are numbered from 0 for the devices associated with each driver).
es: `int device_get_unit(dev)` Obtener el número de unidad (las unidades se numeran empezando en 0 para los dispositivos asociados con cada controlador).
ru: `int device_get_unit(dev)` Получить номер устройства (устройства нумеруются с 0 для устройств, связанных с каждым драйвером).

source: `char *device_get_nameunit(dev)` Get the device name including the unit number, such as "xxx0", "xxx1" and so on.
es: `char *device_get_nameunit(dev)` Obtener el nombre del dispositivo incluido el número de unidad, como "xxx0", "xxx1" etc.
ru: `char *device_get_nameunit(dev)` Получить имя устройства, включая номер юнита, например, "xxx0", "xxx1" и так далее.

source: `char *device_get_desc(dev)` Get the device description. Normally it describes the exact model of device in human-readable form.
es: `char *device_get_desc(dev)` Obtener la descripción del dispositivo. Normalmente describe el modelo exacto de dispositivo en forma legible para las personas.
ru: `char *device_get_desc(dev)` Получить описание устройства. Обычно оно описывает точную модель устройства в удобочитаемом виде.

source: `device_set_desc(dev, desc)` Set the description. This makes the device description point to the string desc which may not be deallocated or changed after that.
es: `device_set_desc(dev, desc)` Establecer la descripción. Esto hace que la descripción del dispositivo apunte a la cadena desc que no debería ser liberada o cambiada después de esto.
ru: `device_set_desc(dev, desc)` Установить описание. Это заставляет описание устройства указывать на строку desc, которая не может быть освобождена или изменена после этого.

source: `device_set_desc_copy(dev, desc)` Set the description. The description is copied into an internal dynamically allocated buffer, so the string desc may be changed afterwards without adverse effects.
es: `device_set_desc_copy(dev, desc)` Establecer la descripción. La descripción se copia en un búfer interno reservado dinámicamente, de forma que la cadena desc podría cambiarse posteriormente sin efectos adversos.
ru: `device_set_desc_copy(dev, desc)` Установить описание. Описание копируется во внутренний динамически выделяемый буфер, поэтому строка desc может быть изменена впоследствии без негативных последствий.

source: `void *device_get_softc(dev)` Get pointer to the device descriptor (struct `xxx_softc`) associated with this device.
es: `void *device_get_softc(dev)` Obtener un puntero al descriptor de dispositivo (struct `xxx_softc`) asociado con este dispositivo.
ru: `void *device_get_softc(dev)` Получить указатель на дескриптор устройства (структура `xxx_softc`), связанный с данным устройством.

source: `u_int32_t device_get_flags(dev)` Get the flags specified for the device in the configuration file.
es: `u_int32_t device_get_flags(dev)` Obtener los flags especificados en el fichero de configuración para el dispositivo.
ru: `u_int32_t device_get_flags(dev)` Получить флаги, указанные для устройства в файле конфигурации.

source: A convenience function `device_printf(dev, fmt, ...)` may be used to print the messages from the device driver. It automatically prepends the unitname and colon to the message.
es: La función de ayuda `device_printf(dev, fmt, ...)` puede usarse para imprimir los mensajes del controlador de dispositivo. Añade de forma automática un prefijo con el nombre de la unidad y dos puntos antes del mensaje.
ru: Функция для удобства `device_printf(dev, fmt, ...)` может использоваться для вывода сообщений из драйвера устройства. Она автоматически добавляет имя устройства и двоеточие перед сообщением.

source: The device_t methods are implemented in the file [.filename]#kern/bus_subr.c#.
es: Los métodos de device_t se implementan en el fichero [.filename]#kern/bus_subr.c#.
ru: Методы device_t реализованы в файле [.filename]#kern/bus_subr.c#.

source: Configuration File and the Order of Identifying and Probing During Auto-Configuration
es: El Fichero de Configuración y el Orden de la Identificación y el Sondeo Durante la Auto-Configuración
ru: Файл конфигурации и порядок определения и проверки при автоматической настройке

source: The ISA devices are described in the kernel configuration file like:
es: Los dispositivos ISA se describen en el fichero de configuración del kernel como sigue:
ru: Устройства ISA описываются в файле конфигурации ядра следующим образом:

source: The values of port, IRQ and so on are converted to the resource values associated with the device. They are optional, depending on the device's needs and abilities for auto-configuration. For example, some devices do not need DRQ at all and some allow the driver to read the IRQ setting from the device configuration ports. If a machine has multiple ISA buses the exact bus may be specified in the configuration line, like `isa0` or `isa1`, otherwise the device would be searched for on all the ISA buses.
es: Los valores del puerto, IRQ y demás se convierten a valores de recursos asociados con el dispositivo. Son opcionales, dependiendo de las necesidades del dispositivo y las capacidades de auto-configuración. Por ejemplo, algunos dispositivos no necesitan DRQ en absoluto y algunos permiten al controlador leer la configuración de las IRQ desde los puertos de configuración del dispositivo. Si una máquina tiene varios buses ISA se tiene que especificar el bus exacto en la línea de configuración, como `isa0` o `isa1`, de lo contrario se buscaría el dispositivo en todos los buses ISA.
ru: Значения порта, IRQ и т. д. преобразуются в ресурсы, связанные с устройством. Они являются необязательными, в зависимости от потребностей устройства и его способностей к автонастройке. Например, некоторым устройствам вообще не нужен DRQ, а некоторые позволяют драйверу читать настройку IRQ из портов конфигурации устройства. Если в машине несколько шин ISA, точная шина может быть указана в строке конфигурации, например `isa0` или `isa1`, иначе устройство будет искаться на всех шинах ISA.

source: `sensitive` is a resource requesting that this device must be probed before all non-sensitive devices. It is supported but does not seem to be used in any current driver.
es: `sensitive` es un recurso que solicita que se sondee este dispositivo antes de aquellos que sean no-sensitive. Se soporta pero no parece que se use actualmente en ningún controlador.
ru: `sensitive` — это ресурс, указывающий, что данное устройство должно быть проверено перед всеми нечувствительными устройствами. Он поддерживается, но, похоже, не используется ни в одном текущем драйвере.

source: For legacy ISA devices in many cases the drivers are still able to detect the configuration parameters. But each device to be configured in the system must have a config line. If two devices of some type are installed in the system but there is only one configuration line for the corresponding driver, ie:
es: Para dispositivos ISA antiguos en muchos casos los controladores todavía son capaces de detectar los parámetros de configuración. Pero cada dispositivo que necesita ser configurado en el sistema necesita tener una línea de configuración. Si dos dispositivos de un tipo se instalan en el sistema pero sólo hay una línea de configuración para el controlador correspondiente, es decir:
ru: Для устаревших устройств ISA во многих случаях драйверы всё ещё могут определять параметры конфигурации. Однако каждое устройство, которое необходимо настроить в системе, должно иметь строку конфигурации. Если в системе установлено два устройства одного типа, но для соответствующего драйвера есть только одна строка конфигурации, например:

source: then only one device will be configured.
es: entonces sólo se configurará un dispositivo.
ru: тогда будет настроено только одно устройство.

source: But for the devices supporting automatic identification by the means of Plug-n-Play or some proprietary protocol one configuration line is enough to configure all the devices in the system, like the one above or just simply:
es: Pero para dispositivos que soportan identificación automática mediante Plug-n-Play o algún protocolo propietario es suficiente con una línea de configuración para configurar todos los dispositivos en el sistema, como la mostrada arriba o simplemente:
ru: Однако для устройств, поддерживающих автоматическую идентификацию с помощью Plug-n-Play или какого-либо проприетарного протокола, достаточно одной строки конфигурации для настройки всех устройств в системе, как в примере выше или просто:

source: If a driver supports both auto-identified and legacy devices and both kinds are installed at once in one machine then it is enough to describe in the config file the legacy devices only. The auto-identified devices will be added automatically.
es: Si un controlador soporta tanto auto-identificación como dispositivos antiguos y se instalan ambos tipos a la vez en una máquina entonces es suficiente describir en el fichero de configuración sólo los dispositivos antiguos. Los dispositivos auto-identificados se añadirán automáticamente.
ru: Если драйвер поддерживает как автоматически определяемые, так и устаревшие устройства, и оба типа установлены одновременно в одной машине, то достаточно описать в конфигурационном файле только устаревшие устройства. Автоматически определяемые устройства будут добавлены автоматически.

source: When an ISA bus is auto-configured the events happen as follows:
es: Cuando se auto-configura un bus ISA se suceden los siguientes eventos:
ru: При автоматической настройке шины ISA события происходят в следующем порядке:

source: All the drivers' identify routines (including the PnP identify routine which identifies all the PnP devices) are called in random order. As they identify the devices they add them to the list on the ISA bus. Normally the drivers' identify routines associate their drivers with the new devices. The PnP identify routine does not know about the other drivers yet so it does not associate any with the new devices it adds.
es: Todas las rutinas de identificación de los controladores (incluida la rutina de identificación PnP que identifica todos los dispositivos PnP) se llaman en orden aleatorio. Según se identifican los dispositivos se añaden a la lista en el bus ISA. Normalmente las rutinas de identificación de los controladores asocian sus controladores con los nuevos dispositivos. La rutina de identificación PnP no sabe nada acerca de otros controladores todavía de forma que no se asocia con ninguno de los nuevos dispositivos que añade.
ru: Все процедуры идентификации драйверов (включая процедуру идентификации PnP, которая определяет все устройства PnP) вызываются в случайном порядке. Когда они идентифицируют устройства, они добавляют их в список на шине ISA. Обычно процедуры идентификации драйверов связывают свои драйверы с новыми устройствами. Процедура идентификации PnP пока не знает о других драйверах, поэтому не связывает ни один из них с новыми устройствами, которые она добавляет.

source: The PnP devices are put to sleep using the PnP protocol to prevent them from being probed as legacy devices.
es: Los dispositivos PnP se ponen a dormir usando el protocolo PnP para evitar que sean sondeados como dispositivos antiguos.
ru: Устройства PnP переводятся в режим сна с использованием протокола PnP, чтобы предотвратить их обнаружение как устаревших устройств.
