Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: Next the driver may want to reset the hardware to some consistent state. That includes stopping any ongoing transfers, disabling the DMA channels and interrupts to avoid memory corruption by the device. For most of the drivers this is exactly what the shutdown routine does, so if it is included in the driver we can just call it.
es: Después el controlador puede querer resetear el hardware a un estado consistente. Esto incluye parar cualquier transferencia en curso, deshabilitar los canales DMA y las interrupciones para evitar corrupciones de memoria por parte del dispositivo. Para la mayoría de los controladores esto es exactamente lo que hace la rutina de parada, de forma que si se incluye en el controlador simplemente podemos llamarla.
ru: Далее драйвер может сбросить аппаратное обеспечение в согласованное состояние. Это включает остановку любых текущих передач, отключение каналов DMA и прерываний, чтобы избежать повреждения памяти устройством. Для большинства драйверов это именно то, что делает процедура выключения, поэтому, если она присутствует в драйвере, мы можем просто вызвать её.

source: And finally release all the resources and return success.
es: Y finalmente libera todos los recursos y devuelve éxito.
ru: И наконец освободить все ресурсы и вернуть успех.

source: This routine is called when the system is about to be shut down. It is expected to bring the hardware to some consistent state. For most of the ISA devices no special action is required, so the function is not really necessary because the device will be re-initialized on reboot anyway. But some devices have to be shut down with a special procedure, to make sure that they will be properly detected after soft reboot (this is especially true for many devices with proprietary identification protocols). In any case disabling DMA and interrupts in the device registers and stopping any ongoing transfers is a good idea. The exact action depends on the hardware, so we do not consider it here in any detail.
es: Esta rutina se llama cuando el sistema está a punto de apagarse. Se espera que lleve el hardware a un estado consistente. Para la mayoría de los dispositivos ISA no se requiere ninguna acción especial, así que la función no es realmente necesaria ya que el dispositivo se reinicializará al reiniciar de todas formas. Pero algunos dispositivos tienen que apagarse con un procedimiento especial, para asegurarse de que serán detectados después de un reinicio suave (esto es especialmente cierto para muchos dispositivos con protocolos de identificación propietarios). En cualquier caso desactivar DMA y las interrupciones en los registros del dispositivo y parar las transferencias en curso es una buena idea. La acción exacta depende del hardware, así que no la consideramos aquí con detalle.
ru: Эта процедура вызывается, когда система собирается быть выключена. Ожидается, что она приведет оборудование в согласованное состояние. Для большинства устройств ISA не требуется никаких специальных действий, поэтому функция не является действительно необходимой, так как устройство будет переинициализировано при перезагрузке в любом случае. Однако некоторые устройства должны быть выключены с помощью специальной процедуры, чтобы убедиться, что они будут правильно обнаружены после мягкой перезагрузки (это особенно актуально для многих устройств с проприетарными протоколами идентификации). В любом случае отключение DMA и прерываний в регистрах устройства и остановка любых текущих передач — это хорошая идея. Точные действия зависят от оборудования, поэтому мы не рассматриваем их здесь подробно.

source: The interrupt handler is called when an interrupt is received which may be from this particular device. The ISA bus does not support interrupt sharing (except in some special cases) so in practice if the interrupt handler is called then the interrupt almost for sure came from its device. Still, the interrupt handler must poll the device registers and make sure that the interrupt was generated by its device. If not it should just return.
es: El manejador de interrupción se llama cuando se recibe una interrupción que podría ser de este dispositivo particular. El bus ISA no tiene soporte para compartir interrupciones (excepto en algunos casos especiales) así que en la práctica el manejador de interrupción se llama cuando la interrupción casi seguro que proviene de este dispositivo. Aún así, el manejador de interrupción debe sondear los registros del dispositivo y asegurarse que la interrupción vino de él. Si no es así simplemente debe retornar.
ru: Обработчик прерывания вызывается при получении прерывания, которое может быть от данного конкретного устройства. Шина ISA не поддерживает разделение прерываний (за исключением некоторых специальных случаев), поэтому на практике, если вызывается обработчик прерывания, то прерывание почти наверняка поступило от его устройства. Тем не менее, обработчик прерывания должен опросить регистры устройства и убедиться, что прерывание было сгенерировано его устройством. Если нет, он должен просто вернуть управление.

source: The old convention for the ISA drivers was getting the device unit number as an argument. This is obsolete, and the new drivers receive whatever argument was specified for them in the attach routine when calling `bus_setup_intr()`. By the new convention it should be the pointer to the structure softc. So the interrupt handler commonly starts as:
es: La antigua convención para los controladores ISA era obtener el número de unidad del dispositivo como un argumento. Esto está obsoleto, y los nuevos controladores reciben cualquier argumento que se haya especificado en la rutina de adjuntar cuando se llama a `bus_setup_intr()`. Según la nueva convención debería ser un puntero a la estructura softc. De forma que el manejador de interrupción normalmente comienza así:
ru: Старая практика для драйверов ISA заключалась в получении номера устройства в качестве аргумента. Это устарело, и новые драйверы получают любой аргумент, указанный для них в процедуре присоединения при вызове `bus_setup_intr()`. Согласно новой практике, это должен быть указатель на структуру softc. Таким образом, обработчик прерываний обычно начинается так:

source: It runs at the interrupt priority level specified by the interrupt type parameter of `bus_setup_intr()`. That means that all the other interrupts of the same type as well as all the software interrupts are disabled.
es: Se ejecuta en el nivel de prioridad de la interrupción especificado por el parámetro tipo de interrupción de `bus_setup_intr()`. Eso significa que las demás interrupciones del mismo tipo así como las interrupciones software están deshabilitadas.
ru: Он выполняется на уровне приоритета прерывания, указанном параметром типа прерывания в `bus_setup_intr()`. Это означает, что все остальные прерывания того же типа, а также все программные прерывания, отключены.

source: To avoid races it is commonly written as a loop:
es: Pare evitar carreras se suele escribir como un bucle:
ru: Во избежание гонок это обычно записывается в виде цикла:

source: The interrupt handler has to acknowledge interrupt to the device only but not to the interrupt controller, the system takes care of the latter.
es: El manejador de interrupción tiene que reconocer la interrupción ante el dispositivo pero no ante el controlador, el sistema se encarga de esto último.
ru: Обработчик прерывания должен подтвердить прерывание только устройству, но не контроллеру прерываний, система позаботится о последнем.
