Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/isa/_index.po
Languages: es, ru

source: B_RAW - if set then the DMA controller will remember the buffer and after the end of transfer will automatically re-initialize itself to repeat transfer of the same buffer again (of course, the driver may change the data in the buffer before initiating another transfer in the device). If not set then the parameters will work only for one transfer, and `isa_dmastart()` will have to be called again before initiating the next transfer. Using B_RAW makes sense only if the bounce buffer is not used.
es: B_RAW - si se establece entonces el controlador DMA recordará el búfer y después de la transferencia se reiniciará a sí mismo automáticamente para repetir la transferencia del mismo búfer (por supuesto, el controlador puede cambiar los datos en el búfer antes de iniciar otra transferencia en el dispositivo). Si no se establece entonces los parámetros funcionarán sólo para una transferencia, y se tendrá que llamar de nuevo a `isa_dmastart()` antes de iniciar la siguiente transferencia. Usar B_RAW sólo tiene sentido si no se usa un búfer "bounce".
ru: B_RAW - если установлен, то контроллер DMA запомнит буфер и после завершения передачи автоматически переинициализирует себя для повторной передачи того же буфера (конечно, драйвер может изменить данные в буфере перед инициированием следующей передачи на устройстве). Если не установлен, то параметры будут работать только для одной передачи, и перед инициированием следующей передачи снова потребуется вызвать `isa_dmastart()`. Использование B_RAW имеет смысл только если промежуточный буфер не используется.

source: addr - virtual address of the buffer
es: addr - dirección virtual del búfer
ru: addr - виртуальный адрес буфера

source: nbytes - length of the buffer. Must be less or equal to 64KB. Length of 0 is not allowed: the DMA controller will understand it as 64KB while the kernel code will understand it as 0 and that would cause unpredictable effects. For channels number 4 and higher the length must be even because these channels transfer 2 bytes at a time. In case of an odd length the last byte will not be transferred.
es: nbytes - longitud del búfer. Debe ser menor o igual a 64KB. La longitud 0 no está permitida: el controlador DMA lo entenderá como 64KB mientras que el código del núcleo lo entenderá como 0 y eso tendría efectos impredecibles. Para los canales número 4 y superiores la longitud debe ser par porque estos canales transfieren 2 bytes cada vez. En caso de una longitud impar no se transmitirá el último byte.
ru: nbytes - длина буфера. Должна быть меньше или равна 64 КБ. Длина 0 не допускается: контроллер DMA интерпретирует это как 64 КБ, в то время как код ядра поймёт это как 0, что приведёт к непредсказуемым последствиям. Для каналов номер 4 и выше длина должна быть чётной, так как эти каналы передают по 2 байта за раз. В случае нечётной длины последний байт не будет передан.

source: chan - channel number
es: chan - número de canal
ru: chan - номер канала

source: Synchronize the memory after device reports that transfer is done. If that was a read operation with a bounce buffer then the data will be copied from the bounce buffer to the original buffer. Arguments are the same as for `isa_dmastart()`. Flag B_RAW is permitted but it does not affect `isa_dmadone()` in any way.
es: Sincroniza la memoria después de que el dispositivo informe de que la transferencia ha finalizado. Si era una operación de lectura con un búfer de amortiguación entonces los datos se copiarán desde el búfer de amortiguación al búfer original. Los argumentos son los mismos que para `isa_dmastart()`. Se permite el flag B_RAW pero no afecta a `isa_dmadone()` en modo alguno.
ru: Синхронизировать память после того, как устройство сообщает о завершении передачи. Если это была операция чтения с промежуточным буфером, то данные будут скопированы из этого буфера в исходный буфер. Аргументы такие же, как у `isa_dmastart()`. Флаг B_RAW разрешён, но он никак не влияет на `isa_dmadone()`.

source: Returns the number of bytes left in the current transfer to be transferred. In case the flag B_READ was set in `isa_dmastart()` the number returned will never be equal to zero. At the end of transfer it will be automatically reset back to the length of buffer. The normal use is to check the number of bytes left after the device signals that the transfer is completed. If the number of bytes is not 0 then something probably went wrong with that transfer.
es: Devuelve el número de bytes que faltan por transferir en la transferencia actual. En caso de que se estableciera el flag B_READ en `isa_dmastart()` el número devuelto nunca será cero. Al final de la transferencia se reseteará automáticamente al tamaño del búfer. El uso normal es comprobar el número de bytes pendientes después de que el dispositivo señalice que la transferencia se ha completado. Si el número de bytes no es 0 entonces algo ha ido mal con la transferencia.
ru: Возвращает количество оставшихся для передачи байт в текущей передаче. Если флаг B_READ был установлен в `isa_dmastart()`, возвращаемое значение никогда не будет равно нулю. В конце передачи оно автоматически сбрасывается обратно к длине буфера. Обычное использование — проверка количества оставшихся байт после того, как устройство сигнализирует о завершении передачи. Если количество байт не равно 0, то, вероятно, в передаче произошла ошибка.

source: Aborts the current transfer and returns the number of bytes left untransferred.
es: Aborta la transferencia actual y devuelve el número de bytes que quedan por transferir.
ru: Прерывает текущую передачу и возвращает количество непереданных байтов.

source: This function probes if a device is present. If the driver supports auto-detection of some part of device configuration (such as interrupt vector or memory address) this auto-detection must be done in this routine.
es: Esta función sondea si un dispositivo está presente. Si el controlador soporta auto-detección de alguna parte de la configuración (como un vector de interrupción o dirección de memoria) esta auto-detección se debe hacer en esta rutina.
ru: Эта функция проверяет наличие устройства. Если драйвер поддерживает автоматическое определение некоторых параметров конфигурации устройства (таких как вектор прерывания или адрес памяти), это автоматическое определение должно выполняться в данной процедуре.

source: As for any other bus, if the device cannot be detected or is detected but failed the self-test or some other problem happened then it returns a positive value of error. The value `ENXIO` must be returned if the device is not present. Other error values may mean other conditions. Zero or negative values mean success. Most of the drivers return zero as success.
es: Como en cualquier otro bus, si el dispositivo no puede ser detectado o es detectado pero falla en el auto chequeo o hay algún otro problema entonces devuelve un valor de error positivo. El valor `ENXIO` se debe devolver si el dispositivo no está presente. Otros valores pueden significar otras condiciones. Cero o valores negativos significan éxito. La mayoría de los controladores devuelven cero como éxito.
ru: Как и для любой другой шины, если устройство не может быть обнаружено, или обнаружено, но не прошло самопроверку, или возникла другая проблема, то возвращается положительное значение ошибки. Значение `ENXIO` должно возвращаться, если устройство отсутствует. Другие значения ошибок могут означать иные условия. Нулевые или отрицательные значения означают успех. Большинство драйверов возвращают ноль в случае успеха.

source: The negative return values are used when a PnP device supports multiple interfaces. For example, an older compatibility interface and a newer advanced interface which are supported by different drivers. Then both drivers would detect the device. The driver which returns a higher value in the probe routine takes precedence (in other words, the driver returning 0 has highest precedence, one returning -1 is next, one returning -2 is after it and so on). In result the devices which support only the old interface will be handled by the old driver (which should return -1 from the probe routine) while the devices supporting the new interface as well will be handled by the new driver (which should return 0 from the probe routine).
es: Los valores de retorno negativos se usan cuando un dispositivo PnP suporta múltiples interfaces. Por ejemplo, una interfaz de compatibilidad más antigua y una interfaz avanzada más nueva que son soportadas por diferentes controladores. Ambos controladores detectarán el dispositivo. El controlador que devuelva el valor más alto en la rutina de sondeo tomará precedencia (en otras palabras, el controlador que devuelva 0 tendrá la precedencia más alta, el que devuelva -1 la siguiente, el que de devuelva -2 la siguiente y así). Como resultado los dispositivos que sólo soporten la interfaz antigua se manejarán con el controlador antiguo (que debería devolver -1 en la rutina de sondeo) mientras que los dispositivos que soporten interfaces nuevas también serán manejadas por controladores nuevos (que deberían devolver 0 desde la rutina de sondeo).
ru: Отрицательные возвращаемые значения используются, когда устройство PnP поддерживает несколько интерфейсов. Например, старый совместимый интерфейс и новый расширенный интерфейс, которые поддерживаются разными драйверами. В этом случае оба драйвера обнаружат устройство. Драйвер, который возвращает большее значение в процедуре обнаружения, получает приоритет (другими словами, драйвер, возвращающий 0, имеет наивысший приоритет, возвращающий -1 — следующий, возвращающий -2 — за ним и так далее). В результате устройства, поддерживающие только старый интерфейс, будут обрабатываться старым драйвером (который должен возвращать -1 из процедуры probe), а устройства, поддерживающие также новый интерфейс, будут обрабатываться новым драйвером (который должен возвращать 0 из процедуры обнаружения).

source: The device descriptor struct xxx_softc is allocated by the system before calling the probe routine. If the probe routine returns an error the descriptor will be automatically deallocated by the system. So if a probing error occurs the driver must make sure that all the resources it used during probe are deallocated and that nothing keeps the descriptor from being safely deallocated. If the probe completes successfully the descriptor will be preserved by the system and later passed to the routine `xxx_isa_attach()`. If a driver returns a negative value it can not be sure that it will have the highest priority and its attach routine will be called. So in this case it also must release all the resources before returning and if necessary allocate them again in the attach routine. When `xxx_isa_probe()` returns 0 releasing the resources before returning is also a good idea and a well-behaved driver should do so. But in cases where there is some problem with releasing the resources the driver is allowed to keep resources between returning 0 from the probe routine and execution of the attach routine.
es: El descriptor de dispositivo struct xxx_softc es reservado por el sistema antes de llamar a la rutina de sondeo. Si la rutina de sondeo devuelve error el sistema libera el descriptor automáticamente. De forma que si ocurre un error de sondeo el controlador debe asegurarse de que todos los recursos usados durante el sondeo son liberados y que nada impide que el descriptor pueda ser liberado con seguridad. Si el sondeo termina con éxito el sistema guardará el descriptor y lo pasará posteriormente a la rutina `xxx_isa_attach()`. Si un controlador devuelve un valor negativo no puede estar seguro de que tendrá la máxima prioridad y se llamará a su rutina de adjuntar. En este caso también debe liberar los recursos antes de regresar y si es necesario reservarlos de nuevo en la rutina de adjuntar. Cuando `xxx_isa_probe()` devuelve 0 también es buena idea liberar los recursos antes de volver y un buen controlador debería hacerlo. Pero en casos donde hay algún problema liberando recursos se permite al controlador mantenerlos entre que devuelve 0 desde la rutina de sondeo y la ejecución de la rutina de adjuntar.
ru: Структура дескриптора устройства `xxx_softc` выделяется системой до вызова процедуры обнаружения. Если процедура обнаружения возвращает ошибку, дескриптор автоматически освобождается системой. Поэтому при возникновении ошибки обнаружения драйвер должен убедиться, что все ресурсы, использованные во время обнаружения, освобождены и ничто не мешает безопасному освобождению дескриптора.Если обнаружение завершается успешно, дескриптор сохраняется системой и позже передаётся в процедуру `xxx_isa_attach()`. Если драйвер возвращает отрицательное значение, он не может быть уверен, что получит наивысший приоритет и его процедура присоединения будет вызвана. Поэтому в этом случае он также должен освободить все ресурсы перед возвратом и, если необходимо, выделить их снова в процедуре присоединения. Когда `xxx_isa_probe()` возвращает 0, освобождение ресурсов перед возвратом также является хорошей практикой, и корректно работающий драйвер должен так поступать. Однако в случаях, когда возникают проблемы с освобождением ресурсов, драйверу разрешается сохранять ресурсы между возвратом 0 из процедуры обнаружения и выполнением процедуры присоединения.

source: A typical probe routine starts with getting the device descriptor and unit:
es: Una rutina de sondeo típica comienza obteniendo el descriptor y la unidad del dispositivo:
ru: Типичная процедура обнаружения начинается с получения дескриптора устройства и номера устройства:

source: Then check for the PnP devices. The check is carried out by a table containing the list of PnP IDs supported by this driver and human-readable descriptions of the device models corresponding to these IDs.
es: Después comprueba los dispositivos PnP. La comprobación se realiza con una tabla que contiene la lista de IDs PnP soportados por el controlador y unas descripciones en formato legible de los modelos de dispositivo que corresponden con esos IDs.
ru: Затем проверьте устройства PnP. Проверка осуществляется с помощью таблицы, содержащей список PnP ID, поддерживаемых этим драйвером, и удобочитаемые описания моделей устройств, соответствующих этим ID.

source: The logic of ISA_PNP_PROBE is the following: If this card (device unit) was not detected as PnP then ENOENT will be returned. If it was detected as PnP but its detected ID does not match any of the IDs in the table then ENXIO is returned. Finally, if it has PnP support and it matches on of the IDs in the table, 0 is returned and the appropriate description from the table is set by `device_set_desc()`.
es: La lógica de ISA_PNP_PROBE es la siguiente: si la tarjeta (unidad de dispositivo) no se detectó como PnP, entonces se devuelve ENOENT. Si se detectó como PnP pero su ID no corresponde con ninguno de los IDs de la tabla entonces se devuelve ENXIO. Por último, si tiene soporte PnP y concuerda con un ID de la tabla, se devuelve 0 y se establece la descripción correspondiente de la tabla en la función `device_set_desc()`.
ru: Логика работы `ISA_PNP_PROBE` следующая: если данная карта (устройство) не была обнаружена как PnP, то будет возвращено `ENOENT`. Если она была обнаружена как PnP, но её обнаруженный ID не совпадает ни с одним из ID в таблице, то возвращается `ENXIO`. Наконец, если устройство поддерживает PnP и его ID совпадает с одним из ID в таблице, возвращается `0`, а соответствующее описание из таблицы устанавливается с помощью `device_set_desc()`.

source: If a driver supports only PnP devices then the condition would look like:
es: Si un controlador sólo soporta dispositivos PnP entonces la condición sería:
ru: Если драйвер поддерживает только устройства PnP, то условие будет выглядеть следующим образом:

source: No special treatment is required for the drivers which do not support PnP because they pass an empty PnP ID table and will always get ENXIO if called on a PnP card.
es: No se requiere un tratamiento especial para los controladores que no soportan PnP porque pasan un ID vacío a la tabla y siempre obtendrán ENXIO si se llama sobre una tarjeta PnP.
ru: Для драйверов, которые не поддерживают PnP, не требуется специальной обработки, так как они передают пустую таблицу идентификаторов PnP и всегда будут получать ENXIO при вызове на PnP-карте.

source: The probe routine normally needs at least some minimal set of resources, such as I/O port number to find the card and probe it. Depending on the hardware the driver may be able to discover the other necessary resources automatically. The PnP devices have all the resources pre-set by the PnP subsystem, so the driver does not need to discover them by itself.
es: Normalmente la rutina de sondeo necesita al menos un conjunto mínimo de recursos, como números de puerto de I/O para encontrar la tarjeta y sondearla. Dependiendo del hardware el controlador puede ser capaz de descubrir otros recursos automáticamente. Los dispositivos PnP tienen todos los recursos preestablecidos por el subsistema PnP, así que el controlador no necesita descubrirlos por él mismo.
ru: Функция обнаружения обычно требует как минимум некоторый минимальный набор ресурсов, например, номер порта ввода-вывода, чтобы найти карту и проверить её. В зависимости от оборудования драйвер может автоматически обнаружить другие необходимые ресурсы. Устройства PnP имеют все ресурсы, предварительно установленные подсистемой PnP, поэтому драйверу не нужно обнаруживать их самостоятельно.

source: Typically the minimal information required to get access to the device is the I/O port number. Then some devices allow to get the rest of information from the device configuration registers (though not all devices do that). So first we try to get the port start value:
es: Típicamente la información mínima necesaria para acceder al dispositivo es el número de puerto de I/O. Después algunos dispositivos permiten obtener el resto de la información de los registros de configuración del dispositivo (aunque no todos los dispositivos lo hacen). Así que primero intentamos obtener el valor de inicio del puerto:
ru: Обычно минимальная информация, необходимая для доступа к устройству, — это номер порта ввода-вывода. Затем некоторые устройства позволяют получить остальную информацию из регистров конфигурации устройства (хотя не все устройства это поддерживают). Поэтому сначала мы пытаемся получить начальное значение порта:

source: The base port address is saved in the structure softc for future use. If it will be used very often then calling the resource function each time would be prohibitively slow. If we do not get a port we just return an error. Some device drivers can instead be clever and try to probe all the possible ports, like this:
es: La dirección base del puerto se salva en la estructura softc para su uso posterior. Se fuera a usarse muy a menudo llamar a la función del recurso cada vez sería muy lento. Si no obtenemos un puerto simplemente devolvemos un error. Algunos controladores de dispositivo pueden intentar ser listos y probar a sondear todos los puertos posibles, de esta forma:
ru: Базовый адрес порта сохраняется в структуре softc для последующего использования. Если он будет использоваться очень часто, то вызов функции ресурса каждый раз будет неприемлемо медленным. Если мы не получаем порт, мы просто возвращаем ошибку. Некоторые драйверы устройств могут вместо этого быть умнее и попытаться обнаружить все возможные порты, например:

source: Of course, normally the driver's `identify()` routine should be used for such things. But there may be one valid reason why it may be better to be done in `probe()`: if this probe would drive some other sensitive device crazy. The probe routines are ordered with consideration of the `sensitive` flag: the sensitive devices get probed first and the rest of the devices later. But the `identify()` routines are called before any probes, so they show no respect to the sensitive devices and may upset them.
es: Por supuesto, normalmente se debería usar la rutina `identify()` de los controladores para estas cosas. Pero podría haber alguna razón válida para que fuera mejor hacerlo en `probe()`: si este sondeo hace enloquecer a algún otro dispositivo que sea sensible. Las rutinas de sondeo se ordenan conforme al flag `sensitive`: los dispositivos sensibles se prueban primero y luego van los demás dispositivos. Pero las rutinas `identify()` se llaman antes que ningún sondeo, de forma que no respetan a los dispositivos sensibles y podrían ponerlos tristes.
ru: Конечно, обычно для таких вещей следует использовать процедуру `identify()` драйвера. Однако может быть одна веская причина, почему лучше сделать это в `probe()`: если этот обнаружение может привести к сбою другого чувствительного устройства. Процедуры обнаружения упорядочены с учетом флага `sensitive`: чувствительные устройства проверяются первыми, а остальные устройства — позже. Но процедуры `identify()` вызываются до любого обнаружения, поэтому они не учитывают чувствительные устройства и могут вызвать их сбой.

source: Now, after we got the starting port we need to set the port count (except for PnP devices) because the kernel does not have this information in the configuration file.
es: Ahora, después de tener el puerto de inicio necesitamos establecer el número de puertos (excepto para los dispositivos PnP) porque el kernel no tiene esta información en el fichero de configuración.
ru: Вот, после того как мы получили начальный порт, необходимо установить количество портов (за исключением устройств PnP), так как в файле конфигурации ядра эта информация отсутствует.

source: Finally allocate and activate a piece of port address space (special values of start and end mean "use those we set by ``bus_set_resource()``"):
es: Por último reservar y activar una parte del espacio de direcciones del puerto (valores especiales de start y end significan "usa aquellos establecidos por ``bus_set_resource()``"):
ru: Наконец, выделите и активируйте часть адресного пространства порта (специальные значения start и end означают "используйте те, что мы установили через ``bus_set_resource()``"):

source: Now having access to the port-mapped registers we can poke the device in some way and check if it reacts like it is expected to. If it does not then there is probably some other device or no device at all at this address.
es: Ahora que tenemos acceso a los registros de los puertos mapeados podemos mirar en el dispositivo y comprobar si reacciona como se supone que debería hacerlo. Si no lo hace entonces probablemente haya otro dispositivo o no haya dispositivo en absoluto en esta dirección.
ru: Теперь, имея доступ к регистрам с отображением на порты, мы можем каким-либо образом взаимодействовать с устройством и проверить, реагирует ли оно так, как ожидается. Если этого не происходит, вероятно, по этому адресу находится другое устройство или его там нет вовсе.
