Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mail/_index.po
Languages: ru

source: This chapter provides a basic introduction to running a mail server on FreeBSD, as well as an introduction to sending and receiving email using FreeBSD
ru: Эта глава содержит базовое введение в настройку почтового сервера на FreeBSD, а также основы отправки и получения электронной почты с использованием FreeBSD

source: IV. Network Communication
ru: IV. Сетевое взаимодействие

source: Chapter 31. Electronic Mail
ru: Глава 31. Электронная почта

source: Electronic Mail
ru: Электронная почта

source: Synopsis
ru: Обзор

source: "Electronic Mail", better known as email, is one of the most widely used forms of communication today. This chapter provides a basic introduction to running a mail server on FreeBSD, as well as an introduction to sending and receiving email using FreeBSD. For a complete coverage of this subject, refer to the books listed in crossref:bibliography[bibliography,Bibliography].
ru: "Электронная почта", более известная как email, является одним из самых распространённых средств связи в наши дни. Эта глава даёт базовое введение в настройку почтового сервера на FreeBSD, а также основы отправки и получения электронной почты с использованием FreeBSD. Для полного ознакомления с темой обратитесь к книгам, перечисленным в crossref:bibliography[bibliography,Библиография].

source: This chapter covers:
ru: Эта глава охватывает:

source: Which software components are involved in sending and receiving electronic mail.
ru: Какие программные компоненты участвуют в отправке и получении электронной почты.

source: How to configure DragonFly Mail Agent.
ru: Как настроить DragonFly Mail Agent.

source: Where basic Sendmail configuration files are located in FreeBSD.
ru: Где расположены основные файлы конфигурации Sendmail в FreeBSD.

source: The difference between remote and local mailboxes.
ru: Разница между удаленными и локальными почтовыми ящиками.

source: How to install and configure an alternate Mail Transfer Agent, replacing DragonFly Mail Agent or Sendmail.
ru: Как установить и настроить альтернативный агент передачи почты (MTA), заменяющий DragonFly Mail Agent или Sendmail.

source: How to troubleshoot common mail server problems.
ru: Как устранить распространённые проблемы с почтовым сервером.

source: How to configure Sendmail to only send mail.
ru: Как настроить Sendmail только для отправки почты.

source: How to configure SMTP authentication for added security in Sendmail.
ru: Как настроить аутентификацию SMTP для повышения безопасности в Sendmail.

source: How to install and use a Mail User Agent, such as mutt, to send and receive email.
ru: Как установить и использовать почтовый клиент, например mutt, для отправки и получения электронной почты.

source: How to download mail from a remote POP or IMAP server.
ru: Как загружать почту с удаленного POP или IMAP сервера.

source: How to automatically apply filters and rules to incoming email.
ru: Как автоматически применять фильтры и правила к входящей почте.

source: Mail Components
ru: Компоненты почты

source: There are five major parts involved in an email exchange: the Mail User Agent (MUA), the Mail Transfer Agent (MTA), a mail host, a remote or local mailbox, and DNS. This section provides an overview of these components.
ru: В процессе обмена электронной почтой участвуют пять основных компонентов: почтовый пользовательский агент (MUA), агент пересылки почты (MTA), почтовый хост, удалённый или локальный почтовый ящик и DNS. В этом разделе представлен обзор этих компонентов.

source: Mail User Agent (MUA)
ru: Почтовый клиент (MUA)

source: The Mail User Agent (MUA) is an application which is used to compose, send, and receive emails. This application can be a command line program, such as the built-in `mail` utility or a third-party application from the Ports Collection, such as alpine, elm, or mutt. Dozens of graphical programs are also available in the Ports Collection, including Claws Mail, Evolution, and Thunderbird. Some organizations provide a web mail program which can be accessed through a web browser. More information about installing and using a MUA on FreeBSD can be found in crossref:mail[mail-agents, Mail User Agents].
ru: Почтовый клиент (Mail User Agent — MUA) — это приложение, используемое для создания, отправки и получения электронных писем. Это может быть программа командной строки, например встроенная утилита `mail` или стороннее приложение из коллекции портов, такое как alpine, elm или mutt. В коллекции портов также доступны десятки графических программ, включая Claws Mail, Evolution и Thunderbird. Некоторые организации предоставляют веб-почту, доступную через браузер. Дополнительную информацию об установке и использовании MUA в FreeBSD можно найти в crossref:mail[mail-agents, Почтовые клиенты].

source: Mail Transfer Agent (MTA)
ru: Почтовый агент пересылки (MTA)

source: The Mail Transfer Agent (MTA) is responsible for receiving incoming mail and delivering outgoing mail. Starting with FreeBSD version 14.0, the default MTA is DragonFly Mail Agent (man:dma[8]); in earlier versions, it is man:sendmail[8]. Other MTAs, including Exim, Postfix, and qmail, may be installed to replace the default MTA.
ru: Агент пересылки почты (MTA) отвечает за получение входящей почты и отправку исходящей. Начиная с версии FreeBSD 14.0, MTA по умолчанию — DragonFly Mail Agent (man:dma[8]); в более ранних версиях используется man:sendmail[8]. Другие MTA, такие как Exim, Postfix и qmail, могут быть установлены для замены MTA по умолчанию.

source: Mail Host and Mailboxes
ru: Почтовый сервер и почтовые ящики

source: The mail host is a server that is responsible for delivering and receiving mail for a host or a network. The mail host collects all mail sent to the domain and stores it either in the default `mbox` or the alternative Maildir format, depending on the configuration. Once mail has been stored, it may either be read locally using a MUA or remotely accessed and collected using protocols such as POP or IMAP. If mail is read locally, a POP or IMAP server does not need to be installed.
ru: Почтовый сервер — это сервер, отвечающий за доставку и получение почты для хоста или сети. Почтовый сервер собирает всю почту, отправленную в домен, и сохраняет её либо в формате `mbox` по умолчанию, либо в альтернативном формате Maildir, в зависимости от конфигурации. После сохранения почты её можно прочитать локально с помощью почтового клиента или удалённо получить с использованием протоколов, таких как POP или IMAP. Если почта читается локально, устанавливать сервер POP или IMAP не требуется.

source: Domain Name System (DNS)
ru: Система доменных имен (DNS)

source: The Domain Name System (DNS) and its daemon man:named[8] play a large role in the delivery of mail. In order to deliver mail from one site to another, the MTA will look up the remote site in DNS to determine which host will receive mail for the destination. This process also occurs when mail is sent from a remote host to the MTA.
ru: Система доменных имен (DNS) и ее демон man:named[8] играют важную роль в доставке почты. Чтобы доставить почту от одного узла к другому, MTA ищет удаленный узел в DNS, чтобы определить, какой хост будет принимать почту для адресата. Этот процесс также происходит, когда почта отправляется с удаленного хоста на MTA.

source: DragonFly Mail Agent (DMA)
ru: Почтовый агент DragonFly (DMA)

source: DragonFly Mail Agent (DMA) is the default MTA in FreeBSD starting with version 14.0. man:dma[8] is a small Mail Transport Agent (MTA), designed for home and office use. It accepts mails from locally installed Mail User Agents (MUA) and delivers the mails either locally or to a remote destination. Remote delivery includes several features like TLS/SSL support and SMTP authentication.
ru: Почтовый агент DragonFly (DMA — DragonFly Mail Agent) — это почтовый агент, используемый в FreeBSD по умолчанию начиная с версии 14.0. man:dma[8] представляет собой небольшой почтовый транспортный агент (MTA), предназначенный для домашнего и офисного использования. Он принимает почту от локально установленных почтовых пользовательских агентов и доставляет её либо локально, либо удалённо. Удалённая доставка включает в себя такие функции, как поддержка TLS/SSL и аутентификация SMTP.

source: man:dma[8] is not intended as a replacement for real, big MTAs like man:sendmail[8] or man:postfix[1]. Consequently, man:dma[8] does not listen on port 25 for incoming connections.
ru: man:dma[8] не предназначен в качестве замены полноценным, крупным MTA, таким как man:sendmail[8] или man:postfix[1]. Следовательно, man:dma[8] не прослушивает порт 25 для входящих соединений.

source: Configuring DragonFly Mail Agent (DMA)
ru: Настройка почтового агента DragonFly

source: DMA comes with a default configuration that will be suitable for many deployments. Custom settings are defined in [.filename]#/etc/dma/dma.conf#, and SMTP authentication is configured in [.filename]#/etc/dma/auth.conf#.
ru: DMA поставляется с конфигурацией по умолчанию, которая подходит для многих вариантов установки. Пользовательские настройки определяются в [.filename]#/etc/dma/dma.conf#, а аутентификация SMTP настраивается в [.filename]#/etc/dma/auth.conf#.

source: Using DMA to Route Outgoing Mail through Gmail (STARTTLS:SMTP example)
ru: Использование DMA для маршрутизации исходящей почты через Gmail (пример STARTTLS:SMTP)

source: This example [.filename]#/etc/dma/dma.conf# can be used to send mail using Google's SMTP servers.
ru: Этот пример [.filename]#/etc/dma/dma.conf# можно использовать для отправки почты через SMTP-серверы Google.

source: Authentication can be set with one line in [.filename]#/etc/dma/auth.conf#:
ru: Аутентификацию можно настроить одной строкой в [.filename]#/etc/dma/auth.conf#:

source: If you have 2-factor authentication enabled, you will need to generate an application-specific password as your normal login password will be rejected. See Google documentation for more information on https://myaccount.google.com/apppasswords[app-specific passwords].
ru: Если у вас включена двухфакторная аутентификация, потребуется сгенерировать пароль для приложения, так как обычный пароль для входа будет отклонён. Дополнительную информацию о https://myaccount.google.com/apppasswords[паролях для приложений] смотрите в документации Google.

source: Execute the following command to test the configuration:
ru: Выполните следующую команду для проверки конфигурации:

source: Using DMA to Route Outgoing Mail through Fastmail (SSL/TLS example)
ru: Использование DMA для маршрутизации исходящей почты через Fastmail (пример SSL/TLS)

source: This example [.filename]#/etc/dma/dma.conf# can be used to send mail using Fastmail's SMTP servers.
ru: Этот пример [.filename]#/etc/dma/dma.conf# можно использовать для отправки почты через SMTP-серверы Fastmail.

source: Using DMA to Route Outgoing Mail through a Custom Mail Host
ru: Использование DMA для маршрутизации исходящей почты через пользовательский почтовый хост

source: This example [.filename]#/etc/dma/dma.conf# can be used to send mail using a custom mail host.
ru: Этот пример [.filename]#/etc/dma/dma.conf# можно использовать для отправки почты через пользовательский почтовый сервер.

source: Sendmail is a venerable and versatile Mail Transfer Agent (MTA) with a long history in UNIX(R) and UNIX-like systems. It was a part of the FreeBSD base system until FreeBSD 13, offering robust email transport capabilities, extensive customization options, and support for complex routing and filtering.
ru: Sendmail - это старейший и многофункциональный агент пересылки почты (MTA) с долгой историей в UNIX(R) и UNIX-подобных системах. Он входил в базовую систему FreeBSD вплоть до версии 13, предоставляя надежные возможности транспортировки почты, широкие варианты настройки и поддержку сложной маршрутизации и фильтрации.

source: Configuration Files
ru: Файлы конфигурации

source: The configuration files for Sendmail are located in [.filename]#/etc/mail/#.
ru: Конфигурационные файлы Sendmail находятся в [.filename]#/etc/mail/#.

source: This access database file defines which hosts or IP addresses have access to the local mail server and what kind of access they have. Hosts listed as `OK`, which is the default option, are allowed to send mail to this host as long as the mail's final destination is the local machine. Hosts listed as `REJECT` are rejected for all mail connections. Hosts listed as `RELAY` are allowed to send mail for any destination using this mail server. Hosts listed as `ERROR` will have their mail returned with the specified mail error. If a host is listed as `SKIP`, Sendmail will abort the current search for this entry without accepting or rejecting the mail. Hosts listed as `QUARANTINE` will have their messages held and will receive the specified text as the reason for the hold.
ru: Этот файл базы данных доступа определяет, какие хосты или IP-адреса имеют доступ к локальному почтовому серверу и какой тип доступа им предоставлен. Хосты, указанные как `OK` (что является опцией по умолчанию), могут отправлять почту на этот хост при условии, что конечный пункт назначения почты — локальная машина. Хосты, указанные как `REJECT`, отклоняются для всех почтовых соединений. Хосты, указанные как `RELAY`, могут отправлять почту для любого адресата через этот почтовый сервер. Хосты, указанные как `ERROR`, получат возврат своей почты с указанной почтовой ошибкой. Если хост указан как `SKIP`, Sendmail прервет текущий поиск для этой записи без принятия или отклонения почты. Сообщения хостов, указанных как `QUARANTINE`, будут задержаны и хосты получат указанный текст в качестве причины задержки.

source: Examples of using these options for both IPv4 and IPv6 addresses can be found in the FreeBSD sample configuration, [.filename]#/etc/mail/access.sample#:
ru: Примеры использования этих параметров для адресов IPv4 и IPv6 можно найти в образце конфигурации FreeBSD, [.filename]#/etc/mail/access.sample#:

source: To configure the access database, use the format shown in the sample to make entries in [.filename]#/etc/mail/access#, but do not put a comment symbol (`+#+`) in front of the entries. Create an entry for each host or network whose access should be configured. Mail senders that match the left side of the table are affected by the action on the right side of the table.
ru: Для настройки базы данных доступа используйте формат, приведенный в примере, чтобы внести записи в [.filename]#/etc/mail/access#, но не ставьте символ комментария (`+#+`) перед записями. Создайте запись для каждого хоста или сети, для которых нужно настроить доступ. Отправители почты, соответствующие левой части таблицы, будут обработаны согласно действию, указанному в правой части таблицы.

source: Whenever this file is updated, update its database and restart Sendmail:
ru: При каждом обновлении этого файла обновите его базу данных и перезапустите Sendmail:

source: This database file contains a list of virtual mailboxes that are expanded to users, files, programs, or other aliases. Here are a few entries to illustrate the file format:
ru: Этот файл базы данных содержит список виртуальных почтовых ящиков, которые преобразуются в пользователей, файлы, программы или другие псевдонимы. Вот несколько записей, иллюстрирующих формат файла:

source: The mailbox name on the left side of the colon is expanded to the target(s) on the right. The first entry expands the `root` mailbox to the `localuser` mailbox, which is then looked up in the [.filename]#/etc/mail/aliases# database. If no match is found, the message is delivered to `localuser`. The second entry shows a mail list. Mail to `ftp-bugs` is expanded to the three local mailboxes `joe`, `eric`, and `paul`. A remote mailbox could be specified as _user@example.com_. The third entry shows how to write mail to a file, in this case [.filename]#/dev/null#. The last entry demonstrates how to send mail to a program, [.filename]#/usr/local/bin/procmail#, through a UNIX(R) pipe. Refer to man:aliases[5] for more information about the format of this file.
ru: Имя почтового ящика слева от двоеточия раскрывается в целевые адреса справа. Первая запись раскрывает почтовый ящик `root` в почтовый ящик `localuser`, который затем ищется в базе данных [.filename]#/etc/mail/aliases#. Если совпадение не найдено, сообщение доставляется в `localuser`. Вторая запись показывает почтовый список. Письма для `ftp-bugs` раскрываются в три локальных почтовых ящика: `joe`, `eric` и `paul`. Удалённый почтовый ящик может быть указан как _user@example.com_. Третья запись демонстрирует, как записывать почту в файл, в данном случае [.filename]#/dev/null#. Последняя запись показывает, как отправить почту в программу [.filename]#/usr/local/bin/procmail# через UNIX(R)-канал. Дополнительную информацию о формате этого файла можно найти в man:aliases[5].

source: Whenever this file is updated, run `newaliases` to update and initialize the aliases database.
ru: Всякий раз, когда этот файл обновляется, выполните `newaliases` для обновления и инициализации базы данных псевдонимов.

source: This is the master configuration file for Sendmail. It controls the overall behavior of Sendmail, including everything from rewriting email addresses to printing rejection messages to remote mail servers. Accordingly, this configuration file is quite complex. Fortunately, this file rarely needs to be changed for standard mail servers.
ru: Это основной конфигурационный файл для Sendmail. Он определяет общее поведение Sendmail, включая все — от перезаписи email-адресов до вывода сообщений об отказе для удалённых почтовых серверов. Соответственно, этот конфигурационный файл довольно сложен. К счастью, для стандартных почтовых серверов его редко требуется изменять.

source: The master Sendmail configuration file can be built from man:m4[1] macros that define the features and behavior of Sendmail. Refer to [.filename]#/usr/src/contrib/sendmail/cf/README# for some of the details.
ru: Основной конфигурационный файл Sendmail может быть создан из макросов man:m4[1], определяющих функции и поведение Sendmail. Подробности можно найти в [.filename]#/usr/src/contrib/sendmail/cf/README#.

source: Whenever changes to this file are made, Sendmail needs to be restarted for the changes to take effect.
ru: Всякий раз, когда в этот файл вносятся изменения, Sendmail необходимо перезапустить, чтобы изменения вступили в силу.

source: This database file maps mail addresses for virtual domains and users to real mailboxes. These mailboxes can be local, remote, aliases defined in [.filename]#/etc/mail/aliases#, or files. This allows multiple virtual domains to be hosted on one machine.
ru: Этот файл базы данных сопоставляет почтовые адреса виртуальных доменов и пользователей с реальными почтовыми ящиками. Эти почтовые ящики могут быть локальными, удалёнными, алиасами, определёнными в [.filename]#/etc/mail/aliases#, или файлами. Это позволяет размещать несколько виртуальных доменов на одной машине.

source: FreeBSD provides a sample configuration file in [.filename]#/etc/mail/virtusertable.sample# to further demonstrate its format. The following example demonstrates how to create custom entries using that format:
ru: FreeBSD предоставляет пример файла конфигурации в [.filename]#/etc/mail/virtusertable.sample#, который дополнительно демонстрирует его формат. В следующем примере показано, как создавать пользовательские записи с использованием этого формата:

source: This file is processed in a first match order. When an email address matches the address on the left, it is mapped to the local mailbox listed on the right. The format of the first entry in this example maps a specific email address to a local mailbox, whereas the format of the second entry maps a specific email address to a remote mailbox. Finally, any email address from `example.com` which has not matched any of the previous entries will match the last mapping and be sent to the local mailbox `joe`. When creating custom entries, use this format and add them to [.filename]#/etc/mail/virtusertable#. Whenever this file is edited, update its database and restart Sendmail:
ru: Этот файл обрабатывается по принципу первого совпадения. Когда электронный адрес соответствует адресу слева, он сопоставляется с локальным почтовым ящиком, указанным справа. Формат первой записи в этом примере сопоставляет конкретный электронный адрес с локальным почтовым ящиком, тогда как формат второй записи сопоставляет конкретный электронный адрес с удалённым почтовым ящиком. Наконец, любой электронный адрес из `example.com`, который не совпал ни с одной из предыдущих записей, будет соответствовать последнему сопоставлению и отправлен в локальный почтовый ящик `joe`. При создании пользовательских записей используйте этот формат и добавляйте их в [.filename]#/etc/mail/virtusertable#. При каждом редактировании этого файла обновите его базу данных и перезапустите Sendmail:

source: In a default FreeBSD installation, Sendmail is configured to only send mail from the host it is running on. For example, if a POP server is available, users will be able to check mail from remote locations but they will not be able to send outgoing emails from outside locations. Typically, a few moments after the attempt, an email will be sent from `MAILER-DAEMON` with a `5.7 Relaying Denied` message.
ru: В стандартной установке FreeBSD Sendmail настроен так, чтобы отправлять почту только с хоста, на котором он работает. Например, если доступен POP-сервер, пользователи смогут проверять почту с удалённых устройств, но не смогут отправлять письма извне. Обычно через некоторое время после попытки отправки придёт письмо от `MAILER-DAEMON` с сообщением `5.7 Relaying Denied`.

source: The most straightforward solution is to add the ISP's FQDN to [.filename]#/etc/mail/relay-domains#. If multiple addresses are needed, add them one per line:
ru: Наиболее простое решение — добавить полное доменное имя (FQDN) провайдера в [.filename]#/etc/mail/relay-domains#. Если требуется добавить несколько адресов, укажите их по одному на строку:

source: After creating or editing this file, restart Sendmail with `service sendmail restart`.
ru: После создания или редактирования этого файла перезапустите Sendmail с помощью команды `service sendmail restart`.

source: Now any mail sent through the system by any host in this list, provided the user has an account on the system, will succeed. This allows users to send mail from the system remotely without opening the system up to relaying SPAM from the Internet.
ru: Теперь любая почта, отправленная через систему с любого хоста из этого списка, при условии, что у пользователя есть учетная запись в системе, будет доставлена успешно. Это позволяет пользователям отправлять почту с системы удаленно, не открывая систему для ретрансляции спама из Интернета.

source: Changing the Mail Transfer Agent
ru: Изменение агента передачи почты

source: Starting with FreeBSD version 14.0, man:dma[8] is the default MTA, and before 14.0, the default MTA is man:sendmail[8]. However, the system administrator can change the system's MTA. A wide choice of alternative MTAs is available from the `mail` category of the FreeBSD Ports Collection.
ru: Начиная с версии FreeBSD 14.0, man:dma[8] является MTA по умолчанию, а до версии 14.0 MTA по умолчанию — man:sendmail[8]. Однако системный администратор может изменить MTA системы. Широкий выбор альтернативных MTA доступен в категории `mail` коллекции портов FreeBSD.
