Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mail/_index.po
Languages: ru

source: In order to have mail delivered directly to a host, it must have a permanent static IP address, not a dynamic IP address. If the system is behind a firewall, it must be configured to allow SMTP traffic. To receive mail directly at a host, one of these two must be configured:
ru: Для того чтобы почта доставлялась напрямую на хост, у него должен быть постоянный статический IP-адрес, а не динамический. Если система находится за межсетевым экраном, он должен быть настроен для пропуска SMTP-трафика. Чтобы принимать почту напрямую на хосте, необходимо настроить одно из следующих двух условий:

source: Make sure that the lowest-numbered MX record in DNS points to the host's static IP address.
ru: Убедитесь, что MX-запись с наименьшим номером в DNS указывает на статический IP-адрес хоста.

source: Make sure there is no MX entry in the DNS for the host.
ru: Убедитесь, что в DNS для хоста нет записи MX.

source: Either of the above will allow mail to be received directly at the host.
ru: Любой из вышеперечисленных вариантов позволит получать почту напрямую на хост.

source: Try this:
ru: Попробуйте следующее:

source: The output should be similar to the following:
ru: Вывод должен быть похож на следующий:

source: In this example, mail sent directly to mailto:yourlogin@example.FreeBSD.org[yourlogin@example.FreeBSD.org] should work without problems, assuming a full-featured MTA is running correctly on `example.FreeBSD.org`. Note that man:dma[8] does not listen on port 25 for incoming connections and cannot be used in this scenario.
ru: В этом примере письма, отправленные напрямую на mailto:yourlogin@example.FreeBSD.org[yourlogin@example.FreeBSD.org], должны работать без проблем, при условии что полнофункциональный MTA корректно работает на `example.FreeBSD.org`. Обратите внимание, что man:dma[8] не слушает порт 25 для входящих соединений и не может быть использован в данном сценарии.

source: For this example:
ru: Для этого примера:

source: All mail sent to `example.FreeBSD.org` will be collected on `nevdull` under the same username instead of being sent directly to your host.
ru: Вся почта, отправленная на `example.FreeBSD.org`, будет собираться на `nevdull` под тем же именем пользователя вместо прямой отправки на ваш хост.

source: The above information is handled by the DNS server. The DNS record that carries mail routing information is the link:https://en.wikipedia.org/wiki/MX_record[mail exchanger record (MX record)]. If no MX record exists, mail will be delivered directly to the host by way of its IP address.
ru: Указанная выше информация обрабатывается DNS-сервером. DNS-запись, содержащая информацию о маршрутизации почты, называется link:https://en.wikipedia.org/wiki/MX_record[записью почтового обменника (MX-запись)]. Если MX-запись отсутствует, почта будет доставлена напрямую на хост по его IP-адресу.

source: The MX entry for `freefall.FreeBSD.org` at one time looked like this:
ru: Запись MX для `freefall.FreeBSD.org` когда-то выглядела так:

source: `freefall` had many MX entries. The lowest MX number is the host that receives mail directly, if available. If it is not accessible for some reason, the next lower-numbered host will accept messages temporarily, and pass it along when a lower-numbered host becomes available.
ru: `freefall` имел множество MX-записей. Наименьший номер MX указывает на хост, который принимает почту напрямую, если он доступен. Если он недоступен по какой-либо причине, следующий хост с меньшим номером временно примет сообщения и передаст их, когда хост с меньшим номером станет доступен.

source: Alternate MX sites should have separate Internet connections in order to be most useful. Your ISP can provide this service.
ru: Альтернативные MX-серверы должны иметь отдельные интернет-подключения для максимальной эффективности. Ваш провайдер может предоставить такую услугу.

source: Mail for a Domain
ru: Почта для домена

source: When configuring an MTA for a network, any mail sent to hosts in its domain should be diverted to the MTA so that users can receive their mail on the master mail server.
ru: Если MTA настраивается для сети, то любая почта, отправленная на хосты в его домене, должна перенаправляться на этот MTA, чтобы пользователи могли получать свою почту на главном почтовом сервере.

source: To make life easiest, a user account with the same _username_ should exist on both the MTA and the system with the MUA. Use man:adduser[8] to create the user accounts.
ru: Для максимального удобства учётная запись с тем же _именем пользователя_ должна существовать как на MTA, так и на системе с MUA. Для создания учётных записей используйте man:adduser[8].

source: In addition to adding local users to the host, there are alternative methods known as virtual users. Programs like link:https://www.cyrusimap.org/[Cyrus] and link:https://www.dovecot.org/[Dovecot] can be integrated into MTAs to handle users, mail storage, and also provide access via POP3 and IMAP.
ru: Помимо добавления локальных пользователей на хост, существуют альтернативные методы, известные как виртуальные пользователи. Такие программы, как link:https://www.cyrusimap.org/[Cyrus] и link:https://www.dovecot.org/[Dovecot], могут быть интегрированы в MTA для управления пользователями, хранения почты, а также предоставления доступа через POP3 и IMAP.

source: The MTA must be the designated mail exchanger for each workstation on the network. This is done in the DNS configuration with an MX record:
ru: Почтовый сервер (MTA) должен быть назначенным почтовым обменником для каждой рабочей станции в сети. Это делается в конфигурации DNS с помощью записи MX:

source: This will redirect mail for the workstation to the MTA no matter where the A record points. The mail is sent to the MX host.
ru: Это перенаправит почту для рабочей станции на MTA, независимо от того, куда указывает запись A. Почта отправляется на MX-хост.

source: This must be configured on a DNS server. If the network does not run its own DNS server, talk to the ISP or DNS provider.
ru: Это необходимо настроить на DNS-сервере. Если в сети не запущен собственный DNS-сервер, обратитесь к интернет или DNS-провайдеру.

source: The following is an example of virtual email hosting.
ru: Ниже приведен пример виртуального хостинга электронной почты.

source: Consider a customer with the domain `customer1.org`, where all the mail for `customer1.org` should be sent to `mail.myhost.com`.
ru: Рассмотрим клиента с доменом `customer1.org`, где вся почта для `customer1.org` должна отправляться на `mail.myhost.com`.

source: The DNS entry should look like this:
ru: Запись DNS должна выглядеть следующим образом:

source: An `A` record is _not_ needed for `customer1.org` in order to only handle email for that domain. However, running `ping` against `customer1.org` will not work unless an `A` record exists for it.
ru: Для обработки только электронной почты домена `customer1.org` запись типа `A` _не_ требуется. Однако команда `ping` для `customer1.org` не будет работать, если для этого домена не существует записи `A`.

source: Tell the MTA which domains and/or hostnames it should accept mail for. Either of the following will work for Sendmail:
ru: Укажите MTA, для каких доменов и/или имен хостов следует принимать почту. Для Sendmail подойдет любой из следующих вариантов:

source: Add the hosts to [.filename]#/etc/mail/local-host-names# when using the `FEATURE(use_cw_file)`.
ru: Добавьте хосты в [.filename]#/etc/mail/local-host-names#, если используется `FEATURE(use_cw_file)`.

source: Add a `Cwyour.host.com` line to [.filename]#/etc/sendmail.cf#.
ru: Добавьте строку `Cwyour.host.com` в файл [.filename]#/etc/sendmail.cf#.

source: Setting Up to Send Only
ru: Настройка только для отправки

source: There are many instances where one may only want to send mail through a relay. Some examples are:
ru: Существует множество случаев, когда требуется отправлять почту только через релейный сервер (SMTP-ретранслятор). Некоторые примеры:

source: The computer is a desktop machine that needs to use programs such as man:mail[1], using the ISP's mail relay.
ru: Компьютер представляет собой настольную машину, которой необходимо использовать программы, такие как man:mail[1], с использованием почтового ретранслятора интернет-провайдера.

source: The computer is a server that does not handle mail locally, but needs to pass off all mail to a relay for processing.
ru: Компьютер является сервером, который не обрабатывает почту локально, а передает всю почту релейному серверу для обработки.

source: While any MTA is capable of filling this particular niche, it can be difficult to properly configure a full-featured MTA just to handle offloading mail. Programs such as Sendmail and Postfix are overkill for this use.
ru: Хотя любая MTA способна выполнить эту конкретную задачу, правильная настройка полнофункциональной MTA только для обработки пересылки почты может быть сложной. Такие программы, как Sendmail и Postfix, являются избыточными для такого использования.

source: Additionally, a typical Internet access service agreement may forbid one from running a "mail server".
ru: Кроме того, стандартное соглашение об услуге доступа в Интернет может запрещать запуск «почтового сервера».

source: The easiest way to fulfill those needs is to use the man:dma[8] MTA included in the crossref:mail[configuring-dragonfly-mail-agent, base system]. For systems up to 13.2, need be to installed from ports.
ru: Самый простой способ удовлетворить эти потребности — использовать MTA man:dma[8], входящий в состав crossref:mail[configuring-dragonfly-mail-agent, базовой системы]. Для систем версии до 13.2 необходимо установить его из портов.

source: In addition to man:dma[8], third-party software can be used to achieve the same, like package:mail/ssmtp[].
ru: В дополнение к man:dma[8], для достижения того же результата можно использовать стороннее программное обеспечение, например package:mail/ssmtp[].

source: Once installed, package:mail/ssmtp[] can be configured with [.filename]#/usr/local/etc/ssmtp/ssmtp.conf#:
ru: После установки пакет package:mail/ssmtp[] можно настроить с помощью файла [.filename]#/usr/local/etc/ssmtp/ssmtp.conf#:

source: Use the real email address for `root`. Enter the ISP's outgoing mail relay in place of `mail.example.com`. Some ISPs call this the "outgoing mail server" or "SMTP server".
ru: Используйте настоящий адрес электронной почты для `root`. Введите исходящий почтовый релейный сервер вашего интернет-провайдера вместо `mail.example.com`. Некоторые провайдеры называют это "исходящий почтовый сервер" или "SMTP-сервер".

source: Make sure to disable Sendmail, including the outgoing mail service.
ru: Убедитесь, что Sendmail отключён, включая службу исходящей почты.

source: package:mail/ssmtp[] has some other options available. Refer to the examples in [.filename]#/usr/local/etc/ssmtp# or the manual page of ssmtp for more information.
ru: package:mail/ssmtp[] предоставляет дополнительные настройки. Для получения дополнительной информации обратитесь к примерам в [.filename]#/usr/local/etc/ssmtp# или к руководству ssmtp.

source: Setting up ssmtp in this manner allows any software on the computer that needs to send mail to function properly, while not violating the ISP's usage policy or allowing the computer to be hijacked for spamming.
ru: Настройка ssmtp таким образом позволяет любому программному обеспечению на компьютере, которому требуется отправлять почту, работать корректно, не нарушая политику использования провайдера и не позволяя компьютеру быть захваченным для рассылки спама.

source: SMTP Authentication in Sendmail
ru: Аутентификация SMTP в Sendmail

source: Configuring SMTP authentication on the MTA provides a number of benefits. SMTP authentication adds a layer of security to Sendmail, and provides mobile users who switch hosts the ability to use the same MTA without the need to reconfigure their mail client's settings each time.
ru: Настройка аутентификации SMTP на MTA предоставляет ряд преимуществ. Аутентификация SMTP добавляет уровень безопасности в Sendmail и позволяет мобильным пользователям, меняющим хосты, использовать один и тот же MTA без необходимости перенастраивать параметры почтового клиента каждый раз.

source: Install package:security/cyrus-sasl2[] from the Ports Collection. This port supports a number of compile-time options. For the SMTP authentication method demonstrated in this example, make sure that `LOGIN` is not disabled.
ru: Установите пакет package:security/cyrus-sasl2[] из Коллекции портов. Этот порт поддерживает ряд опций на этапе компиляции. Для метода аутентификации SMTP, демонстрируемого в данном примере, убедитесь, что `LOGIN` не отключен.

source: After installing package:security/cyrus-sasl2[], edit [.filename]#/usr/local/lib/sasl2/Sendmail.conf#, or create it if it does not exist, and add the following line:
ru: После установки пакета package:security/cyrus-sasl2[] отредактируйте файл [.filename]#/usr/local/lib/sasl2/Sendmail.conf# или создайте его, если он не существует, и добавьте следующую строку:

source: Next, install package:security/cyrus-sasl2-saslauthd[] and add execute the following command:
ru: Далее установите package:security/cyrus-sasl2-saslauthd[] и выполните следующую команду:

source: Finally, start the saslauthd daemon:
ru: Наконец, запустите демон saslauthd:

source: This daemon serves as a broker for Sendmail to authenticate against the FreeBSD man:passwd[5] database. This saves the trouble of creating a new set of usernames and passwords for each user that needs to use SMTP authentication, and keeps the login and mail password the same.
ru: Этот демон служит посредником для Sendmail при аутентификации в базе данных FreeBSD man:passwd[5]. Это избавляет от необходимости создавать новый набор имен пользователей и паролей для каждого пользователя, которому требуется аутентификация SMTP, и позволяет сохранять одинаковые пароли для входа в систему и для почты.

source: Next, edit [.filename]#/etc/make.conf# and add the following lines:
ru: Далее отредактируйте файл [.filename]#/etc/make.conf# и добавьте следующие строки:

source: These lines provide Sendmail the proper configuration options for linking to package:cyrus-sasl2[] at compile time. Make sure that package:cyrus-sasl2[] has been installed before recompiling Sendmail.
ru: Эти строки предоставляют Sendmail правильные параметры конфигурации для связи с package:cyrus-sasl2[] во время компиляции. Убедитесь, что package:cyrus-sasl2[] установлен перед перекомпиляцией Sendmail.

source: Recompile Sendmail by executing the following commands:
ru: Перекомпилируйте Sendmail, выполнив следующие команды:

source: This compile should not have any problems if [.filename]#/usr/src# has not changed extensively and the shared libraries it needs are available.
ru: Эта компиляция не должна вызывать проблем, если [.filename]#/usr/src# не подвергался значительным изменениям и необходимые динамические библиотеки доступны.

source: After Sendmail has been compiled and reinstalled, edit [.filename]#/etc/mail/freebsd.mc# or the local [.filename]#.mc#. Many administrators choose to use the output from man:hostname[1] as the name of [.filename]#.mc# for uniqueness.
ru: После компиляции и переустановки Sendmail отредактируйте файл [.filename]#/etc/mail/freebsd.mc# или локальный файл [.filename]#.mc#. Многие администраторы предпочитают использовать вывод команды man:hostname[1] в качестве имени файла [.filename]#.mc# для обеспечения уникальности.

source: Add these lines:
ru: Добавьте следующие строки:

source: These options configure the different methods available to Sendmail for authenticating users. To use a method other than pwcheck, refer to the Sendmail documentation.
ru: Эти параметры настраивают различные методы, доступные Sendmail для аутентификации пользователей. Чтобы использовать метод, отличный от pwcheck, обратитесь к документации Sendmail.

source: Finally, run man:make[1] while in [.filename]#/etc/mail#. That will run the new [.filename]#.mc# and create a [.filename]#.cf# named either [.filename]#freebsd.cf# or the name used for the local [.filename]#.mc#.
ru: Наконец, выполните man:make[1] в каталоге [.filename]#/etc/mail#. Это приведёт к обработке нового файла [.filename]#.mc# и созданию файла [.filename]#.cf# с именем [.filename]#freebsd.cf# или именем, использованным для локального файла [.filename]#.mc#.

source: Then, run `make install restart`, which will copy the file to [.filename]#sendmail.cf#, and properly restart Sendmail.
ru: Затем выполните `make install restart`, что скопирует файл в [.filename]#sendmail.cf# и корректно перезапустит Sendmail.

source: For more information about this process, refer to [.filename]#/etc/mail/Makefile#.
ru: Для получения дополнительной информации об этом процессе обратитесь к [.filename]#/etc/mail/Makefile#.

source: To test the configuration, use a MUA to send a test message. For further investigation, set the `LogLevel` of Sendmail to `13` and watch [.filename]#/var/log/maillog# for any errors.
ru: Для проверки конфигурации используйте MUA для отправки тестового сообщения. Для более детального анализа установите уровень журналирования (`LogLevel`) Sendmail на `13` и следите за файлом [.filename]#/var/log/maillog# на предмет ошибок.

source: For more information, refer to http://www.sendmail.org/~ca/email/auth.html[SMTP authentication].
ru: Для получения дополнительной информации обратитесь к http://www.sendmail.org/~ca/email/auth.html[аутентификации SMTP].
