Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mail/_index.po
Languages: ru

source: If the default's outgoing mail service is disabled, it is important that it is replaced with an alternative mail delivery system. Otherwise, system functions such as man:periodic[8] will be unable to deliver their results by email. Many parts of the system expect a functional MTA. If applications continue to use the default binaries to try to send email after they are disabled, mail could go into an inactive queue and never be delivered.
ru: Если исходящая почтовая служба по умолчанию отключена, важно заменить её альтернативной системой доставки почты. В противном случае системные функции, такие как man:periodic[8], не смогут отправлять свои результаты по электронной почте. Многие части системы предполагают наличие работоспособного MTA. Если приложения продолжат использовать стандартные исполняемые файлы для отправки почты после их отключения, письма могут попасть в неактивную очередь и никогда не быть доставлены.

source: Replacing Sendmail with Other MTA
ru: Замена Sendmail на другой MTA

source: In order to completely disable man:sendmail[8] execute the following commands:
ru: Чтобы полностью отключить man:sendmail[8], выполните следующие команды:

source: To only disable man:sendmail[8]'s incoming mail service execute the following command:
ru: Чтобы отключить только службу входящей почты man:sendmail[8], выполните следующую команду:

source: Then stop the man:sendmail[8] service:
ru: Затем остановите службу man:sendmail[8]:

source: Some extra configuration is needed as man:sendmail[8] is so ubiquitous that some software assumes it is already installed and configured. Check [.filename]#/etc/periodic.conf# and make sure that these values are set to `NO`. If this file does not exist, create it with these entries:
ru: Для корректной работы некоторых программ может потребоваться дополнительная настройка, так как man:sendmail[8] настолько распространён, что многие приложения предполагают его наличие и предварительную конфигурацию. Проверьте файл [.filename]#/etc/periodic.conf# и убедитесь, что указанные ниже параметры установлены в значение `NO`. Если файл не существует, создайте его и добавьте следующие записи:

source: The next step is to install another MTA, man:dma[8] will be used in this example. As pointed above, man:dma[8] is the default MTA in FreeBSD starting with version 14.0. Therefore, it is only necessary to install it from the ports if you are using a previous version.
ru: Следующий шаг — установка другого MTA, в данном примере будет использоваться man:dma[8]. Как упоминалось выше, man:dma[8] является MTA по умолчанию в FreeBSD начиная с версии 14.0. Следовательно, установка из портов требуется только при использовании более ранней версии.

source: To install it execute the following command:
ru: Для установки выполните следующую команду:

source: Perform the configuration as indicated in crossref:mail[configuring-dragonfly-mail-agent, Configuring DragonFly Mail Agent (DMA)].
ru: Выполните настройку, как указано в разделе crossref:mail[configuring-dragonfly-mail-agent, Настройка почтового агента DragonFly (DMA)].

source: Then change all the entries in the file [.filename]#/etc/mail/mailer.conf# to man:dma[8]:
ru: Затем измените все записи в файле [.filename]#/etc/mail/mailer.conf# на man:dma[8]:

source: When using the version of man:dma[8] included in the base system, the paths will change to [.filename]#/usr/libexec/dma#.
ru: При использовании версии man:dma[8], включенной в базовую систему, пути изменятся на [.filename]#/usr/libexec/dma#.

source: To ensure that anything in the queue is flushed at boot or before shutdown, execute the following command:
ru: Чтобы обеспечить сброс всего, что находится в очереди, при загрузке или перед завершением работы, выполните следующую команду:

source: Once everything is configured, it is recommended to reboot the system. Rebooting provides the opportunity to ensure that the system is correctly configured to start the new MTA automatically on boot.
ru: После завершения настройки рекомендуется перезагрузить систему. Перезагрузка позволяет убедиться, что система корректно настроена для автоматического запуска нового MTA при загрузке.

source: Replacing DragonFly Mail Agent (DMA) with Other MTA
ru: Замена почтового агента DragonFly (DMA) на другой MTA

source: As noted above, starting with FreeBSD version 14.0, the default MTA is DMA. In this example, package:mail/postfix[] will be used as the alternative MTA.
ru: Как упоминалось выше, начиная с FreeBSD версии 14.0, MTA по умолчанию — DMA. В этом примере будет использоваться package:mail/postfix[] в качестве альтернативного MTA.

source: Before installing package:mail/postfix[] some extra configuration is needed. Check [.filename]#/etc/periodic.conf# and make sure that these values are set to `NO`. If this file does not exist, create it with these entries:
ru: Перед установкой пакета package:mail/postfix[] требуется дополнительная настройка. Проверьте файл [.filename]#/etc/periodic.conf# и убедитесь, что указанные значения установлены в `NO`. Если файл не существует, создайте его со следующими записями:

source: Then install package:mail/postfix[]:
ru: Затем установите пакет package:mail/postfix[]:

source: To start package:mail/postfix[] at system boot execute the following command:
ru: Чтобы запустить пакет package:mail/postfix[] при загрузке системы, выполните следующую команду:

source: It is good practice to read the installation message after installing an application. Provides useful information about settings, etc.
ru: Хорошей практикой является прочтение сообщения после установки приложения. Оно содержит полезную информацию о настройках и т.д.

source: If postfix is *not* already activated in [.filename]#/usr/local/etc/mail/mailer.conf# execute the following commands:
ru: Если postfix *ещё не* активирован в [.filename]#/usr/local/etc/mail/mailer.conf#, выполните следующие команды:

source: When employing SASL, ensure that postfix has access to read the sasldb file. This is accomplished by adding postfix to group mail and making the [.filename]#/usr/local/etc/sasldb*# file(s) readable by group mail (this should be the default for new installs).
ru: При использовании SASL убедитесь, что postfix имеет доступ на чтение файла sasldb. Это достигается добавлением postfix в группу mail и установкой прав на чтение для группы mail для файлов [.filename]#/usr/local/etc/sasldb*# (это должно быть настроено по умолчанию при новых установках).

source: Mail User Agents
ru: Почтовые клиенты

source: A MUA is an application that is used to send and receive email. As email "evolves" and becomes more complex, MUAs are becoming increasingly powerful and provide users increased functionality and flexibility. The `mail` category of the FreeBSD Ports Collection contains numerous MUAs. These include graphical email clients such as Evolution or Balsa and console based clients such as mutt or alpine.
ru: MUA — это приложение, используемое для отправки и получения электронной почты. По мере того как электронная почта «развивается» и становится сложнее, MUA становятся всё более мощными и предоставляют пользователям больше функциональности и гибкости. В категории `mail` коллекции портов FreeBSD содержится множество MUA. Среди них есть графические клиенты электронной почты, такие как Evolution или Balsa, а также консольные клиенты, такие как mutt или alpine.

source: man:mail[1] is the default MUA installed with FreeBSD. It is a console based MUA that offers the basic functionality required to send and receive text-based email. It provides limited attachment support and can only access local mailboxes.
ru: man:mail[1] — это почтовый клиент (MUA), установленный в FreeBSD по умолчанию. Это консольный MUA, предоставляющий базовые функции для отправки и получения текстовых электронных писем. Он имеет ограниченную поддержку вложений и может работать только с локальными почтовыми ящиками.

source: Although man:mail[1] does not natively support interaction with POP or IMAP servers, these mailboxes may be downloaded to a local `mbox` using an application such as fetchmail or getmail.
ru: Хотя man:mail[1] изначально не поддерживает взаимодействие с серверами POP или IMAP, эти почтовые ящики могут быть загружены в локальный `mbox` с помощью таких приложений, как fetchmail или getmail.

source: In order to send and receive email, run man:mail[1]:
ru: Для отправки и получения электронной почты запустите man:mail[1]:

source: The contents of the user's mailbox in [.filename]#/var/mail# are automatically read by man:mail[1]. Should the mailbox be empty, the utility exits with a message indicating that no mail could be found. If mail exists, the application interface starts, and a list of messages will be displayed.
ru: Содержимое почтового ящика пользователя в [.filename]#/var/mail# автоматически читается утилитой man:mail[1]. Если почтовый ящик пуст, программа завершает работу с сообщением о том, что почта не найдена. Если письма есть, запускается интерфейс приложения и отображается список сообщений.

source: Messages are automatically numbered, as can be seen in the following example:
ru: Сообщения автоматически нумеруются, как видно в следующем примере:

source: Messages can now be read by typing kbd:[t] followed by the message number.
ru: Сообщения теперь можно читать, набрав kbd:[t] и затем номер сообщения.

source: This example reads the first email:
ru: Этот пример читает первое письмо:

source: As seen in this example, the message will be displayed with full headers.
ru: Как видно в этом примере, сообщение будет отображено с полными заголовками.

source: To display the list of messages again, press kbd:[h].
ru: Чтобы снова отобразить список сообщений, нажмите kbd:[h].

source: If the email requires a reply, press either kbd:[R] or kbd:[r] man:mail[1] keys. kbd:[R] instructs man:mail[1] to reply only to the sender of the email, while kbd:[r] replies to all other recipients of the message. These commands can be suffixed with the mail number of the message to reply to. After typing the response, the end of the message should be marked by a single kbd:[.] on its own line.
ru: Если требуется ответить на письмо, нажмите либо kbd:[R], либо kbd:[r] man:mail[1]. kbd:[R] указывает man:mail[1] ответить только отправителю письма, а kbd:[r] — всем остальным получателям сообщения. Эти команды могут быть дополнены номером письма, на которое нужно ответить. После ввода ответа конец сообщения должен быть обозначен отдельной строкой с kbd:[.].

source: An example can be seen below:
ru: Пример можно увидеть ниже:

source: In order to send a new email, press kbd:[m], followed by the recipient email address. Multiple recipients may be specified by separating each address with the kbd:[,] delimiter. The subject of the message may then be entered, followed by the message contents. The end of the message should be specified by putting a single kbd:[.] on its own line.
ru: Чтобы отправить новое письмо, нажмите kbd:[m], затем введите адрес электронной почты получателя. Несколько получателей можно указать, разделяя каждый адрес разделителем kbd:[,]. Затем можно ввести тему сообщения, за которым следует содержимое сообщения. Конец сообщения указывается отдельной строкой с символом kbd:[.].

source: While using man:mail[1], press kbd:[?] to display help at any time. Refer to man:mail[1] for more help on how to use man:mail[1].
ru: При использовании man:mail[1] нажмите kbd:[?], чтобы в любой момент отобразить справку. Дополнительную информацию об использовании man:mail[1] можно найти в man:mail[1].

source: man:mail[1] was not designed to handle attachments and thus deals with them poorly. Newer MUAs handle attachments in a more intelligent way.
ru: man:mail[1] не был предназначен для работы с вложениями и поэтому обрабатывает их плохо. Более современные почтовые клиенты (MUA) обрабатывают вложения более разумным способом.

source: Mutt is a powerful MUA, with many features, including:
ru: Mutt - это мощный MUA с множеством функций, включая:

source: The ability to thread messages.
ru: Возможность группировки цепочек сообщений.

source: PGP support for digital signing and encryption of email.
ru: Поддержку PGP для цифровой подписи и шифрования электронной почты.

source: MIME support.
ru: Поддержку MIME.

source: Maildir support.
ru: Поддержку Maildir.

source: Highly customizable.
ru: Большую гибкость в настройке.

source: Refer to link:http://www.mutt.org[http://www.mutt.org] for more information on Mutt.
ru: Обратитесь к ссылке link:http://www.mutt.org[http://www.mutt.org] для получения дополнительной информации о Mutt.

source: A Mutt fork called NeoMutt is worth mentioning, which brings added features. See more on the link:https://neomutt.org/about.html[NeoMutt website]. If NeoMutt was chosen, replace the following command examples from `mutt` to `neomutt`.
ru: Стоит упомянуть форк Mutt под названием NeoMutt, который добавляет новые возможности. Подробнее можно узнать по ссылке link:https://neomutt.org/about.html[сайт NeoMutt]. Если выбран NeoMutt, замените следующие примеры команд с `mutt` на `neomutt`.

source: Mutt may be installed using the package:mail/mutt[] port. After the port has been installed, Mutt can be started by issuing the following command:
ru: Mutt может быть установлен с использованием порта package:mail/mutt[]. После установки порта Mutt можно запустить, выполнив следующую команду:

source: Mutt will automatically read and display the contents of the user mailbox in [.filename]#/var/mail#. If no mails are found, Mutt will wait for commands from the user. The example below shows Mutt displaying a list of messages:
ru: Mutt автоматически прочитает и отобразит содержимое почтового ящика пользователя в [.filename]#/var/mail#. Если письма не найдены, Mutt будет ожидать команд от пользователя. В примере ниже показан список сообщений в Mutt:

source: Mutt email client showing a list of messages
ru: Клиент электронной почты Mutt, отображающий список сообщений

source: To read an email, select it using the cursor keys and press kbd:[Enter]. An example of Mutt displaying email can be seen below:
ru: Чтобы прочитать письмо, выберите его с помощью клавиш курсора и нажмите kbd:[Enter]. Пример отображения письма в Mutt показан ниже:

source: Mutt email client displaying an email
ru: Почтовый клиент Mutt, отображающий письмо

source: Similar to man:mail[1], Mutt can be used to reply only to the sender of the message as well as to all recipients. To reply only to the sender of the email, press kbd:[r]. To send a group reply to the original sender as well as all the message recipients, press kbd:[g].
ru: Аналогично man:mail[1], Mutt позволяет отвечать как только отправителю сообщения, так и всем получателям. Чтобы ответить только отправителю письма, нажмите kbd:[r]. Для отправки группового ответа исходному отправителю, а также всем получателям сообщения нажмите kbd:[g].

source: By default, Mutt uses the man:vi[1] editor for creating and replying to emails. Each user can customize this by creating or editing the [.filename]#.muttrc# in their home directory and setting the `editor` variable or by setting the `EDITOR` environment variable. Refer to link:http://www.mutt.org/[http://www.mutt.org/] for more information about configuring Mutt.
ru: По умолчанию Mutt использует редактор man:vi[1] для создания и ответа на письма. Каждый пользователь может изменить это, создав или отредактировав файл [.filename]#.muttrc# в своём домашнем каталоге и установив переменную `editor`, либо задав переменную окружения `EDITOR`. Дополнительную информацию о настройке Mutt можно найти на link:http://www.mutt.org/[http://www.mutt.org/].

source: To compose a new mail message, press kbd:[m]. After a valid subject has been given, Mutt will start man:vi[1] so the email can be written. Once the contents of the email are complete, save and quit from `vi`. Mutt will resume, displaying a summary screen of the mail that is to be delivered. In order to send the mail, press kbd:[y]. An example of the summary screen can be seen below:
ru: Чтобы создать новое письмо, нажмите kbd:[m]. После ввода корректной темы Mutt запустит man:vi[1] для написания письма. Завершив составление письма, сохраните изменения и выйдите из `vi`. Mutt продолжит работу, отобразив итоговый экран с информацией о письме, готовом к отправке. Для отправки письма нажмите kbd:[y]. Пример итогового экрана показан ниже:

source: Mutt email client showing the summary screen
ru: Клиент электронной почты Mutt, отображающий сводный экран

source: Mutt contains extensive help which can be accessed from most of the menus by pressing kbd:[?]. The top line also displays the keyboard shortcuts where appropriate.
ru: Mutt содержит обширную справку, доступ к которой можно получить из большинства меню, нажав kbd:[?]. В верхней строке также отображаются сочетания клавиш, где это уместно.

source: alpine is aimed at a beginner user, but also includes some advanced features.
ru: alpine ориентирован на начинающего пользователя, но также включает некоторые расширенные возможности.

source: alpine has had several remote vulnerabilities discovered in the past, which allowed remote attackers to execute arbitrary code as users on the local system, by the action of sending a specially-prepared email. While _known_ problems have been fixed, alpine code is written in an insecure style and the FreeBSD Security Officer believes there are likely to be other undiscovered vulnerabilities. Users install alpine at their own risk.
ru: В прошлом в alpine было обнаружено несколько уязвимостей, позволяющих удалённым злоумышленникам выполнять произвольный код от имени пользователей локальной системы путём отправки специально подготовленного электронного письма. Хотя _известные_ проблемы были исправлены, код alpine написан в небезопасном стиле, и Ответственный за безопасность FreeBSD считает, что, скорее всего, существуют другие необнаруженные уязвимости. Пользователи устанавливают alpine на свой страх и риск.

source: The current version of alpine may be installed using the package:mail/alpine[] port. Once the port has installed, alpine can be started by issuing the following command:
ru: Текущую версию alpine можно установить с помощью порта package:mail/alpine[]. После установки порта alpine можно запустить, выполнив следующую команду:

source: The first time alpine runs, it displays a greeting page with a brief introduction, as well as a request from the alpine development team to send an anonymous email message allowing them to judge how many users are using their client. To send this anonymous message, press kbd:[Enter]. Alternatively, press kbd:[E] to exit the greeting without sending an anonymous message. An example of the greeting page is shown below:
ru: При первом запуске alpine отображает приветственную страницу с кратким введением, а также просьбу от команды разработчиков alpine отправить анонимное электронное сообщение, позволяющее им оценить количество пользователей их клиента. Чтобы отправить это анонимное сообщение, нажмите kbd:[Enter]. Или нажмите kbd:[E] для выхода из приветствия без отправки анонимного сообщения. Пример приветственной страницы показан ниже:

source: alpine email client showing the greeting page
ru: Почтовый клиент alpine, отображающий приветственную страницу

source: The main menu is then presented, which can be navigated using the cursor keys. This main menu provides shortcuts for the composing new mails, browsing mail directories, and administering address book entries. Below the main menu, relevant keyboard shortcuts to perform functions specific to the task at hand are shown.
ru: Затем отображается главное меню, в котором можно перемещаться с помощью клавиш-стрелок. Это меню предоставляет быстрый доступ к созданию новых писем, просмотру почтовых каталогов и управлению записями адресной книги. Под главным меню отображаются соответствующие сочетания клавиш для выполнения функций, связанных с текущей задачей.

source: The default directory opened by alpine is [.filename]#inbox#. To view the message index, press kbd:[I], or select the [.guimenuitem]#MESSAGE INDEX# option shown below:
ru: По умолчанию alpine открывает папку [.filename]#inbox#. Для просмотра списка сообщений нажмите kbd:[I] или выберите пункт [.guimenuitem]#MESSAGE INDEX#, как показано ниже:

source: alpine email client showing the default directory
ru: Почтовый клиент alpine, отображающий стандартный каталог

source: The message index shows messages in the current directory and can be navigated by using the cursor keys. Highlighted messages can be read by pressing kbd:[Enter].
ru: Список сообщений отображает сообщения в текущем каталоге, и по ним можно перемещаться с помощью клавиш-стрелок. Выделенные сообщения можно прочитать, нажав kbd:[Enter].

source: alpine email client showing the message index
ru: Почтовый клиент alpine, отображающий список сообщений

source: In the screenshot below, a sample message is displayed by alpine. Contextual keyboard shortcuts are displayed at the bottom of the screen. An example of one of a shortcut is kbd:[r], which tells the MUA to reply to the current message being displayed.
ru: На приведённом ниже снимке экрана отображается пример сообщения в alpine. Контекстные сочетания клавиш показаны в нижней части экрана. Пример одного из сочетаний — kbd:[r], которое указывает почтовому клиенту ответить на текущее отображаемое сообщение.

source: alpine email client showing an email
ru: Клиент электронной почты alpine, отображающий письмо

source: Replying to an email in alpine is done using the pico editor, which is installed by default with alpine. pico makes it easy to navigate the message and is easier for novice users to use than man:vi[1] or man:mail[1]. Once the reply is complete, the message can be sent by pressing kbd:[Ctrl+X]. alpine will ask for confirmation before sending the message.
ru: Для ответа на письмо в alpine запускается редактор pico, который устанавливается по умолчанию вместе с alpine. pico упрощает навигацию по сообщению и более удобен для начинающих пользователей, чем man:vi[1] или man:mail[1]. После завершения ответа сообщение можно отправить, нажав kbd:[Ctrl+X]. alpine запросит подтверждение перед отправкой сообщения.

source: alpine email client showing the message compose window
ru: Почтовый клиент alpine с открытым окном создания сообщения

source: alpine can be customized using the [.guimenuitem]#SETUP# option from the main menu.
ru: alpine можно настроить с помощью пункта [.guimenuitem]#SETUP# в главном меню.

source: Advanced Topics
ru: Сложные темы

source: This section covers more involved topics such as mail configuration and setting up mail for an entire domain.
ru: Этот раздел охватывает более сложные темы, такие как настройка почты и организация почтовой системы для целого домена.

source: Basic Configuration
ru: Базовая конфигурация

source: Out of the box, one can send email to external hosts as long as [.filename]#/etc/resolv.conf# is configured or the network has access to a configured DNS server. To have email delivered to the MTA on the FreeBSD host, do one of the following:
ru: Без какой-либо настройки можно отправлять электронную почту на внешние хосты, если настроен [.filename]#/etc/resolv.conf# или сеть имеет доступ к настроенному DNS-серверу. Чтобы почта доставлялась на MTA FreeBSD, выполните одно из следующих действий:

source: Run a DNS server for the domain.
ru: Запустите DNS-сервер для домена.

source: Get mail delivered directly to the FQDN for the machine.
ru: Получайте почту напрямую на машину, используя ее полное доменное имя.
