Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/plist/_index.po
Languages: ru

source: This does three things. First, add the first file passed as argument, the sample file, to the plist. Then, on installation, if the actual file is not found, copy the sample file to the actual file. And finally, on deinstallation, remove the actual file if it has not been modified. See crossref:plist[plist-config, Configuration Files] for more information.
ru: Это делает три вещи. Во-первых, добавляет первый переданный файл в качестве аргумента, образец файла, в plist. Затем, при установке, если фактический файл не найден, копирует образец файла в фактический файл. И наконец, при удалении, удаляет фактический файл, если он не был изменён. Дополнительную информацию см. в crossref:plist[plist-config, Файлы конфигурации].

source: `@shared-mime-info` _directory_
ru: `@shared-mime-info` _каталог_

source: Runs `update-mime-database` on the directory on installation and deinstallation.
ru: Выполняет `update-mime-database` для указанного каталога при установке и удалении.

source: `@shell` _file_
ru: `@shell` _файл_

source: Add the file passed as argument to the plist.
ru: Добавить файл, переданный в качестве аргумента, в plist.

source: On installation, add the full path to _file_ to [.filename]#/etc/shells#, while making sure it is not added twice. On deinstallation, remove it from [.filename]#/etc/shells#.
ru: При установке добавить полный путь к _file_ в [.filename]#/etc/shells#, убедившись, что он не добавлен повторно. При удалении удалите его из [.filename]#/etc/shells#.

source: Do not use by itself. If the port installs [.filename]#*.terminfo# files, add crossref:uses[uses-terminfo,`USES=terminfo`] to its [.filename]#Makefile#.
ru: Не использовать самостоятельно. Если порт устанавливает файлы [.filename]#*.terminfo#, добавьте crossref:uses[uses-terminfo,`USES=terminfo`] в его [.filename]#Makefile#.

source: On installation and deinstallation, if `tic` is present, refresh [.filename]#${PREFIX}/shared/misc/terminfo.db# from the [.filename]#*.terminfo# files in [.filename]#${PREFIX}/shared/misc#.
ru: При установке и удалении, если присутствует `tic`, обновить [.filename]#${PREFIX}/shared/misc/terminfo.db# из файлов [.filename]#*.terminfo# в [.filename]#${PREFIX}/shared/misc#.

source: Base Keywords
ru: Основные ключевые слова

source: There are a few keywords that are hardcoded, and documented in man:pkg-create[8]. For the sake of completeness, they are also documented here.
ru: Есть несколько ключевых слов, которые жестко закодированы и документированы в man:pkg-create[8]. Для полноты изложения они также документированы здесь.

source: `@` [_file_]
ru: `@` [_файл_]

source: The empty keyword is a placeholder to use when the file's owner, group, or mode need to be changed. For example, to set the group of the file to `games` and add the setgid bit, add:
ru: Ключевое слово `empty` является заполнителем, используемым, когда необходимо изменить владельца, группу или права доступа к файлу. Например, чтобы установить группу файла в `games` и добавить бит setgid, добавьте:

source: `@preexec` _command_, `@postexec` _command_, `@preunexec` _command_, `@postunexec` _command_
ru: `@preexec` _команда_, `@postexec` _команда_, `@preunexec` _команда_, `@postunexec` _команда_

source: Execute _command_ as part of the package installation or deinstallation process.
ru: Выполнить _команду_ как часть процесса установки или удаления пакета.

source: `@preexec` _command_
ru: `@preexec` _команда_

source: Execute _command_ as part of the [.filename]#pre-install# scripts.
ru: Выполнить _команду_ как часть скриптов [.filename]#pre-install#.

source: `@postexec` _command_
ru: `@postexec` _команда_

source: Execute _command_ as part of the [.filename]#post-install# scripts.
ru: Выполнить _команду_ как часть скриптов [.filename]#post-install#.

source: `@preunexec` _command_
ru: `@preunexec` _команда_

source: Execute _command_ as part of the [.filename]#pre-deinstall# scripts.
ru: Выполнить _команду_ как часть скриптов [.filename]#pre-deinstall#.

source: `@postunexec` _command_
ru: `@postunexec` _команда_

source: Execute _command_ as part of the [.filename]#post-deinstall# scripts.
ru: Выполнить _команду_ как часть скриптов [.filename]#post-deinstall#.

source: If _command_ contains any of these sequences somewhere in it, they are expanded inline. For these examples, assume that `@cwd` is set to [.filename]#/usr/local# and the last extracted file was [.filename]#bin/emacs#.
ru: Если в _команде_ содержится любая из этих последовательностей, они раскрываются непосредственно. Для следующих примеров предположим, что `@cwd` установлен в [.filename]#/usr/local#, а последним извлечённым файлом был [.filename]#bin/emacs#.

source: Expand to the last filename extracted (as specified). In the example case [.filename]#bin/emacs#.
ru: Раскрывается до последнего извлеченного имени файла (как указано). В примере [.filename]#bin/emacs#.

source: Expand to the current directory prefix, as set with `@cwd`. In the example case [.filename]#/usr/local#.
ru: Раскрыть до текущего префикса директории, установленного с помощью `@cwd`. В этом примере [.filename]#/usr/local#.

source: Expand to the basename of the fully qualified filename, that is, the current directory prefix plus the last filespec, minus the trailing filename. In the example case, that would be [.filename]#/usr/local/bin#.
ru: Раскрыть до базового имени полного имени файла, то есть префикс текущего каталога плюс последняя спецификация файла, за вычетом имени файла в конце спецификации. В данном примере это будет [.filename]#/usr/local/bin#.

source: Expand to the filename part of the fully qualified name, or the converse of `%B`. In the example case, [.filename]#emacs#.
ru: Раскрывается до части имени файла в полном квалифицированном имени, или противоположный случай для `%B`. В примере, [.filename]#emacs#.

source: These keywords are here to help you set up the package so that it is as ready to use as possible. They _must not_ be abused to start services, stop services, or run any other commands that will modify the currently running system.
ru: Эти ключевые слова предназначены для помощи в настройке пакета, чтобы он был максимально готов к использованию. Они _не должны_ использоваться для запуска служб, остановки служб или выполнения любых других команд, которые изменяют текущую работающую систему.

source: `@mode` _mode_
ru: `@mode` _режим_

source: Set default permission for all subsequently extracted files to _mode_. Format is the same as that used by man:chmod[1]. Use without an arg to set back to default permissions (mode of the file while being packed).
ru: Установить разрешения по умолчанию для всех последующих извлекаемых файлов в _режим_. Формат такой же, как используется в man:chmod[1]. Использование без аргумента вернёт разрешения по умолчанию (режим файла при упаковке).

source: This must be a numeric mode, like `644`, `4755`, or `600`. It cannot be a relative mode like `u+s`.
ru: Это должен быть числовой режим, например `644`, `4755` или `600`. Нельзя использовать относительный режим, например `u+s`.

source: `@owner` _user_
ru: `@owner` _пользователь_

source: Set default ownership for all subsequent files to _user_. Use without an argument to set back to default ownership (`root`).
ru: Установить владельца по умолчанию для всех последующих файлов в _пользователь_. Использование без аргумента вернёт владельца по умолчанию (`root`).

source: `@group` _group_
ru: `@group` _группа_

source: Set default group ownership for all subsequent files to _group_. Use without an arg to set back to default group ownership (`wheel`).
ru: Установить группу-владельца по умолчанию для всех последующих файлов в _группу_. Использование без аргумента вернёт группу-владельца по умолчанию (`wheel`).

source: `@comment` _string_
ru: `@comment` _строка_

source: This line is ignored when packing.
ru: Эта строка игнорируется при упаковке.

source: `@dir` _directory_
ru: `@dir` _каталог_

source: Declare directory name. By default, directories created under `PREFIX` by a package installation are automatically removed. Use this when an empty directory under `PREFIX` needs to be created, or when the directory needs to have non default owner, group, or mode. Directories outside of `PREFIX` need to be registered. For example, [.filename]#/var/db/${PORTNAME}# needs to have a `@dir` entry whereas [.filename]#${PREFIX}/shared/${PORTNAME}# does not if it contains files or uses the default owner, group, and mode.
ru: Объявить имя каталога. По умолчанию каталоги, созданные в `PREFIX` при установке пакета, автоматически удаляются. Используйте эту опцию, если необходимо создать пустой каталог в `PREFIX` или если каталогу требуется нестандартный владелец, группа или права. Каталоги за пределами `PREFIX` необходимо регистрировать. Например, [.filename]#/var/db/${PORTNAME}# требует записи `@dir`, тогда как [.filename]#${PREFIX}/shared/${PORTNAME}# — нет, если он содержит файлы или использует стандартные владельца, группу и права.

source: `@exec` _command_, `@unexec` _command_ (Deprecated)
ru: `@exec` _команда_, `@unexec` _команда_ (Устарело)

source: Execute _command_ as part of the installation or deinstallation process. Please use crossref:plist[plist-keywords-base-exec, `@preexec` _command_, `@postexec` _command_, `@preunexec` _command_, `@postunexec` _command_] instead.
ru: Выполнить _команду_ как часть процесса установки или удаления. Рекомендуется использовать crossref:plist[plist-keywords-base-exec, `@preexec` _команда_, `@postexec` _команда_, `@preunexec` _команда_, `@postunexec` _команда_] вместо этого.

source: `@dirrm` _directory_ (Deprecated)
ru: `@dirrm` _каталог_ (Устарело)

source: Declare directory name to be deleted at deinstall time. By default, directories created under `PREFIX` by a package installation are deleted when the package is deinstalled.
ru: Объявить имя каталога для удаления при деинсталляции. По умолчанию каталоги, созданные в `PREFIX` при установке пакета, удаляются при его деинсталляции.

source: `@dirrmtry` _directory_ (Deprecated)
ru: `@dirrmtry` _каталог_ (Устарело)

source: Declare directory name to be removed, as for `@dirrm`, but does not issue a warning if the directory cannot be removed.
ru: Объявить имя каталога для удаления, аналогично `@dirrm`, но не выводить предупреждение, если каталог не может быть удален.

source: Creating New Keywords
ru: Создание новых ключевых слов

source: Package list files can be extended by keywords that are defined in the [.filename]#${PORTSDIR}/Keywords# directory. The settings for each keyword are stored in a UCL file named [.filename]#keyword.ucl#. The file must contain at least one of these sections:
ru: Файлы списка пакетов могут быть расширены ключевыми словами, которые определены в каталоге [.filename]#${PORTSDIR}/Keywords#. Настройки каждого ключевого слова хранятся в файле UCL с именем [.filename]#keyword.ucl#. Файл должен содержать как минимум один из следующих разделов:

source: Changes the owner, group, or mode used by the keyword. Contains an associative array where the possible keys are `owner`, `group`, and `mode`. The values are, respectively, a user name, a group name, and a file mode. For example:
ru: Изменяет владельца, группу или режим доступа, используемые ключевым словом. Содержит ассоциативный массив, в котором возможными ключами являются `owner`, `group` и `mode`. Значениями являются, соответственно, имя пользователя, имя группы и режим доступа к файлу. Например:

source: Defines what happens to the keyword's parameter. Contains an array where the possible values are:
ru: Определяет, что происходит с параметром ключевого слова. Содержит массив, где возможные значения:

source: Set the prefix for the next plist entries.
ru: Установите префикс для следующих записей в plist.

source: Register a directory to be created on install and removed on deinstall.
ru: Зарегистрировать каталог для создания при установке и удаления при деинсталляции.

source: Register a directory to be deleted on deinstall. Deprecated.
ru: Зарегистрировать каталог для удаления при деинсталляции. Устарело.

source: Register a directory to try and deleted on deinstall. Deprecated.
ru: Зарегистрировать каталог для попытки удаления при деинсталляции. Устарело.

source: Register a file.
ru: Зарегистрировать файл.

source: Set the mode for the next plist entries.
ru: Установить режим для следующих записей plist.

source: Set the owner for the next plist entries.
ru: Установить владельца для следующих записей plist.

source: Set the group for the next plist entries.
ru: Установить группу для следующих записей в plist.

source: Does not do anything, equivalent to not entering an `action` section.
ru: Не выполняет никаких действий, эквивалентно отсутствию раздела `action`.

source: Ignore the next entry in the plist.
ru: Игнорировать следующую запись в plist.

source: If set to `true`, adds argument handling, splitting the whole line, `%@`, into numbered arguments, `%1`, `%2`, and so on. For example, for this line:
ru: Если установлено значение `true`, добавляется обработка аргументов, разделяя всю строку, `%@`, на нумерованные аргументы, `%1`, `%2`, и так далее. Например, для такой строки:

source: `%1` and `%2` will contain:
ru: `%1` и `%2` будут содержать:

source: It also affects how the crossref:plist[plist-keywords-action,`action`] entry works. When there is more than one argument, the argument number must be specified. For example:
ru: Это также влияет на работу записи crossref:plist[plist-keywords-action,`action`]. Если аргументов больше одного, необходимо указать номер аргумента. Например:

source: These keywords contains a man:sh[1] script to be executed before or after installation, deinstallation, or upgrade of the package. In addition to the usual `@exec %_foo_` placeholders described in crossref:plist[plist-keywords-base-exec, `@preexec` _command_, `@postexec` _command_, `@preunexec` _command_, `@postunexec` _command_], there is a new one, `%@`, which represents the argument of the keyword.
ru: Эти ключевые слова содержат man:sh[1] скрипт, который выполняется до или после установки, удаления или обновления пакета. В дополнение к обычным заполнителям `@exec %_foo_`, описанным в crossref:plist[plist-keywords-base-exec, `@preexec` _команда_, `@postexec` _команда_, `@preunexec` _команда_, `@postunexec` _команда_], существует новый заполнитель `%@`, который представляет аргумент ключевого слова.

source: Custom Keyword Examples
ru: Примеры пользовательских ключевых слов

source: Example of a `@dirrmtryecho` Keyword
ru: Пример ключевого слова `@dirrmtryecho`

source: This keyword does two things, it adds a `@dirrmtry _directory_` line to the packing list, and echoes the fact that the directory is removed when deinstalling the package.
ru: Это ключевое слово выполняет две функции: добавляет строку `@dirrmtry _directory_` в список упаковки и сообщает о том, что директория удаляется при деинсталляции пакета.

source: Real Life Example, How `@sample` is Implemented
ru: Реальный пример, как реализован `@sample`

source: This keyword does three things. It adds the first _filename_ passed as an argument to `@sample` to the packing list, it adds to the `post-install` script instructions to copy the sample to the actual configuration file if it does not already exist, and it adds to the `post-deinstall` instructions to remove the configuration file if it has not been modified.
ru: Этот ключевое слово выполняет три действия. Оно добавляет первый _filename_, переданный в качестве аргумента `@sample`, в список упаковки, добавляет в скрипт `post-install` инструкции для копирования образца в фактический файл конфигурации, если он ещё не существует, и добавляет в инструкции `post-deinstall` удаление файла конфигурации, если он не был изменён.
