Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/introduction/_index.po
Languages: ru

source: FreeBSD then set about the arduous task of literally re-inventing itself from a completely new and rather incomplete set of 4.4BSD-Lite bits. Although only three files having to do with System V shared memory and semaphores were removed, many other changes and bug fixes had been made to the BSD distribution, so it was a huge task to merge all the FreeBSD developments into 4.4BSD-Lite. It took the project until November of 1994 to make this transition, and in December it released FreeBSD 2.0 to the world. Despite being still more than a little rough around the edges, the release was a significant success and was followed by the more robust and easier to install FreeBSD 2.0.5 release in June of 1995.
ru: Затем FreeBSD приступила к сложной задаче буквально переизобретения себя на основе совершенно нового и довольно неполного набора компонентов 4.4BSD-Lite. Хотя были удалены только три файла, связанных с разделяемой памятью и семафорами System V, в дистрибутив BSD было внесено множество других изменений и исправлений ошибок, поэтому объединение всех наработок FreeBSD с 4.4BSD-Lite оказалось огромной работой. Проекту потребовалось время до ноября 1994 года, чтобы осуществить этот переход, и в декабре он выпустил FreeBSD 2.0 для всего мира. Несмотря на то, что релиз всё ещё был сыроват, он оказался весьма успешным, а в июне 1995 года последовал более стабильный и простой в установке выпуск FreeBSD 2.0.5.

source: Since that time, FreeBSD has made a series of releases each time improving the stability, speed, and feature set of the previous version.
ru: С тех пор FreeBSD выпустила серию релизов, каждый из которых улучшал стабильность, скорость и функциональность предыдущей версии.

source: For now, long-term development projects continue to take place in the {rel-head}-CURRENT (main) branch, and snapshot releases of {rel-head} are continually made available from link:https://download.freebsd.org/snapshots/[the snapshot server] as work progresses.
ru: На данный момент долгосрочные проекты разработки продолжают вестись в ветке {rel-head}-CURRENT (main), а снимки состояния {rel-head} регулярно публикуются на link:https://download.freebsd.org/snapshots/[сервере снимков] по мере продвижения работы.

source: FreeBSD Project Goals
ru: Цели проекта FreeBSD

source: The goals of the FreeBSD Project are to provide software that may be used for any purpose and without strings attached. Many of us have a significant investment in the code (and project) and would certainly not mind a little financial compensation now and then, but we are definitely not prepared to insist on it. We believe that our first and foremost "mission" is to provide code to any and all comers, and for whatever purpose, so that the code gets the widest possible use and provides the widest possible benefit. This is, we believe, one of the most fundamental goals of Free Software and one that we enthusiastically support.
ru: Цели проекта FreeBSD заключаются в предоставлении программного обеспечения, которое может использоваться для любых целей без каких-либо ограничений. Многие из нас вложили значительные усилия в разработку кода (и проекта) и, конечно, не отказались бы от небольшого финансового вознаграждения время от времени, но мы точно не готовы настаивать на этом. Мы считаем, что наша главная «миссия» — предоставлять код всем желающим, независимо от целей, чтобы код получил максимально широкое распространение и принес максимальную пользу. Это, по нашему мнению, одна из фундаментальных целей свободного программного обеспечения, которую мы горячо поддерживаем.

source: That code in our source tree which falls under the GNU General Public License (GPL) or Library General Public License (LGPL) comes with slightly more strings attached, though at least on the side of enforced access rather than the usual opposite. Due to the additional complexities that can evolve in the commercial use of GPL software we do, however, prefer software submitted under the more relaxed BSD license when it is a reasonable option to do so.
ru: В нашем исходном коде программное обеспечение, распространяемое под лицензией GNU General Public License (GPL) или Library General Public License (LGPL), имеет несколько больше ограничений, хотя, по крайней мере, в сторону обеспечения доступа, а не наоборот. Однако из-за дополнительных сложностей, которые могут возникнуть при коммерческом использовании ПО под GPL, мы предпочитаем программное обеспечение, предоставленное под более свободной лицензией BSD, когда это разумный вариант.

source: The FreeBSD Development Model
ru: Модель разработки FreeBSD

source: The development of FreeBSD is a extref:{dev-model}[very open and flexible process], being literally built from the contributions of thousands of people around the world, as can be seen from our extref:{contributors}[list of contributors]. FreeBSD's development infrastructure allows these thousands of contributors to collaborate over the Internet. We are constantly on the lookout for new volunteers, and those interested in becoming more closely involved should consult the article on extref:{contributing}[Contributing to FreeBSD].
ru: Разработка FreeBSD — это extref:{dev-model}[очень открытый и гибкий процесс], буквально созданный из вклада тысяч людей по всему миру, что можно увидеть в нашем extref:{contributors}[списке участников]. Инфраструктура разработки FreeBSD позволяет этим тысячам участников сотрудничать через Интернет. Мы постоянно ищем новых добровольцев, и тем, кто хочет более тесно вовлечься, стоит ознакомиться со статьёй о extref:{contributing}[вкладе в FreeBSD].

source: Useful things to know about the FreeBSD Project and its development process, whether working independently or in close cooperation:
ru: Полезная информация о проекте FreeBSD и процессе его разработки, независимо от того, работаете ли вы самостоятельно или в тесном сотрудничестве:

source: The Git repositories[[development-cvs-repository]]
ru: Репозитории Git[[development-cvs-repository]]

source: For several years, the central source tree for FreeBSD was maintained by link:https://www.nongnu.org/cvs/[CVS] (Concurrent Versions System), a freely available source code control tool. In June 2008, the Project switched to using link:https://subversion.apache.org/[SVN] (Subversion). The switch was deemed necessary, as the technical limitations imposed by CVS were becoming obvious due to the rapid expansion of the source tree and the amount of history already stored. The Documentation Project and Ports Collection repositories also moved from CVS to SVN in May 2012 and July 2012, respectively. In December 2020, the Project link:https://www.freebsd.org/status/report-2020-10-2020-12.html#Git-Migration-Working-Group[migrated Source and Documentation repositories] to link:https://git-scm.com/[Git], with link:https://www.freebsd.org/status/report-2021-04-2021-06/#_git_migration_working_group[Ports following suit] in April 2021. Please refer to the crossref:cutting-edge[synching, Obtaining the Source] section for more information on obtaining the FreeBSD `src/` repository and crossref:ports[ports-using, Using the Ports Collection] for details on obtaining the FreeBSD Ports Collection.
ru: В течение нескольких лет центральное дерево исходных кодов FreeBSD поддерживалось с помощью link:https://www.nongnu.org/cvs/[CVS] (Concurrent Versions System), свободно распространяемой системы контроля версий. В июне 2008 года проект перешёл на использование link:https://subversion.apache.org/[SVN] (Subversion). Переход был признан необходимым, так как технические ограничения CVS становились всё более очевидными из-за быстрого роста дерева исходных кодов и объёма уже накопленной истории. Репозитории проекта документации и коллекции портов также были перенесены с CVS на SVN в мае 2012 года и июле 2012 года соответственно. В декабре 2020 года проект link:https://www.freebsd.org/status/report-2020-10-2020-12.html#Git-Migration-Working-Group[перенёс репозитории исходных кодов и документации] на link:https://git-scm.com/[Git], а link:https://www.freebsd.org/status/report-2021-04-2021-06/#_git_migration_working_group[коллекция портов последовала их примеру] в апреле 2021 года. Дополнительную информацию о получении репозитория FreeBSD `src/` можно найти в разделе crossref:cutting-edge[синхронизация, Получение исходных кодов], а подробности о получении коллекции портов FreeBSD — в разделе crossref:ports[ports-using, Использование коллекции портов].

source: The committers list[[development-committers]]
ru: Список коммиттеров[[development-committers]]

source: The _committers_ are the people who have _push_ access to the Git repository, and are authorized to make modifications to the FreeBSD source (the term "committer" comes from `commit`, the source control command which is used to bring new changes into the repository). Anyone can submit a bug to the link:https://bugs.FreeBSD.org/submit/[Bug Database]. Before submitting a bug report, the FreeBSD mailing lists, IRC channels, or forums can be used to help verify that an issue is actually a bug.
ru: _Коммиттеры_ — это люди, у которых есть доступ на _запись_ в Git-репозиторий и которые уполномочены вносить изменения в исходный код FreeBSD (термин «коммиттер» происходит от команды `commit`, используемой в системе контроля версий для добавления новых изменений в репозиторий). Любой может отправить отчёт об ошибке в link:https://bugs.FreeBSD.org/submit/ [Базу данных ошибок]. Перед отправкой отчёта можно воспользоваться списками рассылки FreeBSD, IRC-каналами или форумами, чтобы убедиться, что проблема действительно является ошибкой.

source: The FreeBSD core team[[development-core]]
ru: Команда разработчиков FreeBSD[[development-core]]

source: The _FreeBSD core team_ would be equivalent to the board of directors if the FreeBSD Project were a company. The primary task of the core team is to make sure the project, as a whole, is in good shape and is heading in the right directions. Inviting dedicated and responsible developers to join our group of committers is one of the functions of the core team, as is the recruitment of new core team members as others move on. The current core team was elected from a pool of committer candidates in May and June 2024. Elections are held every 2 years.
ru: _Команда core FreeBSD_ была бы эквивалентна совету директоров, если бы проект FreeBSD был компанией. Основная задача команды core — убедиться, что проект в целом находится в хорошем состоянии и движется в правильном направлении. Приглашение преданных и ответственных разработчиков в нашу группу коммиттеров — одна из функций команды core, как и привлечение новых членов команды core по мере того, как другие уходят. Текущая команда core была избрана из числа кандидатов-коммиттеров в мае и июне 2024 года. Выборы проводятся каждые 2 года.

source: Like most developers, most members of the core team are also volunteers when it comes to FreeBSD development and do not benefit from the project financially, so "commitment" should also not be misconstrued as meaning "guaranteed support." The "board of directors" analogy above is not very accurate, and it may be more suitable to say that these are the people who gave up their lives in favor of FreeBSD against their better judgement!
ru: Как и большинство разработчиков, большинство членов основной команды также являются добровольцами в разработке FreeBSD и не получают финансовой выгоды от проекта, поэтому «обязательство» не следует ошибочно истолковывать как «гарантированную поддержку». Приведённая выше аналогия с «советом директоров» не совсем точна, и, возможно, правильнее будет сказать, что это люди, которые вопреки здравому смыслу посвятили свою жизнь FreeBSD!

source: The FreeBSD Foundation[[development-foundation]]
ru: Фонд FreeBSD[[development-foundation]]

source: The link:https://freebsdfoundation.org/[FreeBSD Foundation] is a 501(c)(3), US-based, non-profit organization dedicated to supporting and promoting the FreeBSD Project and community worldwide. The Foundation funds software development via project grants and provides staff to immediately respond to urgent problems and implement new features and functionality. The Foundation purchases hardware to improve and maintain FreeBSD infrastructure, and funds staffing to improve test coverage, continuous integration and automation. The Foundation advocates for FreeBSD by promoting FreeBSD at technical conferences and events around the world. The Foundation also provides workshops, educational material, and presentations to recruit more users and contributors to FreeBSD. The Foundation also represents the FreeBSD Project in executing contracts, license agreements, and other legal arrangements that require a recognized legal entity.
ru: link:https://freebsdfoundation.org/[FreeBSD Foundation] — это некоммерческая организация 501(c)(3), базирующаяся в США, которая занимается поддержкой и продвижением проекта FreeBSD и его сообщества по всему миру. Фонд финансирует разработку программного обеспечения через гранты на проекты и предоставляет сотрудников для оперативного решения срочных проблем, а также внедрения новых функций и возможностей. Фонд закупает оборудование для улучшения и поддержки инфраструктуры FreeBSD, а также финансирует работу специалистов для повышения тестового покрытия, непрерывной интеграции и автоматизации. Фонд продвигает FreeBSD, участвуя в технических конференциях и мероприятиях по всему миру. Кроме того, Фонд проводит мастер-классы, разрабатывает учебные материалы и презентации для привлечения новых пользователей и разработчиков в проект FreeBSD. Фонд также представляет проект FreeBSD при заключении контрактов, лицензионных соглашений и других юридических договоров, требующих участия официального юридического лица.

source: Outside contributors
ru: Внешние участники

source: Last, but definitely not least, the largest group of developers are the users themselves who provide feedback and bug fixes to us on an almost constant basis. The primary way of keeping in touch with the development of the FreeBSD base system is to subscribe to the {freebsd-hackers} where such things are discussed. For porting third party applications, it would be the {freebsd-ports}. For documentation - {freebsd-doc}. See crossref:eresources[eresources, Resources on the Internet] for more information about the various FreeBSD mailing lists.
ru: И последнее, но не менее важное: самая большая группа разработчиков — это сами пользователи, которые практически постоянно предоставляют нам обратную связь и исправления ошибок. Основной способ следить за разработкой базовой системы FreeBSD — подписаться на список рассылки {freebsd-hackers}, где обсуждаются подобные вопросы. Для портирования сторонних приложений используется список {freebsd-ports}. Для документации — {freebsd-doc}. Дополнительную информацию о различных списках рассылки FreeBSD можно найти в разделе crossref:eresources[eresources, Ресурсы в Интернете].

source: extref:{contributors}[The FreeBSD Contributors List] is a long and growing one, so why not join it by extref:{contributing}[contributing something back to FreeBSD] today? Providing code is not the only way!
ru: extref:{contributors}[Список участников FreeBSD] длинный и постоянно растёт, так почему бы не присоединиться к нему, extref:{contributing}[внеся свой вклад в FreeBSD], уже сегодня? Предоставление кода — не единственный способ!

source: In summary, our development model is organized as a loose set of concentric circles. The centralized model is designed for the convenience of the _users_ of FreeBSD, who are provided with an easy way of tracking one central code base, not to keep potential contributors out! Our desire is to present a stable operating system with a large set of coherent crossref:ports[ports,application programs] that the users can easily install and use - this model works very well in accomplishing that.
ru: Вкратце, наша модель разработки организована как свободный набор концентрических кругов. Централизованная модель создана для удобства _пользователей_ FreeBSD, которым предоставляется простой способ отслеживания единой централизованной кодовой базы, а не для того, чтобы исключить потенциальных участников! Наше стремление — предоставить стабильную операционную систему с обширным набором согласованных crossref:ports[портов,прикладных программ], которые пользователи могут легко устанавливать и использовать — данная модель отлично справляется с этой задачей.

source: All we ask of those who would join us as FreeBSD developers is some of the same dedication its current people have to its continued success!
ru: Мы просим от тех, кто хочет присоединиться к нам в качестве разработчиков FreeBSD, лишь такой же преданности, которую проявляют нынешние участники проекта для его дальнейшего успеха!

source: Third Party Programs
ru: Сторонние программы

source: In addition to the base distributions, FreeBSD offers a ported software collection with thousands of commonly sought-after programs. The list of ports ranges from HTTP servers to games, languages, editors, and almost everything in between. There are about {numports} ports; the entire Ports Collection requires approximately {ports-size}. To compile a port, you simply change to the directory of the program you wish to install, type `make install`, and let the system do the rest. The full original distribution for each port you build is retrieved dynamically so you need only enough disk space to build the ports you want.
ru: Помимо базовых дистрибутивов, FreeBSD предлагает коллекцию портированного программного обеспечения, включающую тысячи популярных программ. Список портов варьируется от HTTP-серверов до игр, языков программирования, редакторов и почти всего, что между ними. Насчитывается около {numports} портов; вся Коллекция портов занимает примерно {ports-size}. Чтобы скомпилировать порт, достаточно перейти в каталог программы, которую вы хотите установить, ввести `make install`, а система сделает всё остальное. Полный исходный дистрибутивный файл для каждого порта загружается динамически, поэтому требуется достаточно места на диске для сборки только нужных портов.

source: Almost every port is also provided as a pre-compiled "package", which can be installed with a simple command (`pkg install`) by those who do not wish to compile their own ports from source. More information on packages and ports can be found in crossref:ports[ports,Installing Applications: Packages and Ports].
ru: Почти каждый порт также доступен в виде предварительно скомпилированного «пакета», который можно установить простой командой (`pkg install`) для тех, кто не хочет компилировать порты из исходного кода. Дополнительная информация о пакетах и портах доступна в crossref:ports[ports,Установка приложений: Пакеты и Порты].

source: Additional Documentation
ru: Дополнительная документация

source: All supported FreeBSD versions provide an option in the installer to install additional documentation under [.filename]#/usr/local/share/doc/freebsd# during the initial system setup. Documentation may also be installed later using packages:
ru: Все поддерживаемые версии FreeBSD предоставляют возможность в установщике установить дополнительную документацию в [.filename]#/usr/local/share/doc/freebsd# во время первоначальной настройки системы. Документация также может быть установлена позже с использованием пакетов:

source: For localized versions replace the "en" with the language prefix of choice. Be aware that some of the localised versions might be out of date and might contain information that is no longer correct or relevant. You may view the locally installed manuals with a web browser using the following URLs:
ru: Для локализованных версий замените «en» на префикс нужного языка. Учтите, что некоторые локализованные версии могут быть устаревшими и содержать информацию, которая больше не является корректной или актуальной. Вы можете просмотреть локально установленные руководства в веб-браузере, используя следующие URL-адреса:

source: The FreeBSD Handbook
ru: `Руководство FreeBSD`

source: The FreeBSD FAQ
ru: Часто задаваемые вопросы по FreeBSD (FAQ)

source: You can always find up to date documentation at link:https://docs.FreeBSD.org/[The Documentation Portal].
ru: Актуальную документацию всегда можно найти на link:https://docs.FreeBSD.org/[Портале документации].

source: All trademarks are the property of their respective owners.
ru: Все товарные знаки являются собственностью их законных владельцев.
