Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/boot/_index.po
Languages: es, ru

source: If just the disk name is used, such as [.filename]#ad0#, `bsdlabel` will create the disk in "dangerously dedicated mode", without slices. This is probably not the desired action, so double check the _diskslice_ before pressing kbd:[Return].
es: Si sólo se usa el nombre del disco, como [.filename]#ad0#, `bsdlabel` creará el disco en "modo dedicado peligroso", sin particiones. Esto probablemente no es lo que se quiere, así que comprueba de nuevo el _diskslice_ antes de presionar kbd:[Return].
ru: Если указано только имя диска, например [.filename]#ad0#, `bsdlabel` создаст диск в «опасном выделенном режиме» (dangerously dedicated mode) без разделов. Вероятно, это нежелательное действие, поэтому дважды проверьте _дисковый раздел_ перед нажатием kbd:[Enter].

source: Stage Three
es: Etapa Tres
ru: Этап три

source: The loader is the final stage of the three-stage bootstrap process. It is located on the file system, usually as [.filename]#/boot/loader#.
es: El cargador es la etapa final del proceso de arranque de tres etapas. Está localizado en el sistema de ficheros, normalmente en [.filename]#/boot/loader#.
ru: Загрузчик является завершающим этапом трёхэтапного процесса начальной загрузки. Он располагается в файловой системе, обычно как [.filename]#/boot/loader#.

source: The loader is intended as an interactive method for configuration, using a built-in command set, backed up by a more powerful interpreter which has a more complex command set.
es: El cargador está pensado como un método interactivo de configuración, usando un conjunto de comandos integrados, respaldados por un intérprete más potente que tiene un conjunto de comandos más complejo.
ru: Загрузчик предназначен для интерактивной настройки с использованием встроенного набора команд, а также поддерживается более мощным интерпретатором с расширенным набором команд.

source: During initialization, loader will probe for a console and for disks, and figure out which disk it is booting from. It will set variables accordingly, and an interpreter is started where user commands can be passed from a script or interactively.
es: Durante la inicialización, el cargador sondeará para encontrar una consola y discos, y decidirá desde qué disco arrancar. Establecerá una serie de variables de form apropiada, y se iniciará un intérprete donde se puedan pasar comandos de usuario desde un script o de forma interactiva.
ru: Во время инициализации загрузчик определит консоль и диски, а также выяснит, с какого диска происходит загрузка. Он установит соответствующие переменные и запустит интерпретатор, в котором пользовательские команды могут передаваться из скрипта или вводиться в интерактивном режиме.

source: The loader will then read [.filename]#/boot/loader.rc#, which by default reads in [.filename]#/boot/defaults/loader.conf# which sets reasonable defaults for variables and reads [.filename]#/boot/loader.conf# for local changes to those variables. [.filename]#loader.rc# then acts on these variables, loading whichever modules and kernel are selected.
es: Después el cargador leerá [.filename]#/boot/loader.rc#, que por defecto carga [.filename]#/boot/defaults/loader.conf# que establece un conjunto razonable de valores por defecto para variables y lee [.filename]#/boot/loader.conf# para aplicar cambios locales a esas variables. [.filename]#loader.rc# actúa posteriormente sobre esas variables, cargando los módulos y el kernel que se hayan seleccionado.
ru: Затем загрузчик прочитает [.filename]#/boot/loader.rc#, который по умолчанию загружает [.filename]#/boot/defaults/loader.conf#, где задаются разумные значения по умолчанию для переменных, а также читает [.filename]#/boot/loader.conf# для локальных изменений этих переменных. После этого [.filename]#loader.rc# действует в соответствии с этими переменными, загружая выбранные модули и ядро.

source: Finally, by default, loader issues a 10 second wait for key presses, and boots the kernel if it is not interrupted. If interrupted, the user is presented with a prompt which understands the command set, where the user may adjust variables, unload all modules, load modules, and then finally boot or reboot. crossref:boot[boot-loader-commands,Loader Built-In Commands] lists the most commonly used loader commands. For a complete discussion of all available commands, refer to man:loader[8].
ru: Наконец, по умолчанию загрузчик ожидает нажатия клавиш в течение 10 секунд и загружает ядро, если не было прерывания. Если прерывание произошло, пользователю предоставляется командная строка, поддерживающая набор команд, где можно изменить переменные, выгрузить все модули, загрузить модули и, наконец, загрузить или перезагрузить систему. crossref:boot[boot-loader-commands,Встроенные команды загрузчика] перечисляет наиболее часто используемые команды загрузчика. Для полного описания всех доступных команд обратитесь к man:loader[8].

source: Loader Built-In Commands
es: Comandos Integrados en el Cargador
ru: Встроенные команды загрузчика

source: Variable
ru: Переменная

source: Description
es: Descripción
ru: Описание

source: autoboot _seconds_
es: autoboot _segundos_
ru: autoboot _секунды_

source: Proceeds to boot the kernel if not interrupted within the time span given, in seconds. It displays a countdown, and the default time span is 10 seconds.
es: Procede con el arranque del kernel si no se interrumpe antes del tiempo límite especificado, en segundos. Muestra una cuenta atrás, y el tiempo por defecto son 10 segundos.
ru: Продолжает загрузку ядра, если не прервано в течение указанного времени в секундах. Отображает обратный отсчет, а время по умолчанию составляет 10 секунд.

source: Immediately proceeds to boot the kernel, with any specified options or kernel name. Providing a kernel name on the command-line is only applicable after an `unload` has been issued. Otherwise, the previously-loaded kernel will be used. If _kernelname_ is not qualified, it will be searched under _/boot/kernel_ and _/boot/modules_.
es: Inmediatamente procede a arrancar el kernel, con cualquier opción especificada o nombre del kernel. Proporcionar un nombre de kernel en la línea de comando sólo se puede aplicar después de haber ejecutado `unload`. De otro modo, se usará el kernel cargado previamente. Si _kernelname_ no está cualificado, se buscará bajo _/boot/kernel_ y _/boot/modules_.
ru: Немедленно переходит к загрузке ядра с любыми указанными параметрами или именем ядра. Указание имени ядра в командной строке применимо только после выполнения команды `unload`. В противном случае будет использовано ранее загруженное ядро. Если _kernelname_ не указан полностью, поиск будет выполнен в _/boot/kernel_ и _/boot/modules_.

source: Goes through the same automatic configuration of modules based on specified variables, most commonly `kernel`. This only makes sense if `unload` is used first, before changing some variables.
es: Realiza las misma configuración de módulos basada en variables específicas, habitualmente `kernel`. Esto sólo tienen sentido si se usa `unload` primero, antes de cambiar algunas variables.
ru: Проходит ту же автоматическую настройку модулей на основе указанных переменных, чаще всего `kernel`. Имеет смысл только при использовании `unload` перед изменением некоторых переменных.

source: help [`_topic_`]
ru: help [`_тема_`]

source: Shows help messages read from [.filename]#/boot/loader.help#. If the topic given is `index`, the list of available topics is displayed.
es: Muestra mensajes de ayuda leídos de [.filename]#/boot/loader.help#. Si el tema proporcionado es `index`, se muestra la lista de temas disponible.
ru: Показывает справочные сообщения, прочитанные из файла [.filename]#/boot/loader.help#. Если указана тема `index`, отображается список доступных тем.

source: include `_filename_` ...
ru: include `_имяфайла_` ...

source: Reads the specified file and interprets it line by line. An error immediately stops the `include`.
es: Lee el fichero especificado y lo interpreta línea a linea. Un error detiene el `include` inmediatamente.
ru: Читает указанный файл и обрабатывает его построчно. Ошибка немедленно останавливает `include`.

source: load [-t ``_type_``] `_filename_`
ru: load [-t ``_тип_``] `_имяфайла_`

source: Loads the kernel, kernel module, or file of the type given, with the specified filename. Any arguments after _filename_ are passed to the file. If _filename_ is not qualified, it will be searched under _/boot/kernel_ and _/boot/modules_.
es: Carga el kernel, módulo del kerne, o fichero del tipo dado, con el nombre especificado. Cualquier argumento pasado después de _filename_ so pasados al fichero. Si _filename_ no está cualificado, se buscará bajo _/boot/kernel_ y _/boot/modules_.
ru: Загружает ядро, модуль ядра или файл указанного типа с заданным именем. Все аргументы после _имяфайла_ передаются файлу. Если _имяфайла_ не указано полностью, файл будет искаться в _/boot/kernel_ и _/boot/modules_.

source: ls [-l] [``_path_``]
ru: ls [-l] [``_путь_``]

source: Displays a listing of files in the given path, or the root directory, if the path is not specified. If `-l` is specified, file sizes will also be shown.
es: Muestra una lista de fichero en la ruta especificada, o el directorio raíz, si no se especifica la ruta. Si se especifica `-l`, también se muestran los tamaños de los ficheros.
ru: Отображает список файлов в указанном пути или в корневом каталоге, если путь не указан. Если указан параметр `-l`, также будут показаны размеры файлов.

source: Lists all of the devices from which it may be possible to load modules. If `-v` is specified, more details are printed.
es: Lisa los dispositivos desde los que podría ser posible cargar módulos. Si se especifica `-v`, se muestran más detalles.
ru: Перечисляет все устройства, с которых возможно загрузить модули. Если указан параметр `-v`, выводится более подробная информация.

source: Displays loaded modules. If `-v` is specified, more details are shown.
es: Muestra los módulos cargados. Si se especifica `-v`, se muestran más detalles.
ru: Отображает загруженные модули. Если указан параметр `-v`, выводится более подробная информация.

source: more `_filename_`
ru: more `_имяфайла_`

source: Displays the files specified, with a pause at each `LINES` displayed.
es: Muestra los ficheros especificados, con una pausa cada `LINES` líneas mostradas
ru: Отображает указанные файлы с паузой после каждых `LINES` выведенных строк.

source: Immediately reboots the system.
es: Reinicia el sistema inmediatamente.
ru: Немедленно перезагружает систему.

source: Sets the specified environment variables.
es: Establece las variables de entorno especificadas.
ru: Устанавливает указанные переменные окружения.

source: Removes all loaded modules.
es: Elimina todos los módulos cargados.
ru: Удаляет все загруженные модули.

source: Here are some practical examples of loader usage. To boot the usual kernel in single-user mode:
es: Aquí hay algunos ejemplos prácticos de uso del cargador. Para arrancar el kernel habitual en modo mono usuario:
ru: Вот несколько практических примеров использования загрузчика. Чтобы загрузить обычное ядро в однопользовательском режиме:

source: To unload the usual kernel and modules and then load the previous or another, specified kernel:
es: Para descargar el kernel habitual y los módulos y después cargar el anterior u otro kernel especificado:
ru: Чтобы выгрузить обычное ядро и модули, а затем загрузить предыдущее или другое указанное ядро:

source: unload load /path/to/kernelfile
ru: unload load /путь/к/файлуядра

source: Use the qualified [.filename]#/boot/GENERIC/kernel# to refer to the default kernel that comes with an installation, or [.filename]#/boot/kernel.old/kernel#, to refer to the previously installed kernel before a system upgrade or before configuring a custom kernel.
es: Usa el nombre cualificado [.filename]#/boot/GENERIC/kernel# para hacer referencia al kernel por defecto incluido en la instalación, o [.filename]#/boot/kernel.old/kernel#, para hacer referencia al kernel instalado anteriormente antes de que se actualizara el sistema o se configurara un kernel personalizado.
ru: Используйте полный путь [.filename]#/boot/GENERIC/kernel# для ссылки на стандартное ядро, поставляемое с установкой, или [.filename]#/boot/kernel.old/kernel# для ссылки на предыдущую версию ядра до обновления системы или до настройки собственного ядра.

source: Use the following to load the usual modules with another kernel. Note that in this case it is not necessary the qualified name:
es: Usa lo siguiente para cargar los módulos habituales con otro kernel. Ten en cuenta que en este caso no es necesario el nombre cualificado:
ru: Используйте следующее для загрузки обычных модулей с другим ядром. Обратите внимание, что в этом случае не обязательно указывать полное имя:

source: To load an automated kernel configuration script:
es: Para cargar un script de configuración automática del kernel:
ru: Для загрузки автоматизированного сценария конфигурации ядра:

source: Last Stage
es: Última Etapa
ru: Последний этап

source: Once the kernel is loaded by either loader or by boot2, which bypasses loader, it examines any boot flags and adjusts its behavior as necessary. crossref:boot[boot-kernel,Kernel Interaction During Boot] lists the commonly used boot flags. Refer to man:boot[8] for more information on the other boot flags.
ru: После загрузки ядра с помощью `loader` или `boot2`, который обходит `loader`, оно проверяет флаги загрузки и при необходимости корректирует свое поведение. В crossref:boot[boot-kernel,Взаимодействие ядра во время загрузки] приведены часто используемые флаги загрузки. Дополнительную информацию о других флагах загрузки можно найти в man:boot[8].

source: Kernel Interaction During Boot
es: Interacción con el Kernel Durante el Arranque
ru: Взаимодействие с ядром во время загрузки

source: Option
es: Opción
ru: Опция

source: During kernel initialization, ask for the device to mount as the root file system.
es: Durante la inicialización del kernel, pregunta por el dispositivo a montar como sistema de ficheros raíz.
ru: Во время инициализации ядра запросить устройство для монтирования в качестве корневой файловой системы.

source: Boot the root file system from a CDROM.
es: Arranca el sistema de ficheros raíz desde un CDROM.
ru: Загрузка корневой файловой системы с CDROM.

source: Boot into single-user mode.
es: Arranca en modo mono usuario.
ru: Загрузится в однопользовательский режим.

source: Be more verbose during kernel startup.
es: Sé más verboso durante el arranque del kernel.
ru: Более подробный вывод во время загрузки ядра.

source: Once the kernel has finished booting, it passes control to the user process man:init[8], which is located at [.filename]#/sbin/init#, or the program path specified in the `init_path` variable in `loader`. This is the last stage of the boot process.
es: Una vez que el kernel ha terminado de arrancar, pasa el control al proceso de usuario man:init[8], que se encuentra en [.filename]#/sbin/init#, o la ruta especificada en la variable `init_path` del cargador. Esta es la última etapa del proceso de arranque.
ru: После завершения загрузки ядро передает управление пользовательскому процессу man:init[8], который находится в [.filename]#/sbin/init#, или программе, указанной в переменной `init_path` в `loader`. Это последний этап процесса загрузки.

source: The boot sequence makes sure that the file systems available on the system are consistent. If a UFS file system is not, and `fsck` cannot fix the inconsistencies, init drops the system into single-user mode so that the system administrator can resolve the problem directly. Otherwise, the system boots into multi-user mode.
es: La secuencia de arranque garantiza que los sistemas de ficheros disponibles en el sistema son consistentes. Si un sistema de ficheros UFS no lo es, y `fsck` no puede arreglar las inconsistencias, init deja el sistema en modo mono usuario de forma que el administrador pueda solucionar el problema directamente. De otro modo, el sistema arranca en modo multi usuario.
ru: Последовательность загрузки гарантирует, что файловые системы, доступные в системе, находятся в согласованном состоянии. Если файловая система UFS не согласована и `fsck` не может исправить несоответствия, init переводит систему в однопользовательский режим, чтобы администратор системы мог устранить проблему вручную. В противном случае система загружается в многопользовательский режим.

source: Single-User Mode
es: Modo mono usuario
ru: Однопользовательский режим

source: A user can specify this mode by booting with `-s` or by setting the `boot_single` variable in loader. It can also be reached by running `shutdown now` from multi-user mode. Single-user mode begins with this message:
es: Un usuario puede especificar este modo arrancando con `-s` o estableciendo la variable `boot_single` del cargador. También se puede hacer ejecutando `shutdown now` desde el modo multi usuario. El modo mono usuario comienza con este mensaje:
ru: Пользователь может указать этот режим, загрузившись с ключом `-s` или установив переменную `boot_single` в загрузчике. Также можно перейти в этот режим, выполнив команду `shutdown now` из многопользовательского режима. Однопользовательский режим начинается со следующего сообщения:

source: If the user presses kbd:[Enter], the system will enter the default Bourne shell. To specify a different shell, input the full path to the shell.
es: Si el usuario presiona kbd:[Enter], el sistema entrará en el shell Bourne por defecto. Para especificar un shell diferente, introduce la ruta completa al shell.
ru: Если пользователь нажмёт kbd:[Enter], система запустит оболочку Bourne по умолчанию. Чтобы указать другую оболочку, введите полный путь к ней.

source: Single-user mode is usually used to repair a system that will not boot due to an inconsistent file system or an error in a boot configuration file. It can also be used to reset the `root` password when it is unknown. These actions are possible as the single-user mode prompt gives full, local access to the system and its configuration files. There is no networking in this mode.
es: El modo mono usuario se usa habitualmente para reparar un sistema que no puede arrancar debido a un sistema de ficheros inconsistente o un error en un fichero de configuración del arranque. También se puede utilizar para resetear la contraseña de `root` cuando no se conoce. Estas acciones son posibles porque el modo mono usuario da acceso completo local, al sistema y sus ficheros de configuración. No hay red en este modo.
ru: Однопользовательский режим обычно используется для восстановления системы, которая не загружается из-за несогласованности файловой системы или ошибки в конфигурационном файле загрузки. Он также может применяться для сброса пароля `root`, если он неизвестен. Эти действия возможны, поскольку приглашение однопользовательского режима предоставляет полный локальный доступ к системе и её конфигурационным файлам. В этом режиме отсутствует сетевое взаимодействие.

source: While single-user mode is useful for repairing a system, it poses a security risk unless the system is in a physically secure location. By default, any user who can gain physical access to a system will have full control of that system after booting into single-user mode.
es: Mientras que el modo mono usuario es útil para reparar un sistema, representa un riesgo de seguridad a menos que el sistema esté en una localización física segura. Por defecto, cualquier usuario que pueda obtener acceso físico al sistema tendrá control total de ese sistema después de arrancar en modo mono usuario.
ru: Хотя однопользовательский режим полезен для восстановления системы, он представляет угрозу безопасности, если система не находится в физически защищенном месте. По умолчанию любой пользователь, имеющий физический доступ к системе, получит полный контроль над ней после загрузки в однопользовательском режиме.

source: If the system `console` is changed to `insecure` in [.filename]#/etc/ttys#, the system will first prompt for the `root` password before initiating single-user mode. This adds a measure of security while removing the ability to reset the `root` password when it is unknown.
es: Si el atributo `console` se cambia a `insecure` en [.filename]#/etc/ttys#, el sistema primero preguntará por la contraseña de `root` antes de iniciar el modo mono usuario. Esto añade una medida de seguridad a la vez que elimina la posibilidad de resetear la contraseña de `root` cuando no se conoce.
ru: Если в [.filename]#/etc/ttys# параметр `console` изменён на `insecure`, система сначала запросит пароль `root` перед переходом в однопользовательский режим. Это добавляет уровень безопасности, но лишает возможности сбросить пароль `root`, если он неизвестен.

source: Configuring an Insecure Console in [.filename]#/etc/ttys#
es: Configurando una Consola Insegura en [.filename]#/etc/ttys#
ru: Настройка небезопасной консоли в [.filename]#/etc/ttys#

source: An `insecure` console means that physical security to the console is considered to be insecure, so only someone who knows the `root` password may use single-user mode.
es: Una consola `insecure` significa que la seguridad física a la consola se considera insegura, de forma que sólo alguien con la contraseña de `root` podría usar el modo mono usuario.
ru: `insecure` консоль означает, что физическая безопасность консоли считается ненадежной, поэтому только тот, кто знает пароль `root`, может использовать однопользовательский режим.

source: Multi-User Mode
es: Modo Multi Usuario
ru: Многопользовательский режим

source: If init finds the file systems to be in order, or once the user has finished their commands in single-user mode and has typed `exit` to leave single-user mode, the system enters multi-user mode, in which it starts the resource configuration of the system.
es: Si init considera que los sistemas de ficheros están bien, o una vez que el usuario ha terminado con sus comandos en modo mono usuario y ha tecleado `exit` para salir del modo mono usuario, el sistema entra en el modo multi usuario, en el cual inicia la configuración de recursos del sistema.
ru: Если `init` обнаруживает, что файловые системы в порядке, или после того, как пользователь завершит свои команды в однопользовательском режиме и введёт `exit` для выхода из этого режима, система переходит в многопользовательский режим, в котором начинается настройка ресурсов системы.

source: The resource configuration system reads in configuration defaults from [.filename]#/etc/defaults/rc.conf# and system-specific details from [.filename]#/etc/rc.conf#. It then proceeds to mount the system file systems listed in [.filename]#/etc/fstab#. It starts up networking services, miscellaneous system daemons, then the startup scripts of locally installed packages.
es: El sistema de configuración de recursos lee la configuración por defecto de [.filename]#/etc/defaults/rc.conf# y los detalles específicos del sistema de [.filename]#/etc/rc.conf#. Después procede a montar los sistemas de ficheros listados en [.filename]#/etc/fstab#. Arranca servicios de red, demonios del sistema varios, después arranca scripts de los paquetes instalados localmente.
ru: Система конфигурации ресурсов загружает настройки по умолчанию из [.filename]#/etc/defaults/rc.conf# и специфичные для системы параметры из [.filename]#/etc/rc.conf#. Затем она монтирует файловые системы, перечисленные в [.filename]#/etc/fstab#. После этого запускаются сетевые службы, различные системные демоны, а затем скрипты запуска локально установленных пакетов.
