Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/boot/_index.po
Languages: es, ru

source: To learn more about the resource configuration system, refer to man:rc[8] and examine the scripts located in [.filename]#/etc/rc.d#.
es: Para saber más acerca del sistema de configuración de recursos, consulta man:rc[8] y examina los scripts que se encuentran en [.filename]#/etc/rc.d#.
ru: Чтобы узнать больше о системе настройки ресурсов, обратитесь к man:rc[8] и изучите скрипты в [.filename]#/etc/rc.d#.

source: Device Hints
es: Hints de Dispositivos
ru: Подсказки устройств

source: During initial system startup, the boot man:loader[8] reads man:device.hints[5]. This file stores kernel boot information known as variables, sometimes referred to as "device hints". These "device hints" are used by device drivers for device configuration.
es: Durante el arranque inicial del sistema, el cargador de arranque (man:loader[8]) lee man:device.hints[5]. Este fichero almacena información de arranque del kernel en forma de variables, a veces llamadas "device hints" (sugerencias del dispositivo). Estos "device hints" son usados por los controladores de los dispositivos para la configuración de los mismos.
ru: Во время начальной загрузки системы загрузчик man:loader[8] читает файл man:device.hints[5]. Этот файл хранит информацию о загрузке ядра, известную как переменные, иногда называемые "подсказками устройств" ("device hints"). Эти "подсказки устройств" используются драйверами устройств для их конфигурации.

source: Device hints may also be specified at the Stage 3 boot loader prompt, as demonstrated in crossref:boot[boot-loader, Stage Three]. Variables can be added using `set`, removed with `unset`, and viewed `show`. Variables set in [.filename]#/boot/device.hints# can also be overridden. Device hints entered at the boot loader are not permanent and will not be applied on the next reboot.
ru: Подсказки для устройств также могут быть указаны в строке загрузчика на Этапе 3, как показано в crossref:boot[boot-loader, Третий Этап]. Переменные можно добавить с помощью `set`, удалить с помощью `unset` и просмотреть с помощью `show`. Переменные, заданные в [.filename]#/boot/device.hints#, также могут быть переопределены. Подсказки для устройств, введённые в загрузчике, не являются постоянными и не будут применены при следующей перезагрузке.

source: Once the system is booted, man:kenv[1] can be used to dump all of the variables.
es: Una vez que el sistema ha arrancado, se puede usar man:kenv[1] para mostrar todas las variables.
ru: После загрузки системы все переменные можно вывести с помощью man:kenv[1].

source: The syntax for [.filename]#/boot/device.hints# is one variable per line, using the hash "#" as comment markers. Lines are constructed as follows:
es: La sintaxis para [.filename]#/boot/device.hints# es una variable por línea, usando "#" como marcador de comentario. Las líneas se construyen de la siguiente manera:
ru: Синтаксис для [.filename]#/boot/device.hints# — одна переменная на строку, символ "#" используется для комментариев. Строки формируются следующим образом:

source: The syntax for the Stage 3 boot loader is:
es: La sintaxis para la etapa 3 del cargador de arranque es:
ru: Синтаксис загрузчика Этапа 3 следующий:

source: where `driver` is the device driver name, `unit` is the device driver unit number, and `keyword` is the hint keyword. The keyword may consist of the following options:
es: donde `driver` es el nombre del controlador del dispositivo, `unit` es el número de unidad del controlador del dispositivo, y `keyword` es la palabra clave para el hint. La palabra clave podría consistir de las siguientes opciones:
ru: где `driver` — это имя драйвера устройства, `unit` — номер устройства драйвера, а `keyword` — ключевое слово подсказки. Ключевое слово может включать следующие варианты:

source: `at`: specifies the bus which the device is attached to.
es: `at`: especifica el bus al cual está enganchado el dispositivo.
ru: `at`: указывает шину, к которой подключено устройство.

source: `port`: specifies the start address of the I/O to be used.
es: `port`: especifica la dirección de inicio de I/O que se usará.
ru: `port`: указывает начальный адрес ввода-вывода, который будет использоваться.

source: `irq`: specifies the interrupt request number to be used.
es: `irq`: especifica el número de petición de interrupción que se usará.
ru: `irq`: указывает номер запроса на прерывание, который должен использоваться.

source: `drq`: specifies the DMA channel number.
es: `drq`: especifica el número de canal DMA.
ru: `drq`: указывает номер канала DMA.

source: `maddr`: specifies the physical memory address occupied by the device.
es: `maddr`: especifica la dirección de memoria física ocupada por el dispositivo.
ru: `maddr`: указывает физический адрес памяти, занятый устройством.

source: `flags`: sets various flag bits for the device.
es: `flags`: establece varios flags para el dispositivo.
ru: `flags`: устанавливает различные биты флагов для устройства.

source: `disabled`: if set to `1` the device is disabled.
es: `disabled`: si se establece a `1` el dispositivo está deshabilitado.
ru: `disabled`: если установлено в `1`, устройство отключено.

source: Since device drivers may accept or require more hints not listed here, viewing a driver's manual page is recommended. For more information, refer to man:device.hints[5], man:kenv[1], man:loader.conf[5], and man:loader[8].
es: Como los controladores de dispositivos podrían aceptar o necesitar más hints de los listados aquí, se recomienda ver la página del manual del controlador. Para más información, consulta man:device.hints[5], man:kenv[1], man:loader.conf[5], y man:loader[8].
ru: Поскольку драйверы устройств могут принимать или требовать дополнительные подсказки, не перечисленные здесь, рекомендуется ознакомиться с руководством по конкретному драйверу. Для получения дополнительной информации обратитесь к man:device.hints[5], man:kenv[1], man:loader.conf[5] и man:loader[8].

source: Shutdown Sequence
es: Secuencia de Apagado
ru: Последовательность выключения

source: Upon controlled shutdown using man:shutdown[8], man:init[8] will attempt to run the script [.filename]#/etc/rc.shutdown#, and then proceed to send all processes the `TERM` signal, and subsequently the `KILL` signal to any that do not terminate in a timely manner.
es: Durante un apagado controlado usando man:shutdown[8], man:init[8] intentará ejecutar el script [.filename]#/etc/rc.shutdown#, y después procederá a mandar la señal `TERM` a todos los procesos, y posteriormente la señal `KILL` a aquellos que no hayan terminado en un tiempo adecuado.
ru: При контролируемом завершении работы с помощью man:shutdown[8], man:init[8] попытается выполнить скрипт [.filename]#/etc/rc.shutdown#, а затем отправит всем процессам сигнал `TERM`, и после этого сигнал `KILL` всем процессам, которые не завершатся своевременно.

source: To power down a FreeBSD machine on architectures and systems that support power management, use `shutdown -p now` to turn the power off immediately. To reboot a FreeBSD system, use `shutdown -r now`. One must be `root` or a member of `operator` in order to run man:shutdown[8]. One can also use man:halt[8] and man:reboot[8]. Refer to their manual pages and to man:shutdown[8] for more information.
es: Para apagar una máquina FreeBSD en arquitecturas y sistemas que soportan gestión de la energía, usa `shutdown -p now` para apagar inmediatamente. Para reiniciar un sistema FreeBSD, usa `shutdown -r now`. Se debe ser `root` o miembro de `operator` para ejecutar man:shutdown[8]. También se puede usar man:halt[8] y man:reboot[8]. Consulta sus páginas de manual y la de man:shutdown[8] para más informacion.
ru: Для выключения питания машины FreeBSD на архитектурах и системах, поддерживающих управление питанием, используйте `shutdown -p now`, чтобы немедленно отключить питание. Для перезагрузки системы FreeBSD используйте `shutdown -r now`. Для выполнения man:shutdown[8] необходимо быть `root` или членом группы `operator`. Также можно использовать man:halt[8] и man:reboot[8]. Дополнительную информацию см. на их справочных страницах и в man:shutdown[8].

source: Modify group membership by referring to crossref:basics[users-synopsis,“Users and Basic Account Management”].
es: Modifica los miembros del grupo consultando crossref:basics[users-synopsis,“Usuarios y Gestión Básica de Cuentas”].
ru: Измените членство в группе, обратившись к разделу crossref:basics[users-synopsis,«Пользователи и основы управления учетными записями»].

source: Power management requires man:acpi[4] to be loaded as a module or statically compiled into a custom kernel.
es: La gestión de energía necesita que se cargue man:acpi[4] como un módulo o se compile de forma estática en un kernel personalizado.
ru: Управление питанием требует, чтобы модуль man:acpi[4] был загружен как модуль или статически скомпилирован в собственное ядро.
