Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/boot/_index.po
Languages: es, ru

source: An introduction to the FreeBSD Booting Process, demonstrates how to customize the FreeBSD boot process, including everything that happens until the FreeBSD kernel has started, probed for devices, and started init
es: Una introducción al Proceso de Arranque de FreeBSD, muestra cómo personalizar el proceso de arranque de FreeBSD, incluyendo todo lo que sucede hasta que el kernel de FreeBSD se ha iniciado, ha sondeado dispositivos, y ha iniciado init
ru: В этой главе описывается процесс загрузки FreeBSD и способы его настройки. Рассматриваются все этапы — от начальной загрузки до момента, когда ядро FreeBSD завершает инициализацию, определяет оборудование и запускает процесс init

source: Part III. System Administration
es: Parte III. Administración del sistema
ru: Часть III. Администрирование системы

source: Chapter 15. The FreeBSD Booting Process
es: Capítulo 15. El Proceso de Arranque de FreeBSD
ru: Глава 15. Процесс загрузки FreeBSD

source: The FreeBSD Booting Process
es: El Proceso de Arranque de FreeBSD
ru: Процесс загрузки FreeBSD

source: Synopsis
es: Sinopsis
ru: Обзор

source: The process of starting a computer and loading the operating system is referred to as "the bootstrap process", or "booting". FreeBSD's boot process provides a great deal of flexibility in customizing what happens when the system starts, including the ability to select from different operating systems installed on the same computer, different versions of the same operating system, or a different installed kernel.
es: El proceso de iniciar una computadora y cargar el sistema operativo se conoce como "proceso de arranque", o "arranque". El proceso de arranque de FreeBSD proporciona mucha flexibilidad para personalizar lo que sucede cuando el sistema se inicia, incluyendo la posibilidad de seleccionar diferentes sistemas operativos de los instalados en la computadora, diferentes versiones del mismo sistema operativo, o un kernel distinto.
ru: Процесс запуска компьютера и загрузки операционной системы называется "процессом начальной загрузки" или "загрузкой". Процесс загрузки FreeBSD предоставляет большую гибкость в настройке действий при старте системы, включая возможность выбора между различными операционными системами, установленными на одном компьютере, разными версиями одной операционной системы или другим установленным ядром.

source: This chapter details the configuration options that can be set. It demonstrates how to customize the FreeBSD boot process, including everything that happens until the FreeBSD kernel has started, probed for devices, and started man:init[8]. This occurs when the text color of the boot messages changes from bright white to grey.
es: Este capítulo detalla las opciones de configuración que se pueden establecer. Muestra cómo personalizar el proceso de arranque de FreeBSD, incluyendo todo lo que sucede hasta que el kernel se ha iniciado, ha sondeado los dispositivos, y arrancado man:init[8]. Esto ocurre cuando el color del text de los mensajes de arranque cambian de blanco brillante a gris.
ru: Эта глава подробно описывает доступные параметры конфигурации. В ней показано, как настроить процесс загрузки FreeBSD, включая все этапы до момента, когда ядро FreeBSD запустится, определит устройства и запустит man:init[8]. Это происходит, когда цвет текста загрузочных сообщений меняется с ярко-белого на серый.

source: After reading this chapter, you will recognize:
es: Después de leer este capítulo, reconocerás:
ru: Прочитав эту главу, вы узнаете:

source: The components of the FreeBSD bootstrap system and how they interact.
es: Los componentes del sistema de arranque de FreeBSD y cómo interactúan.
ru: Компоненты загрузочной системы FreeBSD и их взаимодействие.

source: The options that can be passed to the components in the FreeBSD bootstrap in order to control the boot process.
es: Las opciones que se pueden pasar a los componentes en el arranque de FreeBSD para controlar el proceso de arranque.
ru: Параметры, которые можно передать компонентам в процессе загрузки FreeBSD для управления процессом загрузки.

source: The basics of setting device hints.
es: Lo básico de establecer indicios para los dispositivos.
ru: Основы настройки подсказок устройств.

source: How to boot into single- and multi-user mode and how to properly shut down a FreeBSD system.
es: Cómo arrancar en modo mono usuario o multi usuario y cómo apagar correctamente FreeBSD.
ru: Как загрузиться в однопользовательском и многопользовательском режимах и как правильно завершить работу системы FreeBSD.

source: This chapter only describes the boot process for FreeBSD running on x86 and amd64 systems.
es: Este capítulo sólo describe el proceso de arranque para FreeBSD ejecutándose en sistemas x86 y amd64.
ru: Эта глава описывает только процесс загрузки FreeBSD на системах с архитектурой x86 и amd64.

source: FreeBSD Boot Process
es: Proceso de Arranque de FreeBSD
ru: Процесс загрузки FreeBSD

source: Turning on a computer and starting the operating system poses an interesting dilemma. By definition, the computer does not know how to do anything until the operating system is started. This includes running programs from the disk. If the computer can not run a program from the disk without the operating system, and the operating system programs are on the disk, how is the operating system started?
es: Encender una computadora y arrancar el sistema operativo crea un interesante dilema. Por definición, la computadora no sabe hacer nada hasta que el sistema operativo se ha iniciado. Esto incluye ejecutar programas desde el disco. Si la computadora no puede ejecutar un programa desde el disco sin el sistema operativo, y los programas del sistema operativo están en el disco, ¿cómo se inicia el sistema operativo?
ru: Включение компьютера и запуск операционной системы представляет собой интересную дилемму. По определению, компьютер не умеет ничего делать до запуска операционной системы. Это включает в себя запуск программ с диска. Если компьютер не может запустить программу с диска без операционной системы, а программы операционной системы находятся на диске, то как же тогда запускается операционная система?

source: This problem parallels one in the book The Adventures of Baron Munchausen. A character had fallen part way down a manhole, and pulled himself out by grabbing his bootstraps and lifting. In the early days of computing, the term _bootstrap_ was applied to the mechanism used to load the operating system. It has since become shortened to "booting".
es: Este problema tiene un problema similar en el libro Las Aventuras de Baron Munchausen. Un persona ha caído por un agujero, y ha salido del mismo agarrando los cordones de los zapatos y tirando de ellos. En los albores de la computación, el término _boostrap_ se aplicaba al mecanismo usado para cargar el sistema operativo. Desde entonces se ha abreviado como "booting" (arranque).
ru: Эта проблема аналогична описанной в книге «Приключения барона Мюнхгаузена». Персонаж частично провалился в люк, но смог выбраться, ухватившись за шнурки своих сапог и подтянув себя вверх. В первые дни развития вычислительной техники термин **_bootstrap_** применялся к механизму загрузки операционной системы. Со временем он сократился до «**загрузки**» (англ. "booting").

source: On x86 hardware, the Basic Input/Output System (BIOS) is responsible for loading the operating system. The BIOS looks on the hard disk for the Master Boot Record (MBR), which must be located in a specific place on the disk. The BIOS has enough knowledge to load and run the MBR, and assumes that the MBR can then carry out the rest of the tasks involved in loading the operating system, possibly with the help of the BIOS.
es: En arquitectura x86, la BIOS (Basic Input/Output System) es responsable de cargar el sistema operativo. La BIOS busca en el disco duro el MBR (Master Boot Record), que tiene que estar en un lugar específico del disco. La BIOS tiene conocimiento suficiente para cargar y ejecutar el MBR, y asume que el MBR puede continuar con el resto de las tareas involucradas en la carga del sistema operativo, posiblemente con la ayuda de la propia BIOS.
ru: На аппаратном обеспечении x86 загрузка операционной системы выполняется базовой системой ввода/вывода (BIOS). BIOS ищет на жестком диске главную загрузочную запись (MBR), которая должна находиться в определенном месте диска. BIOS обладает достаточными знаниями для загрузки и запуска MBR и предполагает, что MBR затем сможет выполнить остальные задачи по загрузке операционной системы, возможно, с помощью BIOS.

source: FreeBSD provides for booting from both the older MBR standard, and the newer GUID Partition Table (GPT). GPT partitioning is often found on computers with the Unified Extensible Firmware Interface (UEFI). However, FreeBSD can boot from GPT partitions even on machines with only a legacy BIOS with man:gptboot[8]. Work is under way to provide direct UEFI booting.
es: FreeBSD puede arrancar tanto desde el antiguo estándar MBR, como del nuevo GPT (GUID Partition Table). Las particiones GPT se encuentran habitualmente en computadoras con UEFI (Unified Extensible Firmware Interface). Sin embargo, FreeBSD puede arrancar desde particiones GPT incluso en máquinas que sólo tienen un BIOS antigua con man:gptboot[8]. Hay trabajos en curso para proporcionar arranque UEFI directo.
ru: FreeBSD поддерживает загрузку как по старому стандарту MBR, так и по новому стандарту GUID Partition Table (GPT). Разметка GPT часто встречается на компьютерах с Unified Extensible Firmware Interface (UEFI). Однако FreeBSD может загружаться с разделов GPT даже на машинах с устаревшим BIOS, используя man:gptboot[8]. Ведутся работы по обеспечению прямой загрузки через UEFI.

source: The code within the MBR is typically referred to as a _boot manager_, especially when it interacts with the user. The boot manager usually has more code in the first track of the disk or within the file system. Examples of boot managers include the standard FreeBSD boot manager boot0, also called Boot Easy, and GNU GRUB, which is used by many Linux(R) distributions.
es: El código que está en el MBR se conoce habitualmente como _gestor de arranque, especialmente cuando interactúa con el usuario. El gestor de arranque normalmente tiene más código en la primera pista del disco o en el sistema de ficheros. Ejemplos de gestores de arranque incluyen el gestor de arranque estándar de FreeBSD boot0, también llamado Boot Easy, y GNU GRUB, que es usado por muchas distribuciones Linux(R).
ru: Код в MBR обычно называют _загрузчиком_, особенно если он взаимодействует с пользователем. Загрузчик обычно содержит больше кода в первом треке диска или в файловой системе. Примерами загрузчиков являются стандартный загрузчик FreeBSD boot0, также называемый Boot Easy, и GNU GRUB, который используется во многих дистрибутивах Linux(R).

source: Users of GRUB should refer to https://www.gnu.org/software/grub/grub-documentation.html[GNU-provided documentation].
es: Los usuarios de GRUB deberían consultar la https://www.gnu.org/software/grub/grub-documentation.html[documentación proporcionada por GNU].
ru: Пользователи GRUB могут обратиться к https://www.gnu.org/software/grub/grub-documentation.html[документации от GNU].

source: If only one operating system is installed, the MBR searches for the first bootable (active) slice on the disk, and then runs the code on that slice to load the remainder of the operating system. When multiple operating systems are present, a different boot manager can be installed to display a list of operating systems so the user can select one to boot.
es: Si sólo hay instalado un sistema operativo, el MBR busca el primer sector arrancable (activo) en el disco y después ejecuta el código en ese sector para cargar el resto del sistema operativo. Cuando hay varios sistemas operativos, se puede instalar un gestor de arranque diferente para mostrar una lista de sistemas operativos de forma que el usuario pueda seleccionar uno para arrancar.
ru: Если на компьютере установлена только одна операционная система, MBR ищет первый загрузочный (активный) раздел на диске, а затем запускает код в этом разделе для загрузки остальной части операционной системы. При наличии нескольких операционных систем можно установить другой загрузчик, который отобразит список операционных систем, позволяя пользователю выбрать нужную для загрузки.

source: The remainder of the FreeBSD bootstrap system is divided into three stages. The first stage knows just enough to get the computer into a specific state and run the second stage. The second stage can do a little bit more, before running the third stage. The third stage finishes the task of loading the operating system. The work is split into three stages because the MBR puts limits on the size of the programs that can be run at stages one and two. Chaining the tasks together allows FreeBSD to provide a more flexible loader.
es: Lo que queda del sistema de arranque de FreeBSD se divide en tres etapas. La primera etapa conoce lo suficiente para poner la computadora en un estado específico y ejecutar la segunda etapa. La segunda etapa puede hacer un poco más, antes de ejecutar la tercera etapa. La tercera etapa termina la tarea de cargar el sistema operativo. El trabajo se divide en tres etapas por el MBR impone límites en el tamaño de los programas que se pueden ejecutar en las etapas uno y dos. Encadenar las tareas permite a FreeBSD proporcionar un cargador más flexible.
ru: Оставшаяся часть загрузочной системы FreeBSD разделена на три этапа. Первый этап знает ровно столько, чтобы перевести компьютер в определённое состояние и запустить второй этап. Второй этап может выполнить немного больше, прежде чем запустить третий этап. Третий этап завершает загрузку операционной системы. Работа разделена на три этапа, потому что MBR накладывает ограничения на размер программ, которые могут быть выполнены на первом и втором этапах. Объединение задач в цепочку позволяет FreeBSD предоставить более гибкий загрузчик.

source: The kernel is then started and begins to probe for devices and initialize them for use. Once the kernel boot process is finished, the kernel passes control to the user process man:init[8], which makes sure the disks are in a usable state, starts the user-level resource configuration which mounts file systems, sets up network cards to communicate on the network, and starts the processes which have been configured to run at startup.
es: Después se arranca el kernel y comienza a sondear dispositivos e inicializarlos para su uso. Una vez que el proceso de arranque ha terminado, el kernel pasa el control al proceso de usuario man:init[8], que se asegura de que los discos estén en un estado usable, inicia la configuración de nivel de usuario que monta los sistemas de ficheros, configura las tarjetas de red para comunicarse por la red, e inicia el proceso que haya sido configurado para ejecutarse al arrancar.
ru: Затем запускается ядро, которое начинает поиск и инициализацию устройств для их использования. После завершения процесса загрузки ядра управление передаётся пользовательскому процессу man:init[8], который проверяет готовность дисков к работе, запускает пользовательскую настройку ресурсов, монтирует файловые системы, настраивает сетевые карты для работы в сети и запускает процессы, запланированные для выполнения при старте системы.

source: This section describes these stages in more detail and demonstrates how to interact with the FreeBSD boot process.
es: Esta sección describe estas etapas en más detalle y demuestra cómo interactuar con el proceso de arranque de FreeBSD.
ru: Этот раздел подробно описывает эти этапы и показывает, как взаимодействовать с процессом загрузки FreeBSD.

source: The Boot Manager
es: El Gestor de Arranque
ru: Загрузчик

source: The boot manager code in the MBR is sometimes referred to as _stage zero_ of the boot process. By default, FreeBSD uses the boot0 boot manager.
es: El código del gestor de arranque en el MBR a veces se llama _etapa cero_ del proceso de arranque. Por defecto, FreeBSD utiliza el gestor de arranque boot0.
ru: Код загрузчика в MBR иногда называют _нулевой стадией_ процесса загрузки. По умолчанию FreeBSD использует загрузчик boot0.

source: The MBR installed by the FreeBSD installer is based on [.filename]#/boot/boot0#. The size and capability of boot0 is restricted to 446 bytes due to the slice table and `0x55AA` identifier at the end of the MBR. If boot0 and multiple operating systems are installed, a message similar to this example will be displayed at boot time:
es: El MBR instalado por el instalador de FreeBSD se basa en [.filename]#/boot/boot0#. El tamaño y las capacidades de boot0 está restringido a 446 bytes debido a la tabla de particiones y el identificador `0x55AA` al final del MBR. Si está instalado boot0 y varios sistemas operativos, se mostrará un mensaje similar este durante el arranque:
ru: MBR, записываемый установщиком FreeBSD, основан на [.filename]#/boot/boot0#. Размер и возможности boot0 ограничены 446 байтами из-за таблицы разделов и идентификатора `0x55AA` в конце MBR. Если установлены boot0 и несколько операционных систем, при загрузке будет отображаться сообщение, похожее на этот пример:

source: [.filename]#boot0# Screenshot
ru: Экран [.filename]#boot0#

source: Other operating systems will overwrite an existing MBR if they are installed after FreeBSD. If this happens, or to replace the existing MBR with the FreeBSD MBR, use the following command:
es: Otros sistemas operativos sobrescribirán un MBR existente si se instalan después de FreeBSD. Si esto sucede, o para reemplazar el MBR existente con el MBR de FreeBSD, utiliza el siguiente comando:
ru: Другие операционные системы перезапишут существующую MBR, если они установлены после FreeBSD. Если это произошло или требуется заменить существующую MBR на MBR FreeBSD, используйте следующую команду:

source: where _device_ is the boot disk, such as [.filename]#ad0# for the first IDE disk, [.filename]#ad2# for the first IDE disk on a second IDE controller, or [.filename]#da0# for the first SCSI disk. To create a custom configuration of the MBR, refer to man:boot0cfg[8].
es: donde _device_ es el disco de arranque, como [.filename]#ad0# para el primer disco IDE, [.filename]#ad2# para el primer disco IDE en el segundo controlador IDE, o [.filename]#da0# para el primer disco SCSI. Para crear una configuración personalizada del MBR, consulta man:boot0cfg[8].
ru: где _device_ — это загрузочный диск, например, [.filename]#ad0# для первого IDE-диска, [.filename]#ad2# для первого IDE-диска на втором IDE-контроллере или [.filename]#da0# для первого SCSI-диска. Для создания пользовательской конфигурации MBR обратитесь к man:boot0cfg[8].

source: Stage One and Stage Two
es: Etapa Uno y Etapa Dos
ru: Этап первый и Этап второй

source: Conceptually, the first and second stages are part of the same program on the same area of the disk. Due to space constraints, they have been split into two, but are always installed together. They are copied from the combined [.filename]#/boot/boot# by the FreeBSD installer or `bsdlabel`.
es: Conceptualmente, la primera y segunda etapa son parte del mismo programa en el mismo área del disco. Debido a restricciones de espacio, se han dividido en dos, pero siempre están instalados juntos. Se copian desde el [.filename]#/boot/boot# combinado por el instalador de FreeBSD o `bsdlabel`.
ru: Концептуально первая и вторая стадии являются частью одной программы и расположены в одной области диска. Из-за ограничений по объёму они были разделены на две части, но всегда устанавливаются вместе. Они копируются из объединённого файла [.filename]#/boot/boot# с помощью установщика FreeBSD или `bsdlabel`.

source: These two stages are located outside file systems, in the first track of the boot slice, starting with the first sector. This is where boot0, or any other boot manager, expects to find a program to run which will continue the boot process.
es: Estas dos etapas están situadas fuera del sistema de ficheros, en la primera pista de la partición de arranque, comenzando con el primer sector. Aquí es donde boot0, o cualquier otro gestor de arranque, espera encontrar un programa para ejecutar que continuará con el proceso de arranque.
ru: Эти два этапа расположены за пределами файловых систем, в первом треке загрузочного раздела, начиная с первого сектора. Именно здесь boot0 или любой другой загрузчик ожидает найти программу для запуска, которая продолжит процесс загрузки.

source: The first stage, [.filename]#boot1#, is very simple, since it can only be 512 bytes in size. It knows just enough about the FreeBSD _bsdlabel_, which stores information about the slice, to find and execute [.filename]#boot2#.
es: La primera etapa, [.filename]#boot1#, es muy simple, ya que sólo puede ocupar 512 bytes. Sólo sabe lo suficiente acerca del _bsdlabel_ de FreeBSD, que almacena información acerca de la partición, para encontrar y ejecutar [.filename]#boot2#.
ru: Первая стадия, [.filename]#boot1#, очень проста, так как её размер может составлять только 512 байт. Она знает ровно столько о _bsdlabel_ FreeBSD, в котором хранится информация о слайсе, чтобы найти и выполнить [.filename]#boot2#.

source: Stage two, [.filename]#boot2#, is slightly more sophisticated, and understands the FreeBSD file system enough to find files. It can provide a simple interface to choose the kernel or loader to run. It runs loader, which is much more sophisticated and provides a boot configuration file. If the boot process is interrupted at stage two, the following interactive screen is displayed:
es: La etapa dos, [.filename]#boot2#, es algo más sofisticada, y entiende el sistema de ficheros de FreeBSD lo suficiente como para encontrar ficheros. Puede proporcionar una interfaz simple para escoger el kernel o cargador para ejecutar. Ejecutar el cargador, que es mucho más sofisticado y proporciona un fichero de configuración de arranque. Si el proceso de arranque se interrumpe en la etapa 2, se muestra la siguiente pantalla interactiva:
ru: Этап два, [.filename]#boot2#, немного сложнее и понимает файловую систему FreeBSD достаточно хорошо, чтобы находить файлы. Он может предоставить простой интерфейс для выбора ядра или загрузчика для запуска. Он запускает loader, который гораздо более продвинут и предоставляет файл конфигурации загрузки. Если процесс загрузки прерывается на втором этапе, отображается следующий интерактивный экран:

source: [.filename]#boot2# Screenshot
ru: Экран [.filename]#boot2#

source: To replace the installed [.filename]#boot1# and [.filename]#boot2#, use `bsdlabel`, where _diskslice_ is the disk and slice to boot from, such as [.filename]#ad0s1# for the first slice on the first IDE disk:
es: Para reemplazar los [.filename]#boot1# y [.filename]#boot2# instalados, usa `bsdlabel`, donde _diskslice_ es el disco y partición desde el que arrancar, como [.filename]#ad0s1# para la primera partición del primer disco IDE:
ru: Для замены установленных [.filename]#boot1# и [.filename]#boot2# используйте `bsdlabel`, где _diskslice_ — это диск и раздел, с которого производится загрузка, например [.filename]#ad0s1# для первого раздела на первом IDE-диске:
