Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/kernelbuild/_index.po
Languages: es, ru

source: Building and Installing a FreeBSD Kernel
es: Construir e instalar un kernel de FreeBSD
ru: Сборка и установка ядра FreeBSD

source: Chapter 9. Building and Installing a FreeBSD Kernel
es: Capítulo 9. Construir e instalar un kernel de FreeBSD
ru: Глава 9. Сборка и установка ядра FreeBSD

source: Being a kernel developer requires understanding of the kernel build process. To debug the FreeBSD kernel it is required to be able to build one. There are two known ways to do so:
es: Ser un desarrollador del kernel requiere entender el proceso de construcción del kernel. Para depurar el kernel de FreeBSD es necesario poder compilarlo. Hay dos formas conocidas de hacerlo:
ru: Чтобы быть разработчиком ядра, требуется понимания процесса сборки ядра. Для отладки ядра FreeBSD необходимо уметь его собирать. Существует два известных способа сделать это:

source: The supported procedure to build and install a kernel is documented in the extref:{handbook}kernelconfig/[Building and Installing a Custom Kernel, kernelconfig-building] chapter of the FreeBSD Handbook.
es: El procedimiento soportado para construir e instalar un kernel está documentado en el capítulo extref:{handbook}kernelconfig[Construir e instalar un kernel personalizado, kernelconfig-building] del Manual de FreeBSD.
ru: Поддерживаемая процедура сборки и установки ядра описана в главе extref:{handbook}kernelconfig/[Сборка и установка пользовательского ядра, kernelconfig-building] Руководства FreeBSD.

source: It is supposed that the reader of this chapter is familiar with the information described in the extref:{handbook}kernelconfig/[Building and Installing a Custom Kernel, kernelconfig-building] chapter of the FreeBSD Handbook. If this is not the case, please read through the above mentioned chapter to understand how the build process works.
es: Se supone que el lector de este capítulo está familiarizado con la información descrita en el capítulo extref:{handbook}kernelconfig[Construir e instalar un kernel personalizado, kernelconfig-building] del Manual de FreeBSD. Si no es el caso, por favor lea el capítulo mencionado para entender cómo funciona el proceso de construcción.
ru: Предполагается, что читатель этой главы знаком с информацией, изложенной в главе extref:{handbook}kernelconfig/[Сборка и установка пользовательского ядра, kernelconfig-building] Руководства FreeBSD. Если это не так, пожалуйста, ознакомьтесь с упомянутой главой, чтобы понять, как работает процесс сборки.

source: Building the Faster but Brittle Way
es: Construir más deprisa pero más frágil
ru: Построение более быстрым, но менее надежным способом

source: Building the kernel this way may be useful when working on the kernel code and it may actually be faster than the documented procedure when only a single option or two were tweaked in the kernel configuration file. On the other hand, it might lead to unexpected kernel build breakage.
es: Construir el kernel de esta manera puede ser útil cuando se trabaja en el código del kernel y de hecho puede ser más rápido que el procedimiento documentado cuando sólo una o dos opciones fueron modificadas en el archivo de configuración del kernel. Por otro lado, puede llevar a un fallo inesperado en la compilación del núcleo.
ru: Сборка ядра таким способом может быть полезной при работе с кодом ядра и может оказаться быстрее, чем описанная процедура, если в конфигурационном файле ядра были изменены только одна или две опции. С другой стороны, это может привести к неожиданным сбоям при сборке ядра.

source: Run man:config[8] to generate the kernel source code:
es: Ejecute man:config[8] para generar el código fuente del núcleo:
ru: Выполните man:config[8] для генерации исходного кода ядра:

source: Change into the build directory. man:config[8] will print the name of this directory after being run as above.
es: Cambie al directorio de construcción. man:config[8] publicará el nombre de este directorio después de ejecutarse como se ha indicado anteriormente.
ru: Перейдите в каталог сборки. man:config[8] выведет имя этого каталога после выполнения, как указано выше.

source: Compile the kernel:
es: Compilar el núcleo:
ru: Скомпилируйте ядро:

source: Install the new kernel:
es: Instala el nuevo kernel:
ru: Установите новое ядро:
