Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/rosetta/_index.po
Languages: es, it_it

source: Rosetta Stone with the differences between Docbook and AsciiDoc
es: Piedra Rosetta con las diferencias entre Docbook y AsciiDoc
it_it: Stele di Rosetta con le differenze tra Docbook ed AsciiDoc

source: Chapter 7. Rosetta Stone
es: Capítulo 7. Piedra Rosetta
it_it: Capitolo 7. Stele di Rosetta

source: Rosetta Stone
es: Piedra Rosetta
it_it: Stele di Rosetta

source: Comparison between Docbook and AsciiDoc
es: Comparación entre Docbook y AsciiDoc
it_it: Confronto tra Docbook ed AsciiDoc

source: This rosetta stone tries to show the differences between Docbook and AsciiDoc.
es: Esta piedra Rosetta prueba mostrar las diferencias entre Docbook y AsciiDoc.
it_it: Questa stele di Rosetta cerca di illustrare le differenze tra Docbook ed AsciiDoc.

source: Language Feature
es: Característica del idioma
it_it: Funzioni di linguaggio

source: Docbook
es: Libro de documentación

source: *Bold*
es: *Negrita*
it_it: *Grassetto*

source: <strong>bold</strong>
es: <strong>negrita</strong>
it_it: <strong>grassetto</strong>

source: \*bold*
es: \*negrita*
it_it: \*grassetto*

source: *Italic*
es: *Cursiva*
it_it: *Corsivo*

source: <emphasis>Italic</emphasis>
es: <emphasis>Cursiva</emphasis>
it_it: <emphasis>Corsivo</emphasis>

source: \_Italic_
es: \_Cursiva_
it_it: \_Corsivo_

source: *Monospace*
es: *Monoespaciada*

source: <literal>Monospace</literal>
es: <literal>Monoespaciada</literal>

source: \`Monospace`
es: \`Monoespaciada`

source: *Paragraph*
es: *Párrafo*
it_it: *Paragrafo*

source: <para>This is a paragraph</para>
es: <para>Este es un párrafo</para>
it_it: <para>Questo è un paragrafo</para>

source: This is a paragraph
es: Este es un párrafo
it_it: Questo è un paragrafo

source: *Keycap*
es: *Tecla*
it_it: *Tasto della tastiera*

source: *Links*
es: *Enlaces*
it_it: *Collegamenti ipertestuali*

source: *Sections*
es: *Secciones*
it_it: *Sezioni*

source: [source,xml] ---- <sect1 xml:id="id"> <title>Section 1</title> </sect1> ----
es: [source,xml] ---- <sect1 xml:id="id"> <title>Sección 1</title> </sect1> ----
it_it: [source,xml] ---- <sect1 xml:id="id"> <title>Sezione 1</title> </sect1> ----

source: [source] ---- [[id]] = Section 1 ----
es: [source] ---- [[id]] = Sección 1 ----
it_it: [source] ---- [[id]] = Sezione 1 ----

source: *Unordered list*
es: *Lista desordenada*
it_it: *Elenchi non ordinati*

source: [source,xml] ---- <itemizedlist> <listitem> <para>When to build a custom kernel.</para> </listitem> <listitem> <para>How to take a hardware inventory.</para> </listitem> </itemizedlist> ----
es: [source,xml] ---- <itemizedlist> <listitem> <para>Cuándo hacer un kernel personalizado.</para> </listitem> <listitem> <para>Cómo inventariar el hardware.</para> </listitem> </itemizedlist> ----
it_it: [source,xml] ---- <itemizedlist> <listitem> <para>Quando compilare un kernel personalizzato.</para> </listitem> <listitem> <para>Come fare l'inventario dell'hardware.</para> </listitem> </itemizedlist> ----

source: [source] ---- * When to build a custom kernel. * How to take a hardware inventory. ----
es: [source] ---- * Cuándo hacer un kernel personalizado. * Cómo inventariar el hardware. ----
it_it: [source] ---- * Come compilare un kernel personalizzato. * Come fare l'inventario dell'hardware. ----

source: *Ordered list*
es: *Lista ordenada*
it_it: *Elenchi ordinati*

source: [source,xml] ---- <orderedlist> <listitem> <para>One</para> </listitem> <listitem> <para>Two</para> </listitem> <listitem> <para>Three</para> </listitem> <listitem> <para>Four</para> </listitem> </orderedlist> ----
es: [source,xml] ---- <orderedlist> <listitem> <para>Uno</para> </listitem> <listitem> <para>Dos</para> </listitem> <listitem> <para>Tres</para> </listitem> <listitem> <para>Cuatro</para> </listitem> </orderedlist> ----
it_it: [source,xml] ---- <orderedlist> <listitem> <para>Uno</para> </listitem> <listitem> <para>Due</para> </listitem> <listitem> <para>Tre</para> </listitem> <listitem> <para>Quattro</para> </listitem> </orderedlist> ----

source: [source] ---- . One . Two . Three . Four ----
es: [source] ---- . Uno . Dos . Tres . Cuatro ----
it_it: [source] ---- . Uno . Due . Tre . Quattro ----

source: *Variable list*
es: *Lista variable*
it_it: *Elenco di termini*

source: [source,xml] ---- <variablelist> <varlistentry> <term>amd64</term> <listitem> <para>This is the most common desktop...</para> </listitem> </varlistentry> </variablelist> ----
es: [source,xml] ---- <variablelist> <varlistentry> <term>amd64</term> <listitem> <para>Este es el tipo de ordenador de sobremesa más común...</para> </listitem> </varlistentry> </variablelist> ----
it_it: [source,xml] ---- <variablelist> <varlistentry> <term>amd64</term> <listitem> <para>È il desktop più comune...</para> </listitem> </varlistentry> </variablelist> ----

source: [source] ---- amd64:: This is the most common desktop... ----
es: [source] ---- amd64:: Este es el tipo de ordenador de sobremesa más común... ----
it_it: [source] ---- amd64:: È il desktop più comune... ----

source: *Source code*
es: *Código fuente*
it_it: *Codice sorgente*

source: *Literal block*
es: *Bloque literal*
it_it: *Blocco letterale*

source: *Images*
es: *Imágenes*
it_it: *Immagini*

source: [source] ---- [[bsdinstall-newboot-loader-menu]] .FreeBSD Boot Loader Menu image::bsdinstall/bsdinstall-newboot-loader-menu[The FreeBSD loader menu, with options 1-6 to boot multi-user, boot single user, escape to loader prompt, reboot, select a kernel to load, and select boot options] ----
es: [source] ---- [[bsdinstall-newboot-loader-menu]] .FreeBSD Boot Loader Menu image::bsdinstall/bsdinstall-newboot-loader-menu[El menú de início, con opciones 1 a 6 para iniciar en módo multiusuario, iniciar en módo monousuario, escapar al prompt de cargar, reiniciar, elegir un kernel para cargar, y escoger opciones de início] ----
it_it: [source] ---- [[bsdinstall-newboot-loader-menu]] .Menu del Boot Loader di FreeBSD image::bsdinstall/bsdinstall-newboot-loader-menu[Il loader di FreeBSD, con le opzioni 1-6 per eseguire il boot multi-utente, utente singolo, avviare il prompt del loader, riavviare, selezionare il kernel da caricare e selezionare le opzioni di boot] ----

source: *Includes*
es: *Incluye(n)*
it_it: *Inclusioni*

source: *Tables*
es: *Tablas*
it_it: *Tabelle*

source: [source,xml] ---- <table xml:id="partition-schemes" frame="none" rowsep="1" pgwide="1"> <title>Partitioning Schemes</title> <tgroup cols="2" align="left"> <thead> <row> <entry align="left">Abbreviation</entry> <entry align="left">Description</entry> </row> </thead> <tbody> <row> <entry>APM</entry> <entry>Apple Partition Map, used by PowerPC(R).</entry> </row> </tbody> </tgroup> </table> ----
es: [source,xml] ---- <table xml:id="partition-schemes" frame="none" rowsep="1" pgwide="1"> <title>Plano de partición</title> <tgroup cols="2" align="left"> <thead> <row> <entry align="left">Abreviatura</entry> <entry align="left">Descripción</entry> </row> </thead> <tbody> <row> <entry>APM</entry> <entry>Apple Partition Map, usada por PowerPC(R).</entry> </row> </tbody> </tgroup> </table> ----
it_it: [source,xml] ---- <table xml:id="partition-schemes" frame="none" rowsep="1" pgwide="1"> <title>Schemi di Partizionamento</title> <tgroup cols="2" align="left"> <thead> <row> <entry align="left">Abbreviazione</entry> <entry align="left">Descrizione</entry> </row> </thead> <tbody> <row> <entry>APM</entry> <entry>Apple Partition Map, usato da PowerPC(R).</entry> </row> </tbody> </tgroup> </table> ----

source: [source] ---- [[partition-schemes]] .Partitioning Schemes [cols="1,1", frame="none", options="header"] \
es: [source] ---- [[partition-schemes]] .Plano de partición [cols="1,1", frame="none", options="header"] \
it_it: [source] ---- [[partition-schemes]] .Schemi di Partizionamento [cols="1,1", frame="none", options="header"] \

source: Abbreviation \
es: Abreviatura \
it_it: Abbreviazione \

source: Description \
es: Descripción \
it_it: Descrizione \

source: Apple Partition Map, used by PowerPC(R). \
es: Apple Partition Map, usada por PowerPC(R). \
it_it: Apple Partition Map, usato da PowerPC(R). \

source: *Admonitions*
es: *Consejos*
it_it: *Ammonimenti*

source: [source,xml] ---- <tip> <para>This is a tip</para> </tip> ----
es: [source,xml] ---- <tip> <para>Este es un consejo.</para> </tip> ----
it_it: [source,xml] ---- <tip> <para>Questo è un suggerimento</para> </tip> ----

source: [source] ---- [TIP] ==== This is a tip ==== ----
es: [source] ---- [TIP] ==== Esto es un consejo. ==== ----
it_it: [source] ---- [TIP] ==== Questo è un suggerimento ==== ----

source: [source,xml] ---- <link xlink:href="https://www.freebsd.org/where/">Download FreeBSD</link> ----
it_it: [source,xml] ---- <link xlink:href="https://www.freebsd.org/where/">Scaricare FreeBSD</link> ----

source: [source] ---- link:https://www.freebsd.org/where/[Download FreeBSD] ----
it_it: [source] ---- link:https://www.freebsd.org/where/[Scaricare FreeBSD] ----

source: [source,xml] ---- <figure xml:id="bsdinstall-newboot-loader-menu"> <title>FreeBSD Boot Loader Menu</title> <mediaobject> <imageobject> <imagedata fileref="bsdinstall/bsdinstall-newboot-loader-menu"/> </imageobject> <textobject> </literallayout>ASCII art replacement is no longer supported.</literallayout> </textobject> <textobject> <phrase>The FreeBSD loader menu, with options 1-6 to boot multi-user, boot single user, escape to loader prompt, reboot, select a kernel to load, and select boot options</phrase> </textobject> </mediaobject> </figure> ----
it_it: [source,xml] ---- <figure xml:id="bsdinstall-newboot-loader-menu"> <title>Menu del Boot Loader di FreeBSD</title> <mediaobject> <imageobject> <imagedata fileref="bsdinstall/bsdinstall-newboot-loader-menu"/> </imageobject> <textobject> </literallayout>L'immagine sostitutiva in arte ASCII non è più supportata.</literallayout> </textobject> <textobject> <phrase>Il loader di FreeBSD, con le opzioni 1-6 per eseguire il boot multi-utente, utente singolo, avviare il prompt del loader, riavviare, selezionare il kernel da caricare e selezionare le opzioni di boot</phrase> </textobject> </mediaobject> </figure> ----
