Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/port-mentor-guidelines/_index.po
Languages: pt_br

source: Port Mentor Guidelines for FreeBSD Mentors
pt_br: Instruções para Mentores do Ports

source: Port Mentor Guidelines
pt_br: Instruções para Mentores do Ports

source: Guideline for Mentor/Mentee Relationships
pt_br: Diretrizes para relacionamentos Mentor (Orientador) / Mentee (Aprendiz)

source: This section is intended to help demystify the mentoring process, as well as a way to openly promote a constructive discussion to adapt and grow the guidelines. In our lives we have too many rules; we are not a government organization that inflicts regulation, but rather a collective of like minded individuals working toward a common goal, maintaining the quality assurance of the product we call the Ports Tree.
pt_br: Esta seção destina-se a ajudar a desmistificar o processo de orientação (mentoria), bem como a promover abertamente uma discussão construtiva para adaptar e desenvolver as diretrizes. Em nossas vidas, temos muitas regras; nós não somos uma organização governamental que inflige regulamentação, mas sim um coletivo de indivíduos com o mesmo pensamento que trabalha em direção a um objetivo comum, mantendo a garantia de qualidade do produto que chamamos de Coleção de Ports.

source: Why Mentor?
pt_br: Por que tornar um Mentor?

source: For most of us, we were mentored into the Project, so return the favor by offering to mentor somebody else in.
pt_br: Para a maioria de nós, fomos orientados (mentorados) quando entramos no projeto, então devolva o favor oferecendo-se para orientar (mentorar) outra pessoa.

source: You have an irresistible urge to inflict knowledge on others.
pt_br: Você tem um desejo irresistível de infligir conhecimento aos outros.

source: The usual punishment applies because you are sick and tired of committing somebody else's good work!
pt_br: A punição usual se aplica porque você está doente e cansado de fazer o commit do bom trabalho de outra pessoa!

source: Reasons for a co-mentorship:
pt_br: Razões para uma co-orientação (co-mentorship):

source: Significant timezone differential. Accessible, interactive mentor(s) available via IM is extremely helpful!
pt_br: Diferença significativa de fuso horário. Mentores acessíveis e interativos disponíveis via IM são extremamente úteis!

source: Potential language barrier. Yes, FreeBSD is very English oriented, as is most software development, however, having a mentor who can speak a native language can be very useful.
pt_br: Barreira de idioma potencial. Sim, o FreeBSD é muito orientado para o inglês, assim como ocorre no restante da área de desenvolvimento de software, no entanto, ter um mentor que fale uma língua nativa pode ser muito útil.

source: ENOTIME! Until there is a 30 hour day, and an 8 day week, some of us only have so much time to give. Sharing the load with somebody else will make it easier.
pt_br: ENOTIME! Até que haja um dia de 30 horas e uma semana de 8 dias, alguns de nós não tem muito tempo para dar. Compartilhar a carga com outra pessoa tornará isso mais fácil.

source: A rookie mentor can benefit from the experience of a senior committer/mentor.
pt_br: Um mentor iniciante pode se beneficiar da experiência de um committer/mentor mais sênior.

source: Two heads are better than one.
pt_br: Duas cabeças são melhores que uma.

source: Reasons for sole mentorship:
pt_br: Razões para uma mentoria solitária:

source: You do not play nicely with others.
pt_br: Você não joga bem com os outros.

source: You prefer to have a one-on-one relationship.
pt_br: Você prefere ter um relacionamento um-a-um.

source: The reasons for co-mentorship do not apply to you.
pt_br: As razões para a co-mentoria não se aplicam a você.

source: Expectations
pt_br: Expectativas

source: We expect mentors to review and test-build all proposed patches, at least for an initial period lasting more than a week or two.
pt_br: Esperamos que os mentores revisem e testem todos os patches propostos, pelo menos por um período inicial que dure mais de uma ou duas semanas.

source: We expect that mentors should take responsibility for the actions of their mentee. A mentor should follow up with all commits the mentee makes, both approved and implicit.
pt_br: Esperamos que os mentores assumam a responsabilidade pelas ações de seus mentees. Um mentor deve acompanhar todos os commits que o mentee faz, tanto os aprovados quanto os implícitos.

source: We expect mentors to make sure their mentees read the extref:{porters-handbook}[Porter's Handbook], the extref:{pr-guidelines}[PR handling guide], and the extref:{committers-guide}[Committer's Guide]. While it is not necessary to memorize all the details, every committer needs to have an overview of these things to be an effective part of the community (and avoid as many rookie mistakes as possible).
pt_br: Esperamos que os mentores se certifiquem de que seus mentees leiam o extref:{porters-handbook}[Porter's Handbook], o extref:{pr-guidelines}[Diretrizes para manuseio de relatórios de problemas], e o extref:{committers-guide}[Guia do Committer]. Embora não seja necessário memorizar todos os detalhes, todo committer precisa ter uma visão geral desses detalhes para ser uma parte efetiva da comunidade (e evitar o maior número possível de erros de novato).

source: Selecting a Mentee
pt_br: Selecionando um Mentee

source: There is no defined rule for what makes a candidate ready; it can be a combination of number of PRs they have submitted, the number of ports maintained, frequency of ports updates and/or level of participation in a particular area of interest like GNOME, KDE, Gecko or others.
pt_br: Não há uma regra definida para o que torna um candidato pronto; pode ser uma combinação do número de PRs que eles enviaram, o número de ports mantidos, a frequência de atualizações dos ports e/ou o nível de participação em uma área específica de interesse como GNOME, KDE, Gecko ou outros.

source: A candidate should have almost no timeouts, be responsive to requests, and generally helpful in supporting their ports.
pt_br: Um candidato deve ter quase nenhum timeout, ser responsivo a solicitações e geralmente cooperativo no suporte aos seus ports.

source: There must be a history of commitment, as it is widely understood that training a committer requires time and effort. If somebody has been around longer, and spent the time observing how things are done, there is some anticipation of accumulated knowledge. All too often we have seen a maintainer submit a few PRs, show up in IRC and ask when they will be given a commit bit.
pt_br: Deve haver um histórico de comprometimento, pois é amplamente entendido que o treinamento de um committer requer tempo e esforço. Se alguém contribui já há algum tempo e já passou algum tempo observando como as coisas são feitas, podemos antecipar que existe algum conhecimento acumulado. Frequentemente vemos mantenedores que enviaram alguns PRs aparecerem no IRC perguntando quando eles receberão o commit bit.

source: Being subscribed to, and following the mailing lists is very beneficial. There is no real expectation that submitting posts on the lists will make somebody a committer, but it demonstrates a commitment. Some mails offer insights into the knowledge of a candidate as well how they interact with others. Similarly participating in IRC can give somebody a higher profile.
pt_br: Estar inscrito e seguir as listas de discussão é muito benéfico. Não há expectativa real de que enviar postagens para as listas torne alguém um committer, mas isso demonstra comprometimento. Alguns e-mails oferecem insights sobre o conhecimento de um candidato e também como eles interagem com as outras pessoas. Da mesma forma, participar do IRC pode dar a alguém um perfil mais elevado.

source: Ask six different committers how many PRs a maintainer should submit prior to being nominated, and you will get six different answers. Ask those same individuals how long somebody should have been participating, same dilemma. How many ports should they have at a minimum? Now we have a bikeshed! Some things are just hard to quantify, a mentor will just have to use their best judgement, and hope that portmgr agrees.
pt_br: Pergunte a seis commiters diferentes quantos PRs um mantenedor deve enviar antes de ser indicado, e você terá seis respostas diferentes. Pergunte às mesmas pessoas por quanto tempo alguém deveria estar participando, o mesmo dilema. Quantos ports eles devem ter no mínimo? Agora nós temos um bikeshed! Algumas coisas são difíceis de quantificar, um mentor terá apenas que usar seu melhor julgamento e esperar que o portmgr concorde.

source: Mentorship Duration
pt_br: Duração do Mentorship (Orientação)

source: As the trust level develops and grows, the mentee may be granted "implicit" commit rights. This can include trivial changes to a [.filename]#Makefile#, [.filename]#pkg-descr# etc. Similarly, it may include `PORTVERSION` updates that do not include `plist` changes. Other circumstances may be formulated at the discretion of the Mentor. However, during the period of mentorship, a port version bump that affects dependent ports should be checked by a mentor.
pt_br: À medida que o nível de confiança se desenvolve e cresce, o mentee pode receber direitos "implícitos" de commit. Isso pode incluir mudanças triviais em um [.filename]#Makefile#, [.filename]#pkg-descr#, etc. Da mesma forma, pode incluir atualizações de `PORTVERSION` que não incluam alterações de `plist`. Outras circunstâncias podem ser formuladas a critério do Mentor. No entanto, durante o período de orientação, qualquer atualização de versão em um port que afete outros ports dependentes deverá ser verificada por um mentor.

source: Just as we are all varied individuals, each mentee has different learning curves, time commitments, and other influencing factors that will contribute to the time required before they can "fly solo". Empirically, a mentee should be observed for at least 3 months. 90-100 commits is another target that a mentor could use before releasing a mentee. Other factors to consider prior releasing a mentee are the number of mistakes they may have made, QATs received etc. If they are still making rookie mistakes, they still require mentor guidance.
pt_br: Assim como somos todos indivíduos diferentes, cada mentee tem uma curva de aprendizado diferente, o tempo de dedicação ao projeto e outros fatores de influência irão contribuir para o tempo necessário antes que eles possam "voar sozinhos". Empiricamente, um mentee deve ser observado por pelo menos 3 meses. O numero de 90-100 commits é um outro objetivo que um mentor poderia usar antes de liberar um mentee. Outros fatores a considerar antes de liberar um aprendiz são o número de erros que eles podem ter cometido, QATs recebidos, etc. Se eles ainda estão cometendo erros, eles ainda precisam da orientação do mentor.

source: Mentor/Co-Mentor Debate
pt_br: Debate Mentor/Co-Mentor

source: When a request gets to portmgr, it usually reads as, "I propose 'foo' for a ports commit bit, I will co-mentor with 'bar'". Proposal received, voted, and carried.
pt_br: Quando um pedido chega para o portmgr, ele geralmente vem como, "Eu proponho 'foo' para um port commit bit, eu serei o co-mentor com 'bar'". Proposta recebida, votada e executada.

source: The mentor is the primary point of contact or the "first among equals", the co-mentor is the backup.
pt_br: O mentor é o principal ponto de contato ou o "primeiro entre os iguais", o co-mentor é o backup.

source: Some reprobate, whose name shall be withheld, made the https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html[first recorded co-mentor commit]. Similar co-mentor commits have also been spotted in the src tree. Does this make it right? Does this make it wrong? It seems to be part of the evolution of how things are done.
pt_br: Algumas pessoas, cujo nome será retido, fizeram o registro do https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html[primeiro commit de um co-mentor]. Commits similares de co-mentors também foram vistos na árvore src. Será que isso o torna correto? Será que isto o torna errado? Parece fazer parte da evolução de como as coisas são feitas.

source: We expect mentees to be prepared for constructive criticism from the community. There's still a lot of "lore" that is not written down. Responding well to constructive criticism is what we hope we are selecting for by first reviewing their existing contributions on IRC and mailing lists.
pt_br: Esperamos que os mentees estejam preparados para críticas construtivas da comunidade. Ainda há muito "conhecimento" que não está escrito. Responder bem à uma crítica construtiva é o que esperamos estar selecionando, primeiro revisando suas contribuições existentes no IRC e nas listas de discussão.

source: We warn mentees that some of the criticism they receive may be less "constructive" than others, (whether through language communication problems, or excessive nit-picking), and that dealing with this gracefully is just part of being in a large community. In case of specific problems with specific people, or any questions, we hope that they will approach a portmgr member on IRC or by email.
pt_br: Alertamos os mentees que algumas das críticas que eles receberão podem ser menos "construtivas" do que outras, (seja através de problemas de comunicação de linguagem, ou da procura excessiva por erros pequenos ou sem importância), e que lidar com isso com tranquilidade é apenas parte de estar em uma grande comunidade. Em caso de problemas específicos com pessoas específicas, ou quaisquer dúvidas, esperamos que eles abordem um membro do portmgr no IRC ou por e-mail.
