Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/porting-samplem/_index.po
Languages: ru

source: A sample Makefile that can be used to create a new FreeBSD Port
ru: Образец Makefile, который можно использовать для создания нового порта FreeBSD

source: Chapter 14. A Sample Makefile
ru: Глава 14. Примерный Makefile

source: A Sample Makefile
ru: Примерный Makefile

source: Here is a sample [.filename]#Makefile# that can be used to create a new port. Make sure to remove all the extra comments (ones between brackets).
ru: Вот примерный [.filename]#Makefile#, который можно использовать при создании нового порта. Обязательно удалите все дополнительные комментарии (те, которые в скобках).

source: The format shown is the recommended one for ordering variables, empty lines between sections, and so on. This format is designed so that the most important information is easy to locate. We recommend using crossref:quick-porting[porting-portlint,portlint] to check the [.filename]#Makefile#.
ru: Вам рекомендуется следовать этому формату (соблюдая порядок следования переменных, пустые строки между разделами, и так далее). Этот формат разработан для того, чтобы важная информация была легко найдена. Мы рекомендуем вам воспользоваться утилитой crossref:quick-porting[porting-portlint,portlint] для проверки файла [.filename]#Makefile#.

source: [section to describe the port itself and the master site - PORTNAME and PORTVERSION or the DISTVERSION* variables are always first, followed by CATEGORIES, and then MASTER_SITES, which can be followed by MASTER_SITE_SUBDIR. PKGNAMEPREFIX and PKGNAMESUFFIX, if needed, will be after that. Then comes DISTNAME, EXTRACT_SUFX and/or DISTFILES, and then EXTRACT_ONLY, as necessary.] PORTNAME= xdvi DISTVERSION= 18.2 CATEGORIES= print [do not forget the trailing slash ("/")! if not using MASTER_SITE_* macros] MASTER_SITES= ${MASTER_SITE_XCONTRIB} MASTER_SITE_SUBDIR= applications PKGNAMEPREFIX= ja- DISTNAME= xdvi-pl18 [set this if the source is not in the standard ".tar.gz" form] EXTRACT_SUFX= .tar.Z
ru: [section to describe the port itself and the master site - PORTNAME and PORTVERSION or the DISTVERSION* variables are always first, followed by CATEGORIES, and then MASTER_SITES, which can be followed by MASTER_SITE_SUBDIR. PKGNAMEPREFIX and PKGNAMESUFFIX, if needed, will be after that. Then comes DISTNAME, EXTRACT_SUFX and/or DISTFILES, and then EXTRACT_ONLY, as necessary.] PORTNAME= xdvi DISTVERSION= 18.2 CATEGORIES= print [не забывайте про завершающую косую черту (\"/\")! если вы не используете макросы MASTER_SITE_*] MASTER_SITES= ${MASTER_SITE_XCONTRIB} MASTER_SITE_SUBDIR= applications PKGNAMEPREFIX= ja- DISTNAME= xdvi-pl18 [задайте это, если исходный код поставляется не в виде стандартного файла \".tar.gz\"] EXTRACT_SUFX= .tar.Z

source: [section for distributed patches -- can be empty] PATCH_SITES= ftp://ftp.sra.co.jp/pub/X11/japanese/ PATCHFILES= xdvi-18.patch1.gz xdvi-18.patch2.gz [If the distributed patches were not made relative to ${WRKSRC}, this may need to be tweaked] PATCH_DIST_STRIP= -p1
ru: [секция патчей -- может быть пустой] PATCH_SITES= ftp://ftp.sra.co.jp/pub/X11/japanese/ PATCHFILES= xdvi-18.patch1.gz xdvi-18.patch2.gz [Если распространяемые патчи не были созданы относительно ${WRKSRC}, возможно, это потребуется исправить вручную] PATCH_DIST_STRIP= -p1

source: [maintainer; *mandatory*! This is the person who is volunteering to handle port updates, build breakages, and to whom a users can direct questions and bug reports. To keep the quality of the Ports Collection as high as possible, we do not accept new ports that are assigned to "ports@FreeBSD.org".] MAINTAINER= asami@FreeBSD.org COMMENT= DVI Previewer for the X Window System WWW= http://xdvi.sourceforge.net/
ru: [сопровождающий; *обязательное поле*! Это человек, который добровольно занимается обновлениями порта и неисправностямипри построении, и которому пользователь может направлять вопросы и сообщения об ошибках. Для сохранения как можно более высокого качества Коллекции Портов мы больше не принимаем новые порты, назначенные на \"ports@FreeBSD.org\".] MAINTAINER= asami@FreeBSD.org COMMENT= DVI Previewer for the X Window System WWW= http://xdvi.sourceforge.net/

source: [license -- should not be empty] LICENSE= BSD2CLAUSE LICENSE_FILE= ${WRKSRC}/LICENSE
ru: [лицензия -- не следует оставлять пустым] LICENSE= BSD2CLAUSE LICENSE_FILE= ${WRKSRC}/LICENSE

source: [dependencies -- can be empty] RUN_DEPENDS= gs:print/ghostscript
ru: [зависимости -- могут быть пустыми] RUN_DEPENDS= gs:print/ghostscript

source: [If it requires GNU make, not /usr/bin/make, to build...] USES= gmake [If it is an X application and requires "xmkmf -a" to be run...] USES= imake
ru: [Если для сборки требуется GNU make, а не /usr/bin/make...] USES= gmake [Если это приложение для X и требует выполнения команды "xmkmf -a"...] USES= imake

source: [this section is for other standard bsd.port.mk variables that do not] belong to any of the above] [If it asks questions during configure, build, install...] IS_INTERACTIVE= yes [If it extracts to a directory other than ${DISTNAME}...] WRKSRC= ${WRKDIR}/xdvi-new [If it requires a "configure" script generated by GNU autoconf to be run] GNU_CONFIGURE= yes [et cetera.]
ru: [Этот раздел предназначен для прочих стандартных переменных bsd.port.mk, не относящихся к указанным выше категориям] [Если программа задаёт вопросы во время настройки (configure), сборки (build) или установки (install)...] IS_INTERACTIVE= yes [Если распаковка происходит в каталог, отличных от ${DISTNAME}...] WRKSRC= ${WRKDIR}/xdvi-new [Если требуется выполнение сценария "configure", сгенерированного GNU autoconf.] GNU_CONFIGURE= yes [и так далее.]

source: [If it requires options, this section is for options] OPTIONS_DEFINE= DOCS EXAMPLES FOO OPTIONS_DEFAULT= FOO [If options will change the files in plist] OPTIONS_SUB=yes
ru: [Если для сборки требуются параметры, этот раздел предназначен для их настройки] OPTIONS_DEFINE= DOCS EXAMPLES FOO OPTIONS_DEFAULT= FOO [Если параметры влияют на список файлов в plist] OPTIONS_SUB=yes

source: [non-standard variables to be used in the rules below] MY_FAVORITE_RESPONSE= "yeah, right"
ru: [в правилах ниже используются нестандартные переменные] MY_FAVORITE_RESPONSE= "yeah, right"

source: [then the special rules, in the order they are called] pre-fetch: i go fetch something, yeah
ru: [теперь специальные правила, в порядке их вызова] pre-fetch: я что-то выкачиваю, точно

source: post-patch: i need to do something after patch, great
ru: post-patch: мне кое-что сделать после применения патча, великолепно

source: pre-install: and then some more stuff before installing, wow
ru: pre-install: и потом еще кое-что перед установкой, ого

source: [and then the epilogue]
ru: [и, наконец, эпилог]
