Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/introduction/_index.po
Languages: es, fa, ko, pt_br

source: Introduction to the FreeBSD Developers Handbook
fa: پیش درآمدی بر کتاب راهنمای توسعه‌دهندگان FreeBSD
ko: FreeBSD 개발자 안내서 서문

source: Chapter 1. Introduction
fa: فصل ۱. پیش درآمد
ko: 1장. 소개

source: Introduction
es: Introducción
fa: پیش درآمد
ko: 소개
pt_br: Introdução

source: Developing on FreeBSD
es: Desarrollando en FreeBSD
fa: توسعه بر روی FreeBSD
ko: FreeBSD 개발하기
pt_br: Desenvolvendo no FreeBSD

source: So here we are. System all installed and you are ready to start programming. But where to start? What does FreeBSD provide? What can it do for me, as a programmer?
fa: بسیار خوب، سرانجام اینجا هستیم. سامانه کامل نصب شده است و شما برای شروع برنامه‌نویسی آماده هستید. اما از کجا باید شروع کرد؟ FreeBSD چه چیزهایی ارائه می‌دهد؟ چه می‌تواند برای من برنامه‌نویس انجام دهد؟
ko: 여기까지 왔습니다. 시스템이 모두 설치되었고 프로그래밍을 시작할 준비가 되었습니다. 하지만 어디서부터 시작해야 할까요? FreeBSD는 무엇을 제공하나요? 프로그래머인 제가 무엇을 할 수 있을까요?

source: These are some questions which this chapter tries to answer. Of course, programming has different levels of proficiency like any other trade. For some it is a hobby, for others it is their profession. The information in this chapter might be aimed toward the beginning programmer; indeed, it could serve useful for the programmer unfamiliar with the FreeBSD platform.
fa: اینها سؤالاتی‌اند که این فصل در پاسخ به آنان می‌کوشد. البته، برنامه‌نویسی نیز مانند هر پیشه‌ای سطح مهارت‌های مختلفی دارد. برای برخی این تفریح است، و برای برخی دیگر حرفهٔ ایشان. اطلاعات موجود در این بخش ممکن است برای برنامه‌نویسان تازه‌وارد باشد؛ در واقع، می‌تواند برای برنامه‌نویسان ناآشنا با بستر FreeBSD مفید باشد.
ko: 이 장에서는 이러한 질문에 답하고자 합니다. 물론 프로그래밍도 다른 직업과 마찬가지로 숙련도에 따라 수준이 다릅니다. 어떤 이에게는 취미로, 어떤 이에게는 직업으로 프로그래밍을 합니다. 이 장의 정보는 초보 프로그래머를 대상으로 하지만, 실제로는 FreeBSD 플랫폼에 익숙하지 않은 프로그래머에게도 유용할 수 있습니다.

source: The BSD Vision
es: La visión de BSD
fa: نگرش BSD
ko: BSD 비전
pt_br: A Visão BSD

source: To produce the best UNIX(R) like operating system package possible, with due respect to the original software tools ideology as well as usability, performance and stability.
fa: تولید بهترین بستهٔ سامانهٔ عاملِ شبه UNIX(R)، با توجه به ایدئولوژی ابزارهای نرم‌افزاری اصلی بعلاوهٔ کاربردپذیری، عملکرد و پایداری.
ko: 사용성, 성능, 안정성은 물론 소프트웨어 도구의 원래 이념을 존중하면서 가능한 최고의 UNIX(R) 계열 운영 체제 패키지를 만들기 위해 노력합니다.

source: Architectural Guidelines
es: Directrices arquitectónicas
fa: رهنمون‌های وابسته به معماری
ko: 아키텍처 가이드라인
pt_br: Diretrizes de Arquitetura

source: Our ideology can be described by the following guidelines
es: Nuestra ideología se puede describir mediante las siguientes pautas
fa: ایدئولوژی ما می‌تواند در رهنمون‌های زیر تشریح شود
ko: 우리의 이념은 다음 가이드라인으로 설명할 수 있습니다
pt_br: Nossa ideologia pode ser descrita pelas seguintes diretrizes

source: Do not add new functionality unless an implementor cannot complete a real application without it.
es: No agregue nueva funcionalidad a menos que un implementador no pueda completar una aplicación real sin ella.
fa: عملکرد جدیدی اضافه نکنید مگر راه‌اندازی‌ای نتواند بدون آن برنامه‌ای را تکمیل کند.
ko: 구현자가 해당 기능 없이는 실제 애플리케이션을 완성할 수 없다면 새로운 기능을 추가하지 마세요.
pt_br: Não adicione novas funcionalidades, a menos que um implementador não possa completar um aplicativo real sem ele.

source: It is as important to decide what a system is not as to decide what it is. Do not serve all the world's needs; rather, make the system extensible so that additional needs can be met in an upwardly compatible fashion.
es: Es tan importante decidir qué no es un sistema como decidir qué es. No atienda todas las necesidades del mundo; más bien, hacer que el sistema sea extensible para que las necesidades adicionales puedan satisfacerse de una manera compatible hacia arriba.
fa: همان اندازه که تصمیم گرفتن برای چه چیزی بودن یک سامانه مهم است تصمیم گرفتن برای چه چیزی نبودن آن حائز اهمیت است. تمام نیازهای دنیا را تامین نکنید؛ در عوض، سامانه‌ای منعطف تولید کنید که نیازهای اضافی بتوانند در مسیری همانا سازگار برآورده شوند.
ko: 시스템이 무엇인지 결정하는 것만큼이나 시스템이 아닌 것을 결정하는 것도 중요합니다. 세상의 모든 필요를 충족시키지 말고, 상향식 호환성을 통해 추가적인 필요를 충족시킬 수 있도록 시스템을 확장 가능하게 만들어야 합니다.
pt_br: É tão importante decidir o que um sistema não é quanto decidir o que é. Não atenda a todas as necessidades do mundo; em vez disso, torne o sistema extensível para que as necessidades adicionais possam ser atendidas de maneira compatível sua ascensão.

source: The only thing worse than generalizing from one example is generalizing from no examples at all.
es: Lo único peor que generalizar a partir de un ejemplo es generalizar a partir de ningún ejemplo.
fa: تنها تعمیم عاری از هر مثال از تعمیم تنها با یک مثال بدتر است.
ko: 한 가지 예로 일반화하는 것보다 더 나쁜 것은 전혀 예가 없는 상태에서 일반화하는 것입니다.
pt_br: A única coisa pior do que generalizar a partir de um exemplo é generalizar a partir de nenhum exemplo.

source: If a problem is not completely understood, it is probably best to provide no solution at all.
es: Si un problema no se comprende completamente, probablemente sea mejor no proporcionar ninguna solución.
fa: اگر مشکلی به‌صورت کامل درک نشد، همان بهتر است برایش هیچ راهکاری ارائه نشود.
ko: 문제가 완전히 이해되지 않는다면 해결책을 전혀 제공하지 않는 것이 가장 좋습니다.
pt_br: Se um problema não for completamente compreendido, provavelmente é melhor não fornecer nenhuma solução.

source: If you can get 90 percent of the desired effect for 10 percent of the work, use the simpler solution.
es: Si puede obtener el 90 por ciento del efecto deseado para el 10 por ciento del trabajo, use la solución más simple.
fa: اگر برای ۱۰ درصد کار می‌توانید ۹۰ درصد اثر مطلوب بدست آورید، از راهکاری ساده‌تر استفاده کنید.
ko: 10%의 작업으로 원하는 효과의 90%를 얻을 수 있다면 더 간단한 솔루션을 사용하세요.
pt_br: Se você conseguir 90% do efeito desejado em 10% do trabalho, use a solução mais simples.

source: Isolate complexity as much as possible.
es: Aísle la complejidad tanto como sea posible.
fa: تا آنجا که بشود از پیچیدگی دوری کنید.
ko: 복잡성을 최대한 분리하세요.
pt_br: Isole a complexidade tanto quanto possível.

source: Provide mechanism, rather than policy. In particular, place user interface policy in the client's hands.
es: Proporcionar un mecanismo, en lugar de una política. En particular, ponga la política de interfaz de usuario en manos del cliente.
fa: ساز و کار ارائه دهید، نه سیاست. به‌طور خاص، سیاست رابط کاربری را به دستان کارخواه بسپارید.
ko: 정책보다는 메커니즘을 제공하세요. 특히 사용자 인터페이스 정책을 클라이언트의 손에 맡기세요.
pt_br: Forneça mecanismo, em vez de política. Em particular, coloque a diretiva de interface do usuário nas mãos do cliente.

source: From Scheifler & Gettys: "X Window System"
fa: از Scheifler و Gettys: "سامانهٔ پنجرهٔ X"
ko: Scheifler & Gettys에서 제공: "X 윈도우 시스템"

source: The Layout of /usr/src
fa: طرح‌بندی /usr/src
ko: /usr/src의 레이아웃

source: The complete source code for FreeBSD is available from our link:https://cgit.freebsd.org/src/[public Git repository]. The source code is normally installed in [.filename]#/usr/src#. The layout of the source tree is described by the top-level link:https://cgit.freebsd.org/src/tree/README.md[README.md] file.
ko: FreeBSD의 전체 소스 코드는 다음 링크에서 확인할 수 있습니다: link:https://cgit.freebsd.org/src/[공개 Git 저장소]. 소스 코드는 일반적으로 [.filename]#/usr/src#에 설치됩니다. 소스 트리의 레이아웃은 최상위 링크 link:https://cgit.freebsd.org/src/tree/README.md[README.md] 파일에 설명되어 있습니다.
