Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/writing-style/_index.po
Languages: it_it

source: Writing Style and some conventions used in the FreeBSD Documentation Project
it_it: Stile ed alcune convenzioni usate nel FreeBSD Documentation Project

source: Chapter 11. Writing Style
it_it: Capitolo 11. Stile

source: Writing Style
it_it: Stile

source: Tips
it_it: Suggerimenti

source: Technical documentation can be improved by consistent use of several principles. Most of these can be classified into three goals: _be clear_, _be complete_, and _be concise_. These goals can conflict with each other. Good writing consists of a balance between them.
it_it: La documentazione tecnica può essere migliorata seguendo coerentemente alcuni principi. La maggior parte di essi possono essere classificati secondo tre scopi: _essere chiari_, _essere completi_ e _essere concisi. Questi scopi possono andare l'uno contro l'altro. La buona scrittura richiede un equilibrio tra essi.

source: Be Clear
it_it: Essere chiari

source: Clarity is extremely important. The reader may be a novice, or reading the document in a second language. Strive for simple, uncomplicated text that clearly explains the concepts.
it_it: La chiarezza è estremamente importante. Il lettore potrebbe essere un principiante o leggere il documento in una lingua che non è una sua lingua madre. Occorre impegnarsi a scrivere un testo semplice, senza complicazioni e che spieghi chiaramente i concetti.

source: Avoid flowery or embellished speech, jokes, or colloquial expressions. Write as simply and clearly as possible. Simple text is easier to understand and translate.
it_it: Bisogna evitare virtuosismi o abbellimenti, battute ed espressioni colloquiali, scrivere quanto più semplicemente e chiaramente possibile. Un testo semplice è più facile da capire e tradurre.

source: Keep explanations as short, simple, and clear as possible. Avoid empty phrases like "in order to", which usually just means "to". Avoid potentially patronizing words like "basically". Avoid Latin terms like "i.e.," or "cf.", which may be unknown outside of academic or scientific groups.
it_it: Si mantengano le spiegazioni quanto più corte, semplici e chiare possibile. Si evitino espressioni vuote quali "al fine di", che di solito significano soltanto "per". Si evitino parole che possano umiliare il lettore come "elementare". Si evitino termini latini come "i.e." o "cf.", che potrebbero essere sconosciuti al di fuori da ambienti accademici o scientifici.

source: Write in a formal style. Avoid addressing the reader as "you". For example, say "copy the file to [.filename]#/tmp#" rather than "you can copy the file to [.filename]#/tmp#".
it_it: Si scriva in uno stile formale. Si eviti di rivolgersi direttamente al lettore in seconda persona. Per esempio, si scriva "copiare il file in [.filename]#/tmp#" anziché "puoi copiare il file in [.filename]#/tmp#".

source: Give clear, correct, _tested_ examples. A trivial example is better than no example. A good example is better yet. Do not give bad examples, identifiable by apologies or sentences like "but really it should never be done that way". Bad examples are worse than no examples. Give good examples, because _even when warned not to use the example as shown_, the reader will usually just use the example as shown.
it_it: Si forniscano esempi chiari, corretti e _verificati_. È meglio un esempio banale piuttosto che nessun esempio. Un buon esempio è ancora meglio. Non si diano cattivi esempi, identificabili tramite scuse o espressioni quali "ma in realtà non si dovrebbe fare mai in questo modo". È peggio un esempio cattivo piuttosto che nessun esempio. Si diano buoni esempi, perché, _anche quando il lettore viene scoraggiato dal copiare l'esempio direttamente_, spesso egli copia comunque l'esempio direttamente.

source: Avoid _weasel words_ like "should", "might", "try", or "could". These words imply that the speaker is unsure of the facts, and create doubt in the reader.
it_it: Si evitino _parole vaghe_ quali "dovrebbe", "potrebbe" o "si provi". Queste parole suggeriscono che l'autore non sia sicuro dei fatti e genera dubbi presso il lettore.

source: Similarly, give instructions as imperative commands: not "you should do this", but merely "do this".
it_it: Per la stessa ragione, si forniscano istruzioni come comandi: non "dovresti fare così", ma direttamente "fare così".

source: Be Complete
it_it: Essere completi

source: Do not make assumptions about the reader's abilities or skill level. Tell them what they need to know. Give links to other documents to provide background information without having to recreate it. Put yourself in the reader's place, anticipate the questions they will ask, and answer them.
it_it: Non si formulino supposizioni sulle capacità o il livello del lettore. Si scriva ciò che gli serve sapere. Per insegnare i prerequisti si riportino collegamenti ad altri documenti senza riscriverli. Ci si cali nei panni del lettore, si prevedano le domande che egli porrebbe e si risponda.

source: Be Concise
it_it: Essere concisi

source: While features should be documented completely, sometimes there is so much information that the reader cannot easily find the specific detail needed. The balance between being complete and being concise is a challenge. One approach is to have an introduction, then a "quick start" section that describes the most common situation, followed by an in-depth reference section.
it_it: Ogni cosa dovrebbe essere documentata in maniera completa, ma a volte le informazioni sono così tante che il lettore non può trovare facilmente il dettaglio specifico che gli serve. Trovare l'equilibrio tra essere completi ed essere concisi è una sfida. Un sistema è scrivere un'introduzione, poi una sezione "guida veloce" che descrive le situazioni più comuni, seguita da una sezione approfondita per riferimento.

source: Guidelines
it_it: Linee guida

source: To promote consistency between the myriad authors of the FreeBSD documentation, some guidelines have been drawn up for authors to follow.
it_it: Per assicurare coerenza tra la miriade di autori della documentazione di FreeBSD, sono state tracciate alcune linee guida per loro.

source: Use American English Spelling
it_it: Usare la grafia americana per l'inglese

source: There are several variants of English, with different spellings for the same word. Where spellings differ, use the American English variant. "color", not "colour", "rationalize", not "rationalise", and so on.
it_it: Ci sono molte varianti di Inglese, con grafie diverse per la stessa parola. Quando le grafie sono diverse, si usi la variante americana. "color", non "colour", "rationalize", non "rationalise", e così via.

source: The use of British English may be accepted in the case of a contributed article, however the spelling must be consistent within the whole document. The other documents such as books, web site, manual pages, etc. will have to use American English.
it_it: L'uso dell'inglese britannico può essere accettato nel caso di articoli con contributi esterni, ma la grafia deve essere coerente nell'intero documento. Gli altri documenti quali i libri, il sito internet, le pagine di manuale, ecc. dovranno usare l'inglese americano.

source: Do not use contractions
it_it: Non usare contrazioni

source: Do not use contractions. Always spell the phrase out in full. "Don't use contractions" is wrong.
it_it: Non usare contrazioni. Scrivere sempre le parole per esteso. "Don't use contractions" è sbagliato.

source: Avoiding contractions makes for a more formal tone, is more precise, and is slightly easier for translators.
it_it: Evitare contrazioni rende il tono più formale, più preciso ed è leggermente più semplice per i traduttori.

source: Use the serial comma
it_it: Usare la virgola seriale in inglese

source: In a list of items within a paragraph, separate each item from the others with a comma. Separate the last item from the others with a comma and the word "and".
it_it: In un elenco di oggetti in un paragrafo, si separino gli elementi tra loro con la virgola. Si separi l'ultimo elemento dagli altri con una virgola e la parola "and" nei testi in inglese. In italiano, si separi l'ultimo elemento dagli altri soltanto con la parola "e", senza aggiungere anche la virgola.

source: For example:
it_it: Per esempio:

source: Is this a list of three items, "one", "two", and "three", or a list of two items, "one" and "two and three"?
it_it: Si tratta di un elenco di tre elementi, "one", "two" e "three" o di un elenco di due elementi, "one" e "two and three"?

source: It is better to be explicit and include a serial comma:
it_it: È meglio essere espliciti e includere una virgola seriale:

source: Avoid redundant phrases
it_it: Evitare espressioni ridondanti

source: Do not use redundant phrases. In particular, "the command", "the file", and "man command" are often redundant.
it_it: Non usare espressioni ridondanti. In particolare, "il comando", "il file" e "man comando" sono spesso ridondanti.

source: For example, commands:
it_it: Per esempio, comandi:

source: Wrong: Use the `git` command to update sources.
it_it: Sbagliato: Usare il comando `git` per aggiornare i sorgenti.

source: Right: Use `git` to update sources.
it_it: Giusto: Usare `git` per aggiornare i sorgenti.

source: Filenames:
it_it: Nomi di file:

source: Wrong: ... in the filename [.filename]#/etc/rc.local#...
it_it: Sbagliato: ... nel nome di file [.filename]#/etc/rc.local#...

source: Right: ... in [.filename]#/etc/rc.local#...
it_it: Giusto: ... in [.filename]#/etc/rc.local#...

source: Manual page references (the second example uses `citerefentry` with the man:csh[1] entity):.
it_it: Riferimenti a pagine di manuale (il secondo esempio usa `citerefentry` con l'entità man:csh[1]):

source: Wrong: See `man csh` for more information.
it_it: Sbagliato: Si veda `man csh` per maggiori informazioni.

source: Right: See man:csh[1].
it_it: Giusto: Si veda man:csh[1].

source: For more information about writing style, see http://www.bartleby.com/141/[Elements of Style], by William Strunk.
it_it: Per maggiori informazioni su stili di scrittura, si veda http://www.bartleby.com/141/[Elements of Style], di William Strunk.

source: Style Guide
it_it: Guida sullo Stile

source: To keep the source for the documentation consistent when many different people are editing it, please follow these style conventions.
it_it: Per mantenere coerenti i sorgenti della documentazione su cui lavorano molte persone, si prega di seguire le seguenti convenzioni stilistiche.

source: One sentence per line
it_it: Una frase per riga

source: Use Semantic Line Breaks in the documentation, a technique called "one sentence per line". The idea of this technique is to help the users to write and read documentation. To get more information about this technique read the link:https://sembr.org/[Semantic Line Breaks] page.
it_it: Si vada a capo nella documentazione dopo ogni frase, una tecnica chiamata "una frase per riga". L'idea di questa tecnica è aiutare gli utenti a scrivere le leggere la documentazione. Per maggiori informazioni riguardo a questa tecnica, si legga la pagina link:https://sembr.org/[Semantic Line Breaks].

source: This is an example which does not use "one sentence per line".
it_it: Questo è un esempio che non implementa "una frase per riga".

source: All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.
it_it: Tutti gli esseri umani nascono liberi ed eguali in dignità e diritti. Essi sono dotati di ragione e di coscienza e devono agire gli uni verso gli altri in spirito di fratellanza.

source: And this is an example which uses the technique.
it_it: E questo è un esempio che implementa questa tecnica.

source: All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.
it_it: Tutti gli esseri umani nascono liberi ed eguali in dignità e diritti. Essi sono dotati di ragione e di coscienza e devono agire gli uni verso gli altri in spirito di fratellanza.

source: Acronyms
it_it: Acronimi

source: Acronyms should be defined the first time they appear in a document, as in: "Network Time Protocol (NTP)". After the acronym has been defined, use the acronym alone unless it makes more sense contextually to use the whole term. Acronyms are usually defined only once per chapter or per document.
it_it: Gli acronimi devono essere definiti la prima volta che essi appaiono in un documento, come in: "Network Time Protocol (NTP)". Dopo che l'acronimo è stato definito, si usi soltanto l'acronimo a meno che abbia più senso in un particolare contesto usare la forma estesa. Gli acronimi sono solitamente definiti solo una volta per capitolo o documento.

source: All acronyms should be enclosed using the ` character.
it_it: Tutti gli acronimi devono essere racchiusi tra caratteri `.

source: Special Character List
it_it: Elenco di Caratteri Speciali

source: This list of special characters shows the correct syntax and the output when used in FreeBSD documentation. If a character is not on this list, ask about it on the {freebsd-doc}.
it_it: Questo elenco di caratteri speciali illustra quali sono la sintassi corretta e l'output generato nella documentazione di FreeBSD. Se un carattere non è in questa lista, ci si rivolga alla {freebsd-doc}.

source: Name
it_it: Nome

source: Syntax
it_it: Sintassi

source: Rendered
it_it: Output generato

source: Registered
it_it: Marchio registrato

source: Trademark
it_it: Marchio commerciale

source: Em dash
it_it: Lineetta

source: Ellipses
it_it: Ellissi

source: Single right arrow
it_it: Frecci destra semplice

source: Double right arrow
it_it: Freccia destra doppia

source: Single left arrow
it_it: Freccia sinistra semplice

source: Double left arrow
it_it: Freccia sinistra doppia

source: Linting with Vale
it_it: Linting con Vale

source: To maintain clarity and consistency across all documentation and website pages, link:https://vale.sh[Vale] styles have been introduced in the documentation tree. link:https://vale.sh[Vale] is a powerful linter for writing customized rules and can be used in multiple scenarios. At this moment link:https://vale.sh[Vale] can be used as a command line tool, for CI/CD pipeline and integrated into editor of choice.
it_it: Per mantenere chiarezza e coerenze all'interno di tutta la documentazione e tutte pagine internet, sono stati introdotti stili link:https://vale.sh[Vale] nelle directory della documentazione. link:https://vale.sh[Vale] è un potente linter capace si seguire regole personalizzate e può essere usato in contesti diversi. Al momento link:https://vale.sh[Vale] può essere usato come strumento da riga di comando, in una pipeline CI/CD e integrato nel proprio editor preferito.

source: The following table describes the current rule names and respective severity.
it_it: La tabella seguente descrive i nomi delle regole attuali e i rispettivi livelli di gravità.

source: Severity
it_it: Gravità

source: Current Vale Rules
it_it: Regole Vale Correnti

source: BrandTerms: Like The FreeBSD Project every major vendors and Companies have specific rules on writing their Brand Name. according to the Copyright rules of The FreeBSD Foundation *freebsd* should be written as *FreeBSD*. Similar to that care should be taken to be respective to other's brand value and write PostgreSQL, Node.js, Let's Encrypt etc. Missing brand names should be added to the [.filename]#.vale/styles/FreeBSD/BrandTerms.yml# in the `doc` repository.
it_it: BrandTerms: Come il FreeBSD Project tutte i principali fornitori e tutte le principali aziende hanno regole specifiche quando si tratta di scrivere il loro marchio. Secondo le regole di copyright di The FreeBSD Foundation *freebsd* deve essere scritto come *FreeBSD*. La stessa cura deve essere impiegata nel rispettare il valore dei marchi altrui e occorre scrivere PostgreSQL, Node.js, Let's Encrypt etc. I marchi mancanti devono essere aggiunti in [.filename]#.vale/styles/FreeBSD/BrandTerms.yml# nel repository `doc`.

source: Contractions: Contracted words should not be used. This rule avoids all contractions and suggests full words.
it_it: Contractions: Non usare forme contratte. Questa regola evita tutte le contrazioni e suggerisce forme estese.

source: Hang: `Hang` is often used to convey the meaning that the application has stopped responding. This rule proposes better wording.
it_it: Hang: La parola inglese `hang`è spesso usata per trasmettere l'idea che un'applicazione abbia smesso di rispondere. Questa regola suggerisce riformulazioni migliori.

source: Repetition: Same words are often typed twice when leaving the keyboard and rejoining the work again. This rule finds repeated words and warns the users.
it_it: Repetition: Alcune parole sono spesso digitate due volte quando si lascia la tastiera e si torna al lavoro più tardi. Questa regola trova parole ripetute e avverte gli utenti.

source: Weasel: This rule handles avoiding weasel words. The uses of weasel words is controversial so at the moment the list of words are being evaluated and the severity level is marked as warning on. In case a frequently used word is marked as weasel word it should be removed from [.filename]#.vale/styles/FreeBSD/Weasel.yml# in the `doc` repository.
it_it: Weasel: Questa regola evita parole vaghe. L'uso di parole vaghe è controverso, così al momento l'elenco delle parole è in corso di valutazione e il livello di gravità è impostato a `warning`. Nel caso una parola di uso frequente fosse segnata come parola vaga deve essere rimossa da [.filename]#.vale/styles/FreeBSD/Weasel.yml# nel repository `doc`.

source: ConsciousLanguage: This rule proposes uses of conscious languages like avoiding the words white/black/master/slave.
it_it: ConsciousLanguage: Questa regola propone l'uso di un linguaggio inclusivo evitando parole come bianco/nero/padrone/schiavo.

source: EOLSpacing: In most of the documents EOL spacing is present which is not the desirable situation.
it_it: EOLSpacing: Nella maggior parte dei documenti sono presenti spazi in fin di riga, che non sono raccomandati.

source: Hyphens: Often adverbs ending with 'ly' are being added with a hyphen which is wrong.
it_it: Hyphens: Spesso avverbi inglesi che finiscono con 'ly' vengono aggiunti con un trattino, ma ciò è sbagliato.

source: Spacing: Often double spaces are hard to catch on plain eye which is addressed here.
it_it: Spacing: Spesso i doppi spazi sono difficili da individuare ad occhio nudo, problema risolto da questa regola.

source: Spelling: At the moment there is a mix of en_US and en_UK spellings in the documentation and website. A custom dictionary from link:https://wordlist.aspell.net[Aspell] has been added which uses strictly en_US and do not accept the en_UK variant of any words. It has also an exception list to ignore the FreeBSD specific terms. At the moment the list is a basic one with minimal words just as a proof of concept but if any word is found to be correct and not available in the dictionary the word should be added to the [.filename]#.vale/styles/FreeBSD/spelling-exceptions.txt# in the `doc` repository.
it_it: Spelling: Al momento v'è un miscuglio di grafie en_US e en_UK nella documentazione e nel sito in lingua inglese. È stato aggiunto un dizionario personalizzato tratto da link:https://wordlist.aspell.net[Aspell] che usa strettamente en_US e non accetta varianti en_UK per nessuna parola. Ha anche una lista di eccezioni per ignorare termini specifici di FreeBSD. Al momento si tratta di un elenco di base con un minimo di parole usato solo come prototipo ma se viene individuata una qualche parola corretta ed essa non è disponibile nel dizionario la parola deve essere aggiunta in [.filename]#.vale/styles/FreeBSD/spelling-exceptions.txt# nel repository `doc`.

source: More rules will be introduced in the upcoming days when and where required.
it_it: Ulteriori regole verranno introdotte nei prossimi giorni e aggiunte quando necessario.

source: Using Vale
it_it: Usare Vale

source: link:https://vale.sh[Vale] can be used from command line and from within editor or IDE. package:textproc/vale[] can be installed as following:
it_it: link:https://vale.sh[Vale] può essere usato da riga di comando e all'interno di un editor o di un IDE. package:textproc/vale[] può essere installato come segue:

source: Using Vale in command line
it_it: Usare Vale con la riga di comando

source: Considering the fact that `doc` repository was cloned into [.filename]#~/doc# the following commands are required to run:
it_it: Supponendo che il repository `doc` sia stato clonato in [.filename]#~/doc# è necessario eseguire i comandi seguenti per avviare link:https://vale.sh[Vale]:

source: link:https://vale.sh[Vale] is a CPU and memory intensive program due to the nature of the application and can take a while to show any output on the screen. Better way to run the application is on specific folders or files rather than the entire `doc` repository as that is already done in the CI pipeline.
it_it: link:https://vale.sh[Vale] è un programma che consuma molta CPU e molta memoria a causa della sua stessa natura e può richiedere un po' di tempo prima di mostrare un qualche output a schermo. È meglio avviare l'applicazione su directory specifiche o su file piuttosto che sull'intero repository `doc`, visto che ciò viene già fatto nella pipeline CI.

source: Using Vale in editors
it_it: Usare Vale in un editor

source: link:https://vale.sh[Vale] works with major mainstream editors like package:editors/vim[], package:editors/emacs[], package:editors/vscode[]. At the moment the necessary configurations for package:editors/vim[] is described in crossref:editor-config[editor-config-vim, Vim]. Necessary configurations for package:editors/emacs[] is being worked on.
it_it: link:https://vale.sh[Vale] funziona con gli editor maggiormenti diffusi come package:editors/vim[], package:editors/emacs[], package:editors/vscode[]. Al momento le configurazioni necessarie per package:editors/vim[] sono descritte in crossref:editor-config[editor-config-vim, Vim]. Si sta lavorando sulle configurazioni necessarie per package:editors/emacs[].
