Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/tools/_index.po
Languages: es, it_it

source: Tools used in the FreeBSD Documentation Project
es: Herramientas utilizadas en el Proyecto de Documentación de FreeBSD.
it_it: Strumenti usati nel FreeBSD Documentation Project

source: Chapter 2. Tools
es: Capítulo 2. Herramientas
it_it: Capitolo 2. Strumenti

source: Tools
es: Herramientas
it_it: Strumenti

source: Several software tools are used to manage the FreeBSD documentation and render it to different output formats. Some of these tools are required and must be installed before working through the examples in the following chapters. Some are optional, adding capabilities or making the job of creating documentation less demanding.
es: Se utilizan varias herramientas de software para gestionar la documentación de FreeBSD y renderizarla en diferentes formatos de salida. Algunas de estas herramientas son obligatorias y deben instalarse antes de trabajar con los ejemplos de los siguientes capítulos. Otras son opcionales, añadiendo capacidades o haciendo que la tarea de crear documentación sea menos exigente.
it_it: Vengono usati molti strumenti software per gestire la documentazione di FreeBSD e generarla in diversi formati. Alcuni di questi strumenti sono necessari e devono essere installati prima di poter seguire gli esempi nei capitoli successivi. Alcuni sono facoltativi, ed aggiungono nuove funzionalità o rendono il lavoro di creazione della documentazione meno faticoso.

source: Required Tools
es: Herramientas necesarias
it_it: Strumenti necessari

source: Install `docproj` _meta-port_ as shown in crossref:overview[overview,the overview chapter] from the Ports Collection. These applications are required to do useful work with the FreeBSD documentation. Some further notes on particular components are given below.
es: Instale el _meta-port_ `docproj` como se muestra en crossref:overview[overview, el capítulo de visión general] de la Colección de Ports. Estas aplicaciones son necesarias para realizar un trabajo útil con la documentación de FreeBSD. A continuación, se ofrecen algunas notas adicionales sobre componentes particulares.
it_it: Installare il _meta-port_ `docproj` dalla Raccolta dei Port come mostrato nel crossref:overview[overview,capitolo di panoramica]. Queste applicazioni sono necessarie per svolgere un buon lavoro sull documentazione di FreeBSD. Di seguito vengono fornite alcune note aggiuntive su componenti particolari.

source: Optional Tools
es: Herramientas opcionales
it_it: Strumenti facoltativi

source: These applications are not required, but can make working on the documentation easier or add capabilities.
es: Estas aplicaciones no son necesarias, pero pueden facilitar el trabajo en la documentación o agregar capacidades.
it_it: Queste applicazioni non sono necessarie, ma possono facilitare il lavoro sulla documentazione o aggiungere funzionalità.

source: A popular editor for working with AsciiDoctor.
es: Un editor popular para trabajar con AsciiDoctor.
it_it: Un editor popolare per lavorare con AsciiDoctor.

source: Both of these editors include a special mode for editing documents. This mode includes commands to reduce the amount of typing needed, and help reduce the possibility of errors.
es: Ambos editores incluyen un modo especial para editar documentos. Este modo incluye comandos para reducir la cantidad de escritura necesaria y ayudar a disminuir la posibilidad de errores.
it_it: Entrambi questi editor includono una modalità speciale per modificare documenti. Questa modalità include comandi per ridurre la quantità di cose da digitare e aiuta a ridurre la possibilità di errori.
