Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/arch-handbook/sound/_index.po
Languages: es

source: FreeBSD Sound Subsystem
es: Subsistema de sonido de FreeBSD

source: Chapter 15. Sound Subsystem
es: Capítulo 15. Subsistema de sonido

source: Sound Subsystem
es: Subsistema de sonido

source: Introduction
es: Introducción

source: The FreeBSD sound subsystem cleanly separates generic sound handling issues from device-specific ones. This makes it easier to add support for new hardware.
es: El subsistema de sonido de FreeBSD separa limpiamente los problemas genéricos de manejo de sonido de los específicos de cada dispositivo. Esto hace más fácil añadir soporte para nuevo hardware.

source: The man:pcm[4] framework is the central piece of the sound subsystem. It mainly implements the following elements:
es: El framework man:pcm[4] es la pieza central del subsistema de sonido. Implementa principalmente los siguientes elementos:

source: A system call interface (read, write, ioctls) to digitized sound and mixer functions. The ioctl command set is compatible with the legacy _OSS_ or _Voxware_ interface, allowing common multimedia applications to be ported without modification.
es: Una interfaz de llamada al sistema (lectura, escritura, ioctls) para funciones de sonido digitalizado y mezclador. El conjunto de comandos ioctl es compatible con la interfaz _OSS_ o _Voxware_ heredada, lo que permite portar aplicaciones multimedia comunes sin modificaciones.

source: Common code for processing sound data (format conversions, virtual channels).
es: Código común para el tratamiento de datos de sonido (conversiones de formato, canales virtuales).

source: A uniform software interface to hardware-specific audio interface modules.
es: Una interfaz de software uniforme para módulos de interfaz de audio específicos del hardware.

source: Additional support for some common hardware interfaces (ac97), or shared hardware-specific code (ex: ISA DMA routines).
es: Soporte adicional para algunas interfaces de hardware comunes (ac97), o código compartido específico de hardware (ej: rutinas ISA DMA).

source: The support for specific sound cards is implemented by hardware-specific drivers, which provide channel and mixer interfaces to plug into the generic [.filename]#pcm# code.
es: La compatibilidad con tarjetas de sonido específicas se implementa mediante controladores específicos de hardware, que proporcionan interfaces de canal y mezclador para conectarse al código genérico [.filename]#pcm#.

source: In this chapter, the term [.filename]#pcm# will refer to the central, common part of the sound driver, as opposed to the hardware-specific modules.
es: En este capítulo, el término [.filename]#pcm# se referirá a la parte central y común del controlador de sonido, en contraposición a los módulos específicos del hardware.

source: The prospective driver writer will of course want to start from an existing module and use the code as the ultimate reference. But, while the sound code is nice and clean, it is also mostly devoid of comments. This document tries to give an overview of the framework interface and answer some questions that may arise while adapting the existing code.
es: El futuro escritor de controladores querrá, por supuesto, partir de un módulo existente y utilizar el código como referencia definitiva. Pero, aunque el código de sonido es agradable y limpio, también está desprovisto de comentarios. Este documento intenta dar una visión general de la interfaz del framework y responder a algunas preguntas que puedan surgir al adaptar el código existente.

source: As an alternative, or in addition to starting from a working example, you can find a commented driver template at https://people.FreeBSD.org/~cg/template.c[ https://people.FreeBSD.org/~cg/template.c]
es: Como alternativa, o además de partir de un ejemplo funcional, puede encontrar una plantilla de controlador comentada en https://people.FreeBSD.org/~cg/template.c[ https://people.FreeBSD.org/~cg/template.c]

source: Files
es: Archivos

source: All the relevant code lives in [.filename]#/usr/src/sys/dev/sound/#, except for the public ioctl interface definitions, found in [.filename]#/usr/src/sys/sys/soundcard.h#
es: Todo el código relevante se encuentra en [.filename]#/usr/src/sys/dev/sound/#, excepto las definiciones públicas de la interfaz ioctl, que se encuentran en [.filename]#/usr/src/sys/sys/soundcard.h#

source: Under [.filename]#/usr/src/sys/dev/sound/#, the [.filename]#pcm/# directory holds the central code, while the [.filename]#pci/#, [.filename]#isa/# and [.filename]#usb/# directories have the drivers for PCI and ISA boards, and for USB audio devices.
es: En [.filename]#/usr/src/sys/dev/sound/#, el directorio [.filename]#pcm/# contiene el código central, mientras que los directorios [.filename]#pci/#, [.filename]#isa/# y [.filename]#usb/# tienen los controladores para placas PCI e ISA, y para dispositivos de audio USB.

source: Probing, Attaching, etc.
es: Sondeo, fijación, etc.

source: Sound drivers probe and attach in almost the same way as any hardware driver module. You might want to look at the crossref:isa-driver[isa-driver,ISA] or crossref:pci[pci,PCI] specific sections of the handbook for more information.
es: Los controladores de sonido sondean y se conectan casi de la misma forma que cualquier módulo controlador de hardware. Es posible que desee consultar las secciones específicas crossref:isa-driver[isa-driver,ISA] o crossref:pci[pci,PCI] del manual para obtener más información.

source: However, sound drivers differ in some ways:
es: Sin embargo, los controladores de sonido difieren en algunos aspectos:

source: They declare themselves as [.filename]#pcm# class devices, with a `struct snddev_info` device private structure:
es: Se declaran como dispositivos de clase [.filename]#pcm#, con una estructura privada de dispositivo `struct snddev_info`:

source: Most sound drivers need to store additional private information about their device. A private data structure is usually allocated in the attach routine. Its address is passed to [.filename]#pcm# by the calls to `pcm_register()` and `mixer_init()`. [.filename]#pcm# later passes back this address as a parameter in calls to the sound driver interfaces.
es: La mayoría de los controladores de sonido necesitan almacenar información privada adicional sobre su dispositivo. Normalmente se asigna una estructura de datos privada en la rutina attach. Su dirección es pasada a [.filename]#pcm# por las llamadas a `pcm_register()` y `mixer_init()`. Posteriormente, [.filename]#pcm# devuelve esta dirección como parámetro en las llamadas a las interfaces del controlador de sonido.

source: The sound driver attach routine declares its general CHANNEL configuration to [.filename]#pcm# by calling `pcm_register(dev, sc, nplay, nrec)`, where `sc` is the address for the device data structure, used in further calls from [.filename]#pcm#, and `nplay` and `nrec` are the number of play and record channels.
es: La rutina attach del controlador de sonido declara su configuración general de CHANNEL a [.filename]#pcm# llamando a `pcm_register(dev, sc, nplay, nrec)`, donde `sc` es la dirección para la estructura de datos del dispositivo, utilizada en posteriores llamadas desde [.filename]#pcm#, y `nplay` y `nrec` son el número de canales de reproducción y grabación.

source: The sound driver detach routine should call `pcm_unregister()` before releasing its resources.
es: La rutina de separación del controlador de sonido debe llamar a `pcm_unregister()` antes de liberar sus recursos.

source: There are two possible methods to handle non-PnP devices:
es: Hay dos métodos posibles para manejar dispositivos no-PnP:

source: Use a `device_identify()` method (example: [.filename]#sound/isa/es1888.c#). The `device_identify()` method probes for the hardware at known addresses and, if it finds a supported device, creates a new pcm device which is then passed to probe/attach.
es: Utilice un método `device_identify()` (ejemplo: [.filename]#sound/isa/es1888.c#). El método `device_identify()` busca el hardware en direcciones conocidas y, si encuentra un dispositivo compatible, crea un nuevo dispositivo pcm que se pasa a probe/attach.

source: Use a custom kernel configuration with appropriate hints for pcm devices (example: [.filename]#sound/isa/mss.c#).
es: Utilice una configuración de kernel personalizada con las sugerencias adecuadas para los dispositivos pcm (ejemplo: [.filename]#sound/isa/mss.c#).

source: [.filename]#pcm# drivers should implement `device_suspend`, `device_resume` and `device_shutdown` routines, so that power management and module unloading function correctly.
es: [.filename]#pcm# deben implementar las rutinas `device_suspend`, `device_resume` y `device_shutdown`, para que la gestión de energía y la descarga de módulos funcionen correctamente.

source: There are two main interfaces that a sound driver will usually provide: _CHANNEL_ and either _MIXER_ or _AC97_.
es: Hay dos interfaces principales que un controlador de sonido suele proporcionar: _CHANNEL_ y _MIXER_ o _AC97_.

source: The _AC97_ interface is a very small hardware access (register read/write) interface, implemented by drivers for hardware with an AC97 codec. In this case, the actual MIXER interface is provided by the shared AC97 code in [.filename]#pcm#.
es: La interfaz _AC97_ es una interfaz muy pequeña de acceso al hardware (lectura/escritura de registros), implementada por controladores para hardware con un códec AC97. En este caso, la interfaz MIXER real es proporcionada por el código AC97 compartido en [.filename]#pcm#.

source: The CHANNEL Interface
es: La interfaz CHANNEL

source: Common Notes for Function Parameters
es: Notas comunes para los parámetros de función

source: Sound drivers usually have a private data structure to describe their device, and one structure for each play and record data channel that it supports.
es: Los controladores de sonido suelen tener una estructura de datos privada para describir su dispositivo, y una estructura para cada canal de datos de reproducción y grabación que soporta.

source: For all CHANNEL interface functions, the first parameter is an opaque pointer.
es: Para todas las funciones de la interfaz CHANNEL, el primer parámetro es un puntero opaco.

source: The second parameter is a pointer to the private channel data structure, except for `channel_init()` which has a pointer to the private device structure (and returns the channel pointer for further use by [.filename]#pcm#).
es: El segundo parámetro es un puntero a la estructura de datos privada del canal, excepto para `channel_init()` que tiene un puntero a la estructura privada del dispositivo (y devuelve el puntero del canal para su uso posterior por [.filename]#pcm#).

source: Overview of Data Transfer Operations
es: Visión general de las operaciones de transferencia de datos

source: For sound data transfers, the [.filename]#pcm# core and the sound drivers communicate through a shared memory area, described by a `struct snd_dbuf`.
es: Para las transferencias de datos de sonido, el núcleo [.filename]#pcm# y los controladores de sonido se comunican a través de un área de memoria compartida, descrita por una `struct snd_dbuf`.

source: `struct snd_dbuf` is private to [.filename]#pcm#, and sound drivers obtain values of interest by calls to accessor functions (`sndbuf_getxxx()`).
es: La `struct snd_dbuf` es privada para [.filename]#pcm#, y los controladores de sonido obtienen valores de interés mediante llamadas a funciones de acceso (`sndbuf_getxxx()`).

source: The shared memory area has a size of `sndbuf_getsize()` and is divided into fixed size blocks of `sndbuf_getblksz()` bytes.
es: El área de memoria compartida tiene un tamaño de `sndbuf_getsize()` y se divide en bloques de tamaño fijo de `sndbuf_getblksz()` bytes.

source: When playing, the general transfer mechanism is as follows (reverse the idea for recording):
es: Al reproducir, el mecanismo general de transferencia es el siguiente (invierta la idea para grabar):

source: The sound driver then arranges to repeatedly transfer the whole memory area (`sndbuf_getbuf()`, `sndbuf_getsize()`) to the device, in blocks of `sndbuf_getblksz()` bytes. It calls back the `chn_intr()`[.filename]#pcm# function for each transferred block (this will typically happen at interrupt time).
es: El controlador de sonido se encarga entonces de transferir repetidamente toda el área de memoria (`sndbuf_getbuf()`, `sndbuf_getsize()`) al dispositivo, en bloques de `sndbuf_getblksz()` bytes. Devuelve la llamada a la función `chn_intr()`[.filename]#pcm# para cada bloque transferido (esto ocurrirá típicamente en tiempo de interrupción).

source: `chn_intr()` arranges to copy new data to the area that was transferred to the device (now free), and make appropriate updates to the `snd_dbuf` structure.
es: `chn_intr()` se encarga de copiar los nuevos datos al área que fue transferida al dispositivo (ahora libre), y realiza las actualizaciones oportunas en la estructura `snd_dbuf`.

source: `b` is the address for the channel `struct snd_dbuf`. It should be initialized in the function by calling `sndbuf_alloc()`. The buffer size to use is normally a small multiple of the 'typical' unit transfer size for your device.`c` is the [.filename]#pcm# channel control structure pointer. This is an opaque object. The function should store it in the local channel structure, to be used in later calls to [.filename]#pcm# (ie: `chn_intr(c)`).`dir` indicates the channel direction (`PCMDIR_PLAY` or `PCMDIR_REC`).
es: `b` es la dirección del canal `struct snd_dbuf`. Debe inicializarse en la función llamando a `sndbuf_alloc()`. El tamaño del buffer a utilizar es normalmente un pequeño múltiplo del tamaño de transferencia de la unidad 'típica' para su dispositivo.`c` es el puntero de la estructura de control del canal [.filename]#pcm#. Se trata de un objeto opaco. La función debe almacenarlo en la estructura local del canal, para usarlo en llamadas posteriores a [.filename]#pcm# (es decir: `chn_intr(c)`).`dir` indica la dirección del canal (`PCMDIR_PLAY` o `PCMDIR_REC`).

source: The function should return a pointer to the private area used to control this channel. This will be passed as a parameter to other channel interface calls.
es: La función debe devolver un puntero al área privada utilizada para controlar este canal. Este se pasará como parámetro a otras llamadas a la interfaz del canal.

source: `xxxchannel_setformat()` should set up the hardware for the specified channel for the specified sound format.
es: `xxxchannel_setformat()` debe configurar el hardware del canal especificado para el formato de sonido especificado.

source: `format` is specified as an `AFMT_XXX value` ([.filename]#soundcard.h#).
es: `format` se especifica como un `AFMT_XXX value` ([.filename]#soundcard.h#).

source: `xxxchannel_setspeed()` sets up the channel hardware for the specified sampling speed, and returns the possibly adjusted speed.
es: `xxxchannel_setspeed()` configura el hardware del canal para la velocidad de muestreo especificada, y devuelve la velocidad posiblemente ajustada.

source: `xxxchannel_setblocksize()` sets the block size, which is the size of unit transactions between [.filename]#pcm# and the sound driver, and between the sound driver and the device. Typically, this would be the number of bytes transferred before an interrupt occurs. During a transfer, the sound driver should call [.filename]#pcm#'s `chn_intr()` every time this size has been transferred.
es: `xxxchannel_setblocksize()` establece el tamaño del bloque, que es el tamaño de las transacciones unitarias entre [.filename]#pcm# y el controlador de sonido, y entre el controlador de sonido y el dispositivo. Típicamente, este sería el número de bytes transferidos antes de que ocurra una interrupción. Durante una transferencia, el controlador de sonido debe llamar a `chn_intr()` de [.filename]#pcm# cada vez que este tamaño haya sido transferido.

source: Most sound drivers only take note of the block size here, to be used when an actual transfer will be started.
es: La mayoría de los controladores de sonido sólo toman nota del tamaño del bloque aquí, que se utilizará cuando se inicie una transferencia real.

source: The function returns the possibly adjusted block size. In case the block size is indeed changed, `sndbuf_resize()` should be called to adjust the buffer.
es: La función devuelve el tamaño de bloque posiblemente ajustado. En caso de que el tamaño del bloque haya cambiado, se debe llamar a `sndbuf_resize()` para ajustar el búfer.

source: `xxxchannel_trigger()` is called by [.filename]#pcm# to control data transfer operations in the driver.
es: `xxxchannel_trigger()` es llamada por [.filename]#pcm# para controlar las operaciones de transferencia de datos en el controlador.

source: `go` defines the action for the current call. The possible values are:
es: `go` define la acción para la llamada actual. Los valores posibles son:

source: If the driver uses ISA DMA, `sndbuf_isadma()` should be called before performing actions on the device, and will take care of the DMA chip side of things.
es: Si el controlador utiliza ISA DMA, se debe llamar a `sndbuf_isadma()` antes de realizar acciones en el dispositivo, y se encargará de la parte del chip DMA.

source: `xxxchannel_getptr()` returns the current offset in the transfer buffer. This will typically be called by `chn_intr()`, and this is how [.filename]#pcm# knows where it can transfer new data.
es: `xxxchannel_getptr()` devuelve el desplazamiento actual en el buffer de transferencia. Típicamente será llamada por `chn_intr()`, y así es como [.filename]#pcm# sabe dónde puede transferir nuevos datos.

source: `xxxchannel_free()` is called to free up channel resources, for example when the driver is unloaded, and should be implemented if the channel data structures are dynamically allocated or if `sndbuf_alloc()` was not used for buffer allocation.
es: `xxxchannel_free()` es llamada para liberar recursos del canal, por ejemplo cuando el driver es descargado, y debería ser implementada si las estructuras de datos del canal son asignadas dinámicamente o si `sndbuf_alloc()` no fue usada para la asignación de buffers.

source: The routine returns a pointer to a (usually statically-defined) `pcmchan_caps` structure (defined in [.filename]#sound/pcm/channel.h#. The structure holds the minimum and maximum sampling frequencies, and the accepted sound formats. Look at any sound driver for an example.
es: La rutina devuelve un puntero a una estructura (normalmente definida estáticamente) `pcmchan_caps` (definida en [..filename]#sound/pcm/channel.h#. La estructura contiene las frecuencias de muestreo mínima y máxima, y los formatos de sonido aceptados. Mira cualquier controlador de sonido para ver un ejemplo.

source: More Functions
es: Más funciones

source: `channel_reset()`, `channel_resetdone()`, and `channel_notify()` are for special purposes and should not be implemented in a driver without discussing it on the {freebsd-multimedia}.
es: `channel_reset()`, `channel_resetdone()`, y `channel_notify()` son para propósitos especiales y no deberían ser implementados en un controlador sin discutirlo en el {freebsd-multimedia}.

source: `channel_setdir()` is deprecated.
es: La función `channel_setdir()` está obsoleta.

source: The MIXER Interface
es: La interfaz MIXER

source: `xxxmixer_init()` initializes the hardware and tells [.filename]#pcm# what mixer devices are available for playing and recording
es: `xxxmixer_init()` inicializa el hardware e indica a [.filename]#pcm# qué dispositivos de mezcla están disponibles para reproducir y grabar

source: Set bits in an integer value and call `mix_setdevs()` and `mix_setrecdevs()` to tell [.filename]#pcm# what devices exist.
es: Establece bits en un valor entero y llama a `mix_setdevs()` y `mix_setrecdevs()` para decirle a [.filename]#pcm# qué dispositivos existen.

source: Mixer bits definitions can be found in [.filename]#soundcard.h# (`SOUND_MASK_XXX` values and `SOUND_MIXER_XXX` bit shifts).
es: Las definiciones de los bits del mezclador se encuentran en [.filename]#soundcard.h# (valores `SOUND_MASK_XXX` y desplazamientos de bits `SOUND_MIXER_XXX`).

source: `xxxmixer_set()` sets the volume level for one mixer device.
es: `xxxmixer_set()` establece el nivel de volumen de un dispositivo mezclador.

source: The device is specified as a `SOUND_MIXER_XXX` value. The volume values are specified in range [0-100]. A value of zero should mute the device.
es: El dispositivo se especifica como un valor `SOUND_MIXER_XXX`. Los valores de volumen se especifican en el rango [0-100]. Un valor de cero debe silenciar el dispositivo.

source: As the hardware levels probably will not match the input scale, and some rounding will occur, the routine returns the actual level values (in range 0-100) as shown.
es: Como los niveles de hardware probablemente no coincidirán con la escala de entrada, y se producirá algún redondeo, la rutina devuelve los valores de nivel reales (en el rango 0-100) como se muestra.

source: `xxxmixer_setrecsrc()` sets the recording source device.
es: `xxxmixer_setrecsrc()` establece el dispositivo fuente de grabación.

source: The desired recording devices are specified as a bit field
es: Los dispositivos de grabación deseados se especifican como un campo de bits

source: The actual devices set for recording are returned. Some drivers can only set one device for recording. The function should return -1 if an error occurs.
es: Se devuelven los dispositivos reales configurados para la grabación. Algunos controladores sólo pueden establecer un dispositivo para la grabación. La función debe devolver -1 si se produce un error.

source: `xxxmixer_uninit()` should ensure that all sound is muted and if possible mixer hardware should be powered down.
es: `xxxmixer_uninit()` debe asegurar que todo el sonido está silenciado y si es posible el hardware del mezclador debe ser apagado.

source: `xxxmixer_reinit()` should ensure that the mixer hardware is powered up and any settings not controlled by `mixer_set()` or `mixer_setrecsrc()` are restored.
es: La función `xxxmixer_reinit()` debe asegurar que el hardware del mezclador se enciende y que se restaura cualquier configuración no controlada por `mixer_set()` o `mixer_setrecsrc()`.

source: The AC97 Interface
es: La interfaz AC97

source: The _AC97_ interface is implemented by drivers with an AC97 codec. It only has three methods:
es: La interfaz _AC97_ la implementan los controladores con un códec AC97. Sólo tiene tres métodos:

source: `xxxac97_init()` returns the number of ac97 codecs found.
es: `xxxac97_init()` devuelve el número de codecs ac97 encontrados.

source: `ac97_read()` and `ac97_write()` read or write a specified register.
es: ac97_read()` y `ac97_write()` leen o escriben un registro especificado.

source: The _AC97_ interface is used by the AC97 code in [.filename]#pcm# to perform higher level operations. Look at [.filename]#sound/pci/maestro3.c# or many others under [.filename]#sound/pci/# for an example.
es: La interfaz _AC97_ es utilizada por el código AC97 en [.filename]#pcm# para realizar operaciones de nivel superior. Mira [.filename]#sound/pci/maestro3.c# o muchos otros bajo [.filename]#sound/pci/# para un ejemplo.
