Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/developers-handbook/l10n/_index.po
Languages: pt_br

source: Localization and Internationalization - L10N and I18N in FreeBSD
pt_br: Localização e Internacionalização - L10N e I18N no FreeBSD

source: Chapter 4. Localization and Internationalization - L10N and I18N
pt_br: Capítulo 4. Localização e Internacionalização - L10N e I18N

source: Localization and Internationalization - L10N and I18N
pt_br: Localização e Internacionalização - L10N e I18N

source: Programming I18N Compliant Applications
pt_br: Programação de aplicativos compatíveis com I18N

source: To make your application more useful for speakers of other languages, we hope that you will program I18N compliant. The GNU gcc compiler and GUI libraries like QT and GTK support I18N through special handling of strings. Making a program I18N compliant is very easy. It allows contributors to port your application to other languages quickly. Refer to the library specific I18N documentation for more details.
pt_br: Para tornar seu aplicativo mais útil para falantes de outros idiomas, esperamos que você programe em conformidade com I18N. O compilador GNU gcc e bibliotecas GUI como QT e GTK suportam I18N por meio de manipulação especial de strings. Tornar um programa compatível com I18N é muito fácil. Ele permite que os colaboradores portem seu aplicativo para outros idiomas rapidamente. Consulte a documentação específica da biblioteca I18N para obter mais detalhes.

source: In contrast with common perception, I18N compliant code is easy to write. Usually, it only involves wrapping your strings with library specific functions. In addition, please be sure to allow for wide or multibyte character support.
pt_br: Em contraste com a percepção comum, o código compatível com I18N é fácil de escrever. Normalmente, envolve apenas agrupar suas strings com funções específicas da biblioteca. Além disso, certifique-se de permitir suporte a caracteres amplos ou multibyte.

source: A Call to Unify the I18N Effort
pt_br: Um apelo para unificar o I18N

source: It has come to our attention that the individual I18N/L10N efforts for each country has been repeating each others' efforts. Many of us have been reinventing the wheel repeatedly and inefficiently. We hope that the various major groups in I18N could congregate into a group effort similar to the Core Team's responsibility.
pt_br: Chegou ao nosso conhecimento que os esforços individuais do I18N/L10N para cada país têm repetido os esforços uns dos outros. Muitos de nós temos reinventado a roda repetidamente e de forma ineficiente. Esperamos que os vários grupos principais do I18N possam reunir-se num esforço de grupo semelhante à responsabilidade da Equipe Principal.

source: Currently, we hope that, when you write or port I18N programs, you would send it out to each country's related FreeBSD mailing list for testing. In the future, we hope to create applications that work in all the languages out-of-the-box without dirty hacks.
pt_br: Atualmente, esperamos que, ao escrever ou portar programas I18N, você os envie para a lista de discussão do FreeBSD relacionada de cada país para teste. No futuro, esperamos criar aplicativos que funcionem em todos os idiomas imediatamente, sem hacks.

source: The {freebsd-i18n} has been established. If you are an I18N/L10N developer, please send your comments, ideas, questions, and anything you deem related to it.
pt_br: O {freebsd-i18n} foi estabelecido. Se você é um desenvolvedor I18N/L10N, envie seus comentários, ideias, dúvidas e qualquer coisa que considere relacionada a ele.

source: Perl and Python
pt_br: Perl e Python

source: Perl and Python have I18N and wide character handling libraries. Please use them for I18N compliance.
pt_br: Perl e Python possuem I18N e amplas bibliotecas de manipulação de caracteres. Use-os para conformidade com I18N.

source: Localized Messages with POSIX.1 Native Language Support (NLS)
pt_br: Mensagens localizadas com suporte ao idioma nativo POSIX.1 (NLS)

source: Beyond the basic I18N functions, like supporting various input encodings or supporting national conventions, such as the different decimal separators, at a higher level of I18N, it is possible to localize the messages written to the output by the various programs. A common way of doing this is using the POSIX.1 NLS functions, which are provided as a part of the FreeBSD base system.
pt_br: Além das funções básicas do I18N, como suporte a diversas codificações de entrada ou suporte a convenções nacionais, como os diferentes separadores decimais, em um nível superior do I18N, é possível localizar as mensagens escritas na saída pelos diversos programas. Uma maneira comum de fazer isso é usar as funções POSIX.1 NLS, que são fornecidas como parte do sistema base do FreeBSD.

source: Organizing Localized Messages into Catalog Files
pt_br: Organizando mensagens localizadas em arquivos de catálogo

source: POSIX.1 NLS is based on catalog files, which contain the localized messages in the desired encoding. The messages are organized into sets and each message is identified by an integer number in the containing set. The catalog files are conventionally named after the locale they contain localized messages for, followed by the `.msg` extension. For instance, the Hungarian messages for ISO8859-2 encoding should be stored in a file called [.filename]#hu_HU.ISO8859-2#.
pt_br: POSIX.1 NLS é baseado em arquivos de catálogo, que contêm as mensagens localizadas na codificação desejada. As mensagens são organizadas em conjuntos e cada mensagem é identificada por um número inteiro no conjunto que as contém. Os arquivos de catálogo são convencionalmente nomeados de acordo com o local para o qual contêm mensagens localizadas, seguido pela extensão `.msg`. Por exemplo, as mensagens húngaras para codificação ISO8859-2 devem ser armazenadas em um arquivo chamado [.filename]#hu_HU.ISO8859-2#.

source: These catalog files are common text files that contain the numbered messages. It is possible to write comments by starting the line with a `$` sign. Set boundaries are also separated by special comments, where the keyword `set` must directly follow the `$` sign. The `set` keyword is then followed by the set number. For example:
pt_br: Esses arquivos de catálogo são arquivos de texto comuns que contêm mensagens numeradas. É possível escrever comentários iniciando a linha com um sinal `$`. Os limites definidos também são separados por comentários especiais, onde a palavra-chave `set` deve seguir diretamente o sinal `$`. A palavra-chave `set` é seguida pelo número do conjunto. Por exemplo:

source: The actual message entries start with the message number and followed by the localized message. The well-known modifiers from man:printf[3] are accepted:
pt_br: As entradas de mensagens reais começam com o número da mensagem e seguidas pela mensagem localizada. Os modificadores bem conhecidos de man:printf[3] são aceitos:

source: The language catalog files have to be compiled into a binary form before they can be opened from the program. This conversion is done with the man:gencat[1] utility. Its first argument is the filename of the compiled catalog and its further arguments are the input catalogs. The localized messages can also be organized into more catalog files and then all of them can be processed with man:gencat[1].
pt_br: Os arquivos do catálogo de idiomas devem ser compilados em formato binário antes de serem abertos no programa. Esta conversão é feita com o utilitário man:gencat[1]. Seu primeiro argumento é o nome do arquivo do catálogo compilado e seus argumentos seguintes são os catálogos de entrada. As mensagens localizadas também podem ser organizadas em mais arquivos de catálogo e então todos eles podem ser processados com man:gencat[1].

source: Using the Catalog Files from the Source Code
pt_br: Usando os arquivos de catálogo do código-fonte

source: Using the catalog files is simple. To use the related functions, [.filename]#nl_types.h# must be included. Before using a catalog, it has to be opened with man:catopen[3]. The function takes two arguments. The first parameter is the name of the installed and compiled catalog. Usually, the name of the program is used, such as grep. This name will be used when looking for the compiled catalog file. The man:catopen[3] call looks for this file in [.filename]#/usr/share/nls/locale/catname# and in [.filename]#/usr/local/share/nls/locale/catname#, where `locale` is the locale set and `catname` is the catalog name being discussed. The second parameter is a constant, which can have two values:
pt_br: Usar os arquivos de catálogo é simples. Para usar as funções relacionadas, [.filename]#nl_types.h# deve ser incluído. Antes de usar um catálogo, ele deve ser aberto com man:catopen[3]. A função leva dois argumentos. O primeiro parâmetro é o nome do catálogo instalado e compilado. Normalmente, é usado o nome do programa, como grep. Este nome será utilizado ao procurar o arquivo de catálogo compilado. A chamada man:catopen[3] procura este arquivo em [.filename]#/usr/share/nls/locale/catname# e em [.filename]#/usr/local/share/nls/locale/catname#, onde `locale` é o conjunto de localidade e `catname` é o nome do catálogo. O segundo parâmetro é uma constante, que pode ter dois valores:

source: `NL_CAT_LOCALE`, which means that the used catalog file will be based on `LC_MESSAGES`.
pt_br: `NL_CAT_LOCALE`, o que significa que o arquivo de catálogo utilizado será baseado em `LC_MESSAGES`.

source: `0`, which means that `LANG` has to be used to open the proper catalog.
pt_br: `0`, o que significa que `LANG` deve ser usado para abrir o catálogo adequado.

source: The man:catopen[3] call returns a catalog identifier of type `nl_catd`. Please refer to the manual page for a list of possible returned error codes.
pt_br: A chamada man:catopen[3] retorna um identificador de catálogo do tipo `nl_catd`. Consulte a página do manual para obter uma lista de possíveis códigos de erro retornados.

source: After opening a catalog man:catgets[3] can be used to retrieve a message. The first parameter is the catalog identifier returned by man:catopen[3], the second one is the number of the set, the third one is the number of the messages, and the fourth one is a fallback message, which will be returned if the requested message cannot be retrieved from the catalog file.
pt_br: Depois de abrir um catálogo, man:catgets[3] pode ser usado para recuperar uma mensagem. O primeiro parâmetro é o identificador do catálogo retornado por man:catopen[3], o segundo é o número do conjunto, o terceiro é o número de mensagens e o quarto é uma mensagem substituta, que será retornada se a mensagem solicitada não puder ser recuperada do arquivo de catálogo.

source: After using the catalog file, it must be closed by calling man:catclose[3], which has one argument, the catalog id.
pt_br: Após utilizar o arquivo de catálogo, ele deve ser fechado chamando man:catclose[3], que possui um argumento, o id do catálogo.

source: A Practical Example
pt_br: Um exemplo prático

source: The following example will demonstrate an easy solution on how to use NLS catalogs in a flexible way.
pt_br: O exemplo a seguir demonstrará uma solução fácil sobre como usar catálogos NLS de maneira flexível.

source: The below lines need to be put into a common header file of the program, which is included into all source files where localized messages are necessary:
pt_br: As linhas abaixo precisam ser colocadas em um arquivo de cabeçalho comum do programa, que é incluído em todos os arquivos fonte onde mensagens localizadas são necessárias:

source: Next, put these lines into the global declaration part of the main source file:
pt_br: A seguir, coloque estas linhas na parte da declaração global do arquivo fonte principal:

source: Next come the real code snippets, which open, read, and close the catalog:
pt_br: A seguir vêm os trechos de código reais, que abrem, leem e fecham o catálogo:

source: Reducing Strings to Localize
pt_br: Reduzindo Strings para Localizar

source: There is a good way of reducing the strings that need to be localized by using libc error messages. This is also useful to just avoid duplication and provide consistent error messages for the common errors that can be encountered by a great many of programs.
pt_br: Existe uma boa maneira de reduzir as strings que precisam ser localizadas usando mensagens de erro da libc. Isso também é útil para evitar duplicação e fornecer mensagens de erro consistentes para os erros comuns que podem ser encontrados por muitos programas.

source: First, here is an example that does not use libc error messages:
pt_br: Primeiro, aqui está um exemplo que não usa mensagens de erro da libc:

source: This can be transformed to print an error message by reading `errno` and printing an error message accordingly:
pt_br: Isso pode ser transformado para imprimir uma mensagem de erro lendo `errno` e imprimindo uma mensagem de erro de acordo:

source: In this example, the custom string is eliminated, thus translators will have less work when localizing the program and users will see the usual "Not a directory" error message when they encounter this error. This message will probably seem more familiar to them. Please note that it was necessary to include [.filename]#errno.h# in order to directly access `errno`.
pt_br: Neste exemplo, a string personalizada é eliminada, portanto os tradutores terão menos trabalho ao localizar o programa e os usuários verão a mensagem de erro usual "Não é um diretório" quando encontrarem esse erro. Esta mensagem provavelmente lhes parecerá mais familiar. Observe que foi necessário incluir [.filename]#errno.h# para acessar diretamente `errno`.

source: It is worth to note that there are cases when `errno` is set automatically by a preceding call, so it is not necessary to set it explicitly:
pt_br: Vale a pena notar que há casos em que `errno` é definido automaticamente por uma chamada anterior, portanto não é necessário defini-lo explicitamente:

source: Making use of [.filename]#bsd.nls.mk#
pt_br: Fazendo uso de [.filename]#bsd.nls.mk#

source: Using the catalog files requires few repeatable steps, such as compiling the catalogs and installing them to the proper location. In order to simplify this process even more, [.filename]#bsd.nls.mk# introduces some macros. It is not necessary to include [.filename]#bsd.nls.mk# explicitly, it is pulled in from the common Makefiles, such as [.filename]#bsd.prog.mk# or [.filename]#bsd.lib.mk#.
pt_br: O uso dos arquivos de catálogo requer algumas etapas repetíveis, como compilar os catálogos e instalá-los no local adequado. Para simplificar ainda mais este processo, [.filename]#bsd.nls.mk# introduz algumas macros. Não é necessário incluir [.filename]#bsd.nls.mk# explicitamente, ele é extraído dos Makefiles comuns, como [.filename]#bsd.prog.mk# ou [.filename]#bsd.lib .mk#.

source: Usually it is enough to define `NLSNAME`, which should have the catalog name mentioned as the first argument of man:catopen[3] and list the catalog files in `NLS` without their `.msg` extension. Here is an example, which makes it possible to to disable NLS when used with the code examples before. The `WITHOUT_NLS` man:make[1] variable has to be defined in order to build the program without NLS support.
pt_br: Normalmente basta definir `NLSNAME`, que deve ter o nome do catálogo mencionado como primeiro argumento de man:catopen[3] e listar os arquivos do catálogo em `NLS` sem a extensão `.msg`. Aqui está um exemplo que torna possível desabilitar o NLS quando usado com os exemplos de código anteriores. A variável `WITHOUT_NLS` man:make[1] deve ser definida para construir o programa sem suporte NLS.

source: Conventionally, the catalog files are placed under the [.filename]#nls# subdirectory and this is the default behavior of [.filename]#bsd.nls.mk#. It is possible, though to override the location of the catalogs with the `NLSSRCDIR` man:make[1] variable. The default name of the precompiled catalog files also follow the naming convention mentioned before. It can be overridden by setting the `NLSNAME` variable. There are other options to fine tune the processing of the catalog files but usually it is not needed, thus they are not described here. For further information on [.filename]#bsd.nls.mk#, please refer to the file itself, it is short and easy to understand.
pt_br: Convencionalmente, os arquivos de catálogo são colocados no subdiretório [.filename]#nls# e este é o comportamento padrão de [.filename]#bsd.nls.mk#. É possível, entretanto, substituir a localização dos catálogos pela variável `NLSSRCDIR` man:make[1]. O nome padrão dos arquivos de catálogo pré-compilados também segue a convenção de nomenclatura mencionada anteriormente. Pode ser substituído definindo a variável `NLSNAME`. Existem outras opções para ajustar o processamento dos arquivos de catálogo, mas geralmente não são necessárias e, portanto, não são descritas aqui. Para mais informações sobre [.filename]#bsd.nls.mk#, consulte o próprio arquivo, ele é curto e fácil de entender.
