Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: Using a multi label policy on a partition and establishing a multi label security model can increase administrative overhead as everything in that file system has a label. This includes directories, files, and even device nodes.
ko: 파티션에 다중 레이블 정책을 사용하고 다중 레이블 보안 모델을 설정하면 해당 파일 시스템의 모든 항목에 레이블이 지정되므로 관리 오버헤드가 증가할 수 있습니다. 여기에는 디렉터리, 파일, 심지어 장치 노드까지 포함됩니다.
ru: Использование политики с несколькими метками на разделе и установление модели безопасности с несколькими метками может увеличить административную нагрузку, так как всё в этой файловой системе имеет метку. Это включает каталоги, файлы и даже узлы устройств.

source: The following command will set `multilabel` on the specified UFS file system. This may only be done in single-user mode and is not a requirement for the swap file system:
ko: 다음 명령은 지정된 UFS 파일 시스템에 `멀티레이블` 을 설정합니다. 이 작업은 단일 사용자 모드에서만 수행할 수 있으며 스왑 파일 시스템에 대한 요구 사항은 아닙니다:
ru: Следующая команда установит `multilabel` для указанной файловой системы UFS. Это можно сделать только в однопользовательском режиме и не является обязательным для файловой системы подкачки:

source: Some users have experienced problems with setting the `multilabel` flag on the root partition. If this is the case, please review crossref:mac[mac-troubleshoot, Troubleshooting the MAC Framework].
ru: Некоторые пользователи столкнулись с проблемами при установке флага `multilabel` на корневом разделе. Если это ваш случай, ознакомьтесь с crossref:mac[mac-troubleshoot, Устранение неполадок инфраструктуры MAC].

source: Since the multi label policy is set on a per-file system basis, a multi label policy may not be needed if the file system layout is well designed. Consider an example security MAC model for a FreeBSD web server. This machine uses the single label, `biba/high`, for everything in the default file systems. If the web server needs to run at `biba/low` to prevent write up capabilities, it could be installed to a separate UFS [.filename]#/usr/local# file system set at `biba/low`.
ko: 다중 레이블 정책은 파일 시스템 단위로 설정되므로 파일 시스템 레이아웃이 잘 설계된 경우 다중 레이블 정책이 필요하지 않을 수 있습니다. FreeBSD 웹 서버의 보안 MAC 모델을 예로 들어보겠습니다. 이 머신은 기본 파일 시스템의 모든 항목에 단일 레이블인 `biba/high` 를 사용합니다. 쓰기 기능을 방지하기 위해 웹 서버를 `biba/low` 에서 실행해야 하는 경우, `biba/low` 로 설정된 별도의 UFS [.filename]#/usr/local# 파일 시스템에 웹 서버를 설치할 수 있습니다.
ru: Поскольку политика с несколькими метками устанавливается для каждой файловой системы, она может не потребоваться, если структура файловых систем хорошо продумана. Рассмотрим пример модели безопасности MAC для веб-сервера FreeBSD. На этой машине используется единая метка `biba/high` для всего в стандартных файловых системах. Если веб-сервер должен работать с `biba/low`, чтобы предотвратить возможность записи вверх, его можно установить в отдельную файловую систему UFS [.filename]#/usr/local# с меткой `biba/low`.

source: Label Configuration
ko: 레이블 구성
ru: Конфигурация меток

source: Virtually all aspects of label policy module configuration will be performed using the base system utilities. These commands provide a simple interface for object or subject configuration or the manipulation and verification of the configuration.
ko: 레이블 정책 모듈 구성의 거의 모든 측면은 기본 시스템 유틸리티를 사용하여 수행됩니다. 이러한 명령은 개체 또는 대상 구성 또는 구성의 조작 및 확인을 위한 간단한 인터페이스를 제공합니다.
ru: Практически все аспекты настройки модуля политики меток будут выполняться с помощью базовых системных утилит. Эти команды предоставляют простой интерфейс для настройки объекта или субъекта, а также для изменения и проверки конфигурации.

source: All configuration may be done using `setfmac`, which is used to set MAC labels on system objects, and `setpmac`, which is used to set the labels on system subjects. For example, to set the `biba` MAC label to `high` on [.filename]#test#:
ko: 모든 구성은 시스템 개체의 MAC 레이블을 설정하는 데 사용되는 `setfmac` 과 시스템 주체의 레이블을 설정하는 데 사용되는 `setpmac` 을 사용하여 수행할 수 있습니다. 예를 들어, [.filename]#test# 에 `biba` MAC 레이블을 `high` 로 설정합니다:
ru: Вся настройка может быть выполнена с помощью `setfmac`, который используется для установки меток MAC на объектах системы, и `setpmac`, который используется для установки меток на субъектах системы. Например, чтобы установить метку MAC `biba` в значение `high` для [.filename]#test#:

source: If the configuration is successful, the prompt will be returned without error. A common error is `Permission denied` which usually occurs when the label is being set or modified on a restricted object. Other conditions may produce different failures. For instance, the file may not be owned by the user attempting to relabel the object, the object may not exist, or the object may be read-only. A mandatory policy will not allow the process to relabel the file, maybe because of a property of the file, a property of the process, or a property of the proposed new label value. For example, if a user running at low integrity tries to change the label of a high integrity file, or a user running at low integrity tries to change the label of a low integrity file to a high integrity label, these operations will fail.
ko: 구성이 성공하면 오류 없이 프롬프트가 반환됩니다. 일반적인 오류는 `Permission denied` 로, 일반적으로 제한된 객체에 레이블을 설정하거나 수정할 때 발생합니다. 다른 조건에서는 다른 오류가 발생할 수 있습니다. 예를 들어, 개체에 레이블을 다시 지정하려는 사용자가 파일을 소유하고 있지 않거나, 개체가 존재하지 않거나, 개체가 읽기 전용일 수 있습니다. 필수 정책은 파일의 속성, 프로세스의 속성 또는 제안된 새 레이블 값의 속성 때문에 프로세스가 파일에 레이블을 다시 지정하는 것을 허용하지 않을 수 있습니다. 예를 들어, 낮은 무결성으로 실행 중인 사용자가 높은 무결성 파일의 레이블을 변경하려고 하거나 낮은 무결성으로 실행 중인 사용자가 낮은 무결성 파일의 레이블을 높은 무결성 레이블로 변경하려고 하는 경우 이러한 작업은 실패합니다.
ru: Если конфигурация выполнена успешно, командная строка вернётся без ошибок. Частая ошибка — `Permission denied`, которая обычно возникает при установке или изменении метки на защищённом объекте. Другие условия могут вызывать иные сбои. Например, файл может не принадлежать пользователю, пытающемуся изменить метку объекта, объект может не существовать или быть доступным только для чтения. Обязательная политика не позволит процессу изменить метку файла, возможно, из-за свойств самого файла, процесса или предлагаемого нового значения метки. Например, если пользователь с низким уровнем целостности попытается изменить метку файла с высоким уровнем целостности или если пользователь с низким уровнем целостности попытается изменить метку файла с низкого уровня на высокий, эти операции завершатся неудачей.

source: The system administrator may use `setpmac` to override the policy module's settings by assigning a different label to the invoked process:
ko: 시스템 관리자는 `setpmac` 을 사용하여 호출된 프로세스에 다른 레이블을 할당하여 정책 모듈의 설정을 재정의할 수 있습니다:
ru: Системный администратор может использовать `setpmac` для переопределения настроек модуля политики, назначив другую метку вызываемому процессу:

source: For currently running processes, such as sendmail, `getpmac` is usually used instead. This command takes a process ID (PID) in place of a command name. If users attempt to manipulate a file not in their access, subject to the rules of the loaded policy modules, the `Operation not permitted` error will be displayed.
ko: sendmail과 같이 현재 실행 중인 프로세스의 경우 일반적으로 `getpmac` 이 대신 사용됩니다. 이 명령은 명령 이름 대신 프로세스 ID(PID)를 사용합니다. 사용자가 로드된 정책 모듈의 규칙에 따라 액세스 권한이 없는 파일을 조작하려고 하면 `Operation not permitted` 오류가 표시됩니다.
ru: Для уже запущенных процессов, таких как sendmail, обычно используется `getpmac` вместо этого. Эта команда принимает идентификатор процесса (PID) вместо имени команды. Если пользователи пытаются работать с файлом, к которому у них нет доступа, в соответствии с правилами загруженных модулей политики, будет отображаться ошибка `Операция не разрешена (Operation not permitted)`.

source: Predefined Labels
ko: 사전 정의된 레이블
ru: Предопределенные метки

source: A few FreeBSD policy modules which support the labeling feature offer three predefined labels: `low`, `equal`, and `high`, where:
ko: 라벨링 기능을 지원하는 몇몇 FreeBSD 정책 모듈은 세 가지 사전 정의된 레이블을 제공합니다: `low`, `equal`, `high` 의 세 가지 레이블을 제공합니다:
ru: Несколько модулей политики FreeBSD, поддерживающих функцию меток, предлагают три предопределённых метки: `low`, `equal` и `high`, где:

source: `low` is considered the lowest label setting an object or subject may have. Setting this on objects or subjects blocks their access to objects or subjects marked high.
ko: `low` 은 개체나 주체가 가질 수 있는 가장 낮은 레이블 설정으로 간주됩니다. 개체나 주체에 이 설정을 지정하면 높게 표시된 개체나 주체에 대한 액세스가 차단됩니다.
ru: `low` считается минимальным уровнем метки, который может быть установлен для объекта или субъекта. Установка этого уровня для объектов или субъектов блокирует их доступ к объектам или субъектам, помеченным как `high`.

source: `equal` sets the subject or object to be disabled or unaffected and should only be placed on objects considered to be exempt from the policy.
ko: `equal` 은 주체 또는 객체를 비활성화하거나 영향을 받지 않도록 설정하며 정책에서 제외되는 것으로 간주되는 객체에만 배치해야 합니다.
ru: `equal` устанавливает, что субъект или объект отключён или не затронут, и должен использоваться только для объектов, считающихся исключёнными из политики.

source: `high` grants an object or subject the highest setting available in the Biba and MLS policy modules.
ko: `high` 는 개체 또는 주체에 Biba 및 MLS 정책 모듈에서 사용할 수 있는 가장 높은 설정을 부여합니다.
ru: `high` предоставляет объекту или субъекту наивысший уровень доступа, доступный в модулях политик Biba и MLS.

source: Such policy modules include man:mac_biba[4], man:mac_mls[4] and man:mac_lomac[4]. Each of the predefined labels establishes a different information flow directive. Refer to the manual page of the module to determine the traits of the generic label configurations.
ko: 이러한 정책 모듈에는 man:mac_biba[4], man:mac_mls[4] 및 man:mac_lomac[4]이 있습니다. 미리 정의된 각 레이블은 서로 다른 정보 흐름 지시문을 설정합니다. 일반 레이블 구성의 특성을 확인하려면 모듈의 설명서 페이지를 참조하세요.
ru: Такие модули политик включают man:mac_biba[4], man:mac_mls[4] и man:mac_lomac[4]. Каждый из предопределённых меток устанавливает различные директивы потока информации. Обратитесь к справочной странице модуля, чтобы определить особенности стандартных конфигураций меток.

source: Numeric Labels
ko: 숫자 레이블
ru: Числовые метки

source: The Biba and MLS policy modules support a numeric label which may be set to indicate the precise level of hierarchical control. This numeric level is used to partition or sort information into different groups of classification, only permitting access to that group or a higher group level. For example:
ko: Biba 및 MLS 정책 모듈은 계층적 제어의 정확한 수준을 나타내도록 설정할 수 있는 숫자 레이블을 지원합니다. 이 숫자 수준은 정보를 여러 분류 그룹으로 분할하거나 정렬하는 데 사용되며, 해당 그룹 또는 상위 그룹 수준에 대한 액세스만 허용합니다. 예를 들면 다음과 같습니다:
ru: Модули политик Biba и MLS поддерживают числовую метку, которая может быть установлена для указания точного уровня иерархического контроля. Этот числовой уровень используется для разделения или сортировки информации по различным группам классификации, разрешая доступ только к этой группе или к группе более высокого уровня. Например:

source: may be interpreted as "Biba Policy Label/Grade 10:Compartments 2, 3 and 6: (grade 5 ...")
ko: "Biba Policy Label/Grade 10:Compartments 2, 3 and 6: (grade 5 ...)"으로 해석될 수 있습니다
ru: может интерпретироваться как "Метка/уровень целостности (grade) политики Biba 10: компартменты 2, 3 и 6: (уровень 5 ...)"

source: In this example, the first grade would be considered the effective grade with effective compartments, the second grade is the low grade, and the last one is the high grade. In most configurations, such fine-grained settings are not needed as they are considered to be advanced configurations.
ko: 이 예에서 첫 번째 등급은 유효 구획이 있는 유효 등급, 두 번째 등급은 낮은 등급, 마지막 등급은 높은 등급으로 간주됩니다. 대부분의 구성에서는 고급 구성으로 간주되므로 이러한 세분화된 설정은 필요하지 않습니다.
ru: В этом примере первый уровень целостности будет считаться эффективным с эффективными компартментами, второй уровень — низкий уровень, а последний — высокий. В большинстве конфигураций такие детальные настройки не требуются, так как они считаются расширенными конфигурациями.

source: System objects only have a current grade and compartment. System subjects reflect the range of available rights in the system, and network interfaces, where they are used for access control.
ko: 시스템 객체에는 현재 등급과 구획만 있습니다. 시스템 주체는 시스템에서 사용 가능한 권한의 범위와 액세스 제어에 사용되는 네트워크 인터페이스를 반영합니다.
ru: Системные объекты имеют только текущий уровень целостности и компартмент. Системные субъекты отражают диапазон доступных прав в системе, а сетевые интерфейсы используются для контроля доступа.

source: The grade and compartments in a subject and object pair are used to construct a relationship known as _dominance_, in which a subject dominates an object, the object dominates the subject, neither dominates the other, or both dominate each other. The "both dominate" case occurs when the two labels are equal. Due to the information flow nature of Biba, a user has rights to a set of compartments that might correspond to projects, but objects also have a set of compartments. Users may have to subset their rights using `su` or `setpmac` in order to access objects in a compartment from which they are not restricted.
ko: 주제와 객체 쌍의 등급과 구획은 주체가 객체를 지배하거나, 객체가 주체를 지배하거나, 어느 쪽도 다른 쪽을 지배하지 않거나, 둘 다 서로를 지배하는 _우위(dominance)_ 라는 관계를 구성하는 데 사용됩니다. "both dominate"의 경우는 두 레이블이 동일할 때 발생합니다. Biba의 정보 흐름 특성으로 인해 사용자는 프로젝트에 해당할 수 있는 일련의 구획에 대한 권한을 가지지만, 객체에도 일련의 구획이 있습니다. 사용자가 제한되지 않는 구획의 개체에 액세스하려면 `su` 또는 `setpmac` 을 사용하여 권한을 하위 설정해야 할 수 있습니다.
ru: Уровни целостности и компартменты в паре субъект-объект используются для построения отношения, известного как _доминирование_, при котором субъект доминирует над объектом, объект доминирует над субъектом, ни один не доминирует над другим или оба доминируют друг над другом. Случай «оба доминируют» возникает, когда две метки равны. В силу природы информационных потоков в модели Biba пользователь имеет права на набор компартментов, которые могут соответствовать проектам, но объекты также имеют набор компартментов. Пользователям может потребоваться ограничить свои права с помощью `su` или `setpmac`, чтобы получить доступ к объектам в компартментах, от которой они не ограничены.

source: User Labels
ko: 사용자 레이블
ru: Пользовательские метки

source: Users are required to have labels so that their files and processes properly interact with the security policy defined on the system. This is configured in [.filename]#/etc/login.conf# using login classes. Every policy module that uses labels will implement the user class setting.
ko: 사용자는 파일 및 프로세스가 시스템에 정의된 보안 정책과 올바르게 상호 작용할 수 있도록 레이블이 있어야 합니다. 이는 로그인 클래스를 사용하여 [.filename]#/etc/login.conf# 에서 구성됩니다. 레이블을 사용하는 모든 정책 모듈은 사용자 클래스 설정을 구현합니다.
ru: Пользователи должны иметь метки, чтобы их файлы и процессы корректно взаимодействовали с политикой безопасности, определенной в системе. Это настраивается в [.filename]#/etc/login.conf# с использованием классов входа. Каждый модуль политики, использующий метки, будет реализовывать настройку класса пользователя.

source: To set the user class default label which will be enforced by MAC, add a `label` entry. An example `label` entry containing every policy module is displayed below. Note that in a real configuration, the administrator would never enable every policy module. It is recommended that the rest of this chapter be reviewed before any configuration is implemented.
ko: MAC에서 적용할 사용자 클래스 기본 레이블을 설정하려면 `label` 항목을 추가합니다. 모든 정책 모듈을 포함하는 `label` 항목의 예가 아래에 나와 있습니다. 실제 구성에서는 관리자가 모든 정책 모듈을 활성화하지 않을 것입니다. 구성을 구현하기 전에 이 장의 나머지 부분을 검토하는 것이 좋습니다.
ru: Чтобы установить метку класса пользователя по умолчанию, которая будет применяться MAC, добавьте запись `label`. Ниже приведен пример записи `label`, содержащей каждый модуль политики. Обратите внимание, что в реальной конфигурации администратор никогда не включает все модули политики. Рекомендуется ознакомиться с остальной частью этой главы перед внедрением любой конфигурации.

source: While users can not modify the default value, they may change their label after they login, subject to the constraints of the policy. The example above tells the Biba policy that a process's minimum integrity is `5`, its maximum is `15`, and the default effective label is `10`. The process will run at `10` until it chooses to change label, perhaps due to the user using `setpmac`, which will be constrained by Biba to the configured range.
ko: 사용자는 기본값을 수정할 수 없지만, 로그인 후 정책의 제약 조건에 따라 레이블을 변경할 수 있습니다. 위의 예는 프로세스의 최소 무결성은 `5`, 최대 무결성은 `15`, 기본 유효 레이블은 `10` 이라고 Biba 정책에 알려줍니다. 프로세스는 사용자가 `setpmac` 을 사용하기 때문에 라벨을 변경할 때까지 `10` 에서 실행되며, 이는 Biba에 의해 구성된 범위로 제한됩니다.
ru: Хотя пользователи не могут изменить значение по умолчанию, они могут изменить свою метку после входа в систему, в соответствии с ограничениями политики. В приведённом выше примере политика Biba указывает, что минимальный уровень целостности процесса — `5`, максимальный — `15`, а эффективная метка по умолчанию — `10`. Процесс будет выполняться с меткой `10`, пока не решит изменить её, например, если пользователь воспользуется `setpmac`, что будет ограничено политикой Biba в рамках заданного диапазона.

source: After any change to [.filename]#login.conf#, the login class capability database must be rebuilt using `cap_mkdb`.
ko: [.filename]#login.conf# 를 변경한 후에는 `cap_mkdb` 를 사용하여 로그인 클래스 기능 데이터베이스를 다시 빌드해야 합니다.
ru: После любого изменения в файле [.filename]#login.conf# необходимо перестроить базу данных возможностей классов входа с помощью команды `cap_mkdb`.

source: Many sites have a large number of users requiring several different user classes. In depth planning is required as this can become difficult to manage.
ko: 많은 장소에는 여러 가지 사용자 클래스가 필요한 많은 사용자가 있습니다. 관리가 어려워질 수 있으므로 심도 있는 계획이 필요합니다.
ru: Многие сайты имеют большое количество пользователей, требующих нескольких различных классов пользователей. Требуется тщательное планирование, так как это может стать сложным в управлении.

source: Network Interface Labels
ko: 네트워크 인터페이스 레이블
ru: Метки сетевых интерфейсов

source: Labels may be set on network interfaces to help control the flow of data across the network. Policies using network interface labels function in the same way that policies function with respect to objects. Users at high settings in Biba, for example, will not be permitted to access network interfaces with a label of `low`.
ko: 네트워크 인터페이스에 레이블을 설정하여 네트워크 전반의 데이터 흐름을 제어할 수 있습니다. 네트워크 인터페이스 레이블을 사용하는 정책은 객체에 대한 정책과 동일한 방식으로 작동합니다. 예를 들어, Biba에서 높은 설정의 사용자는 `low` 라는 레이블이 있는 네트워크 인터페이스에 액세스할 수 없습니다.
ru: Метки могут быть установлены на сетевых интерфейсах для помощи в контроле потока данных в сети. Политики, использующие метки сетевых интерфейсов, работают так же, как политики, применяемые к объектам. Например, пользователи с высокими уровнями в Biba не смогут получить доступ к сетевым интерфейсам с меткой `low`.

source: When setting the MAC label on network interfaces, `maclabel` may be passed to `ifconfig`:
ko: 네트워크 인터페이스에서 MAC 레이블을 설정할 때 `maclabel` 을 `ifconfig` 에 전달할 수 있습니다:
ru: При установке MAC-метки на сетевых интерфейсах, `maclabel` может быть передан в `ifconfig`:

source: This example will set the MAC label of `biba/equal` on the `bge0` interface. When using a setting similar to `biba/high(low-high)`, the entire label should be quoted to prevent an error from being returned.
ko: 이 예는 `bge0` 인터페이스에서 `biba/equal` 의 MAC 레이블을 설정합니다. biba/high(low-high)` 와 유사한 설정을 사용하는 경우 오류가 반환되지 않도록 전체 레이블을 따옴표로 묶어야 합니다.
ru: Этот пример установит метку MAC `biba/equal` на интерфейсе `bge0`. При использовании настройки вида `biba/high(low-high)` всю метку следует заключить в кавычки, чтобы избежать ошибки.

source: Each policy module which supports labeling has a tunable which may be used to disable the MAC label on network interfaces. Setting the label to `equal` will have a similar effect. Review the output of `sysctl`, the policy manual pages, and the information in the rest of this chapter for more information on those tunables.
ko: 라벨링을 지원하는 각 정책 모듈에는 네트워크 인터페이스에서 MAC 라벨을 비활성화하는 데 사용할 수 있는 튜너블이 있습니다. 레이블을 `equal` 로 설정해도 비슷한 효과가 있습니다. 이러한 튜너블에 대한 자세한 내용은 `sysctl` 의 출력, 정책 매뉴얼 페이지 및 이 장의 나머지 부분에 있는 정보를 검토하세요.
ru: Каждый модуль политики, поддерживающий метки, имеет настраиваемый параметр, который может использоваться для отключения метки MAC на сетевых интерфейсах. Установка метки в значение `equal` даст аналогичный эффект. Для получения дополнительной информации об этих настраиваемых параметрах ознакомьтесь с выводом `sysctl`, справочными страницами политик и информацией в остальной части этой главы.

source: Planning the Security Configuration
ko: 보안 구성 계획하기
ru: Планирование конфигурации безопасности

source: Before implementing any MAC policies, a planning phase is recommended. During the planning stages, an administrator should consider the implementation requirements and goals, such as:
ko: MAC 정책을 구현하기 전에 계획 단계를 수행하는 것이 좋습니다. 계획 단계에서 관리자는 다음과 같은 구현 요구 사항 및 목표를 고려해야 합니다:
ru: Прежде чем внедрять какие-либо политики MAC, рекомендуется этап планирования. На этапе планирования администратор должен учесть требования и цели внедрения, такие как:

source: How to classify information and resources available on the target systems.
ko: 대상 시스템에서 사용 가능한 정보 및 리소스를 분류하는 방법.
ru: Как классифицировать информацию и ресурсы, доступные в целевых системах.

source: Which information or resources to restrict access to along with the type of restrictions that should be applied.
ko: 적용해야 하는 제한 유형과 함께 액세스를 제한할 정보 또는 리소스.
ru: Какую информацию или ресурсы следует ограничить в доступе, а также тип ограничений, которые должны быть применены.

source: Which MAC modules will be required to achieve this goal.
ko: 이 목표를 달성하기 위해 어떤 MAC 모듈이 필요할지.
ru: Какие модули MAC потребуются для достижения этой цели.

source: A trial run of the trusted system and its configuration should occur _before_ a MAC implementation is used on production systems. Since different environments have different needs and requirements, establishing a complete security profile will decrease the need of changes once the system goes live.
ko: 프로덕션 시스템에서 MAC 구현을 사용하기 전에 신뢰할 수 있는 시스템과 해당 구성을 시험 실행해야 합니다. 환경마다 필요와 요구 사항이 다르기 때문에 완전한 보안 프로필을 설정하면 시스템이 가동된 후 변경할 필요성을 줄일 수 있습니다.
ru: Пробный запуск доверенной системы и её конфигурации должен быть выполнен _до_ использования реализации MAC в производственных системах. Поскольку различные среды имеют разные потребности и требования, создание полного профиля безопасности уменьшит необходимость изменений после ввода системы в эксплуатацию.

source: Consider how the MAC framework augments the security of the system as a whole. The various security policy modules provided by the MAC framework could be used to protect the network and file systems or to block users from accessing certain ports and sockets. Perhaps the best use of the policy modules is to load several security policy modules at a time in order to provide a MLS environment. This approach differs from a hardening policy, which typically hardens elements of a system which are used only for specific purposes. The downside to MLS is increased administrative overhead.
ko: MAC 프레임워크로 시스템 전반의 보안을 강화하는 방법을 고려하세요. MAC 프레임워크에서 제공하는 다양한 보안 정책 모듈을 사용하여 네트워크 및 파일 시스템을 보호하거나 사용자가 특정 포트 및 소켓에 액세스하지 못하도록 차단할 수 있습니다. 정책 모듈을 가장 잘 활용하는 방법은 한 번에 여러 보안 정책 모듈을 로드하여 MLS 환경을 제공하는 것입니다. 이 접근 방식은 일반적으로 특정 용도로만 사용되는 시스템 요소를 강화하는 강화 정책과는 다릅니다. MLS의 단점은 관리 오버헤드가 증가한다는 것입니다.
ru: Рассмотрим, как инфраструктура MAC усиливает безопасность системы в целом. Различные модули политики безопасности, предоставляемые инфраструктурой MAC, могут использоваться для защиты сети и файловых систем или для блокировки доступа пользователей к определённым портам и сокетам. Возможно, наилучшее применение модулей политики — это загрузка нескольких модулей политики безопасности одновременно для создания среды MLS. Такой подход отличается от политики усиления защиты, которая обычно укрепляет элементы системы, используемые только для определённых целей. Недостатком MLS является увеличение административных затрат.
