Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: If neither of these resolve the problem, send the error message and a description of the environment to the {freebsd-questions}.
ko: 이 두 가지 방법으로도 문제가 해결되지 않으면 오류 메시지와 환경에 대한 설명을 {freebsd-questions} 로 보내세요.
ru: Если ни один из этих способов не решит проблему, отправьте сообщение об ошибке и описание окружения на {freebsd-questions}.

source: The `_secure_path: unable to stat .login_conf` error appears
ko: `_secure_path: unable to stat .login_conf` 오류가 나타납니다
ru: Появляется ошибка `_secure_path: unable to stat .login_conf`

source: This error can appear when a user attempts to switch from the `root` user to another user in the system. This message usually occurs when the user has a higher label setting than that of the user they are attempting to become. For instance, if `joe` has a default label of `biba/low` and `root` has a label of `biba/high`, `root` cannot view ``joe``'s home directory. This will happen whether or not `root` has used `su` to become `joe` as the Biba integrity model will not permit `root` to view objects set at a lower integrity level.
ko: 이 오류는 사용자가 시스템에서 `root` 사용자에서 다른 사용자로 전환하려고 할 때 나타날 수 있습니다. 이 메시지는 일반적으로 사용자가 변경하려는 사용자보다 더 높은 레이블 설정을 가지고 있을 때 발생합니다. 예를 들어, `joe` 의 기본 레이블이 `biba/low` 이고 `root` 의 레이블이 `biba/high` 인 경우, `root` 는 `joe` 의 홈 디렉터리를 볼 수 없습니다. 이는 `root` 가 `su` 를 사용하여 `joe` 가 되었는지 여부에 관계없이 발생하며, Biba 무결성 모델은 `root` 가 더 낮은 무결성 수준으로 설정된 개체를 볼 수 있도록 허용하지 않기 때문입니다.
ru: Этот ошибка может возникать, когда пользователь пытается переключиться с пользователя `root` на другого пользователя в системе. Это сообщение обычно появляется, когда у пользователя установлена более высокая метка, чем у пользователя, в которого он пытается переключиться. Например, если у `joe` метка по умолчанию `biba/low`, а у `root` — `biba/high`, `root` не сможет просмотреть домашний каталог ``joe``. Это произойдет независимо от того, использовал ли `root` команду `su` для переключения на `joe`, так как модель целостности Biba не позволяет `root` просматривать объекты с более низким уровнем целостности.

source: The system no longer recognizes `root`
ko: 시스템이 더 이상 `root` 를 인식하지 못합니다
ru: Система больше не распознает `root`

source: When this occurs, `whoami` returns `0` and `su` returns `who are you?`.
ko: 이 경우 `whoami` 는 `0` 을 반환하고 `su` 는 `who are you?` 를 반환합니다.
ru: Когда это происходит, `whoami` возвращает `0`, а `su` выводит `who are you?`.

source: This can happen if a labeling policy has been disabled by man:sysctl[8] or the policy module was unloaded. If the policy is disabled, the login capabilities database needs to be reconfigured. Double check [.filename]#/etc/login.conf# to ensure that all `label` options have been removed and rebuild the database with `cap_mkdb`.
ko: 이 문제는 man:sysctl[8]에 의해 라벨링 정책이 비활성화되었거나 정책 모듈이 언로드된 경우에 발생할 수 있습니다. 정책이 비활성화되어 있으면 로그인 기능 데이터베이스를 다시 구성해야 합니다. [.filename]#/etc/login.conf# 에서 모든 `label` 옵션이 제거되었는지 다시 확인하고 `cap_mkd b`로 데이터베이스를 다시 빌드하세요.
ru: Это может произойти, если политика меток была отключена через man:sysctl[8] или модуль политики был выгружен. Если политика отключена, необходимо перенастроить базу данных возможностей входа. Проверьте файл [.filename]#/etc/login.conf#, чтобы убедиться, что все опции `label` удалены, и перестройте базу данных с помощью `cap_mkdb`.

source: This may also happen if a policy restricts access to [.filename]#master.passwd#. This is usually caused by an administrator altering the file under a label which conflicts with the general policy being used by the system. In these cases, the user information would be read by the system and access would be blocked as the file has inherited the new label. Disable the policy using man:sysctl[8] and everything should return to normal.
ko: 정책에서 [.filename]#master.passwd# 에 대한 액세스를 제한하는 경우에도 이 문제가 발생할 수 있습니다. 이는 일반적으로 관리자가 시스템에서 사용 중인 일반 정책과 충돌하는 레이블로 파일을 변경했기 때문에 발생합니다. 이 경우 시스템에서 사용자 정보를 읽고 파일이 새 레이블을 상속받았으므로 액세스가 차단됩니다. man:sysctl[8]을 사용하여 정책을 비활성화하면 모든 것이 정상으로 돌아옵니다.
ru: Это также может произойти, если политика ограничивает доступ к [.filename]#master.passwd#. Обычно это происходит, когда администратор изменяет файл под меткой, которая конфликтует с общей политикой, используемой системой. В таких случаях система прочитает информацию о пользователе, но доступ будет заблокирован, так как файл унаследовал новую метку. Отключите политику с помощью man:sysctl[8], и всё должно вернуться в норму.
