Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: `security.mac.portacl.rules` specifies the policy as a text string of the form `rule[,rule,...]`, with as many rules as needed, and where each rule is of the form `idtype:id:protocol:port`. The `idtype` is either `uid` or `gid`. The `protocol` parameter can be `tcp` or `udp`. The `port` parameter is the port number to allow the specified user or group to bind to. Only numeric values can be used for the user ID, group ID, and port parameters.
ko: `security.mac.portacl.rules` 는 정책을 `규칙[,규칙,...]` 형식의 텍스트 문자열로 지정하며, 필요한 만큼의 규칙을 포함하며, 각 규칙은 `idtype:id:protocol:port` 형식입니다. `idtype` 은 `uid` 또는 `gid` 입니다. `protocol` 매개변수는 `tcp` 또는 `udp` 일 수 있습니다. `port` 매개변수는 지정된 사용자 또는 그룹이 바인딩할 수 있는 포트 번호입니다. 사용자 ID, 그룹 ID 및 포트 매개변수에는 숫자 값만 사용할 수 있습니다.
ru: `security.mac.portacl.rules` задаёт политику в виде текстовой строки формата `правило[,правило,...]`, с любым необходимым количеством правил, где каждое правило имеет вид `тип_идентификатора:идентификатор:протокол:порт`. `тип_идентификатора` может быть `uid` или `gid`. Параметр `протокол ` принимает значения `tcp` или `udp`. Параметр `порт` указывает номер порта, к которому разрешено привязываться указанному пользователю или группе. Для параметров `идентификатор пользователя`, `идентификатор группы` и `порт` можно использовать только числовые значения.

source: By default, ports below 1024 can only be used by privileged processes which run as `root`. For man:mac_portacl[4] to allow non-privileged processes to bind to ports below 1024, set the following tunables as follows:
ko: 기본적으로 1024 미만의 포트는 `root` 로 실행되는 권한 있는 프로세스만 사용할 수 있습니다. 권한이 없는 프로세스가 1024 미만의 포트에 바인딩할 수 있게 하려면 man:mac_portacl[4]에 다음과 같이 튜너블을 설정하세요:
ru: По умолчанию порты ниже 1024 могут использоваться только привилегированными процессами, работающими от имени `root`. Чтобы разрешить непривилегированным процессам привязываться к портам ниже 1024 с помощью man:mac_portacl[4], задайте следующие настраиваемые параметры следующим образом:

source: To prevent the `root` user from being affected by this policy, set `security.mac.portacl.suser_exempt` to a non-zero value.
ko: `root` 사용자가 이 정책의 영향을 받지 않도록 하려면 `security.mac.portacl.suser_exempt` 를 0이 아닌 값으로 설정하세요.
ru: Чтобы предотвратить влияние этой политики на пользователя `root`, установите `security.mac.portacl.suser_exempt` в ненулевое значение.

source: To allow the `www` user with UID 80 to bind to port 80 without ever needing `root` privilege:
ko: UID 80을 가진 `www` 사용자가 `root` 권한 없이도 포트 80에 바인딩할 수 있도록 허용합니다:
ru: Чтобы пользователь `www` с UID 80 мог привязываться к порту 80 без необходимости в привилегиях `root`:

source: This next example permits the user with the UID of 1001 to bind to TCP ports 110 (POP3) and 995 (POP3s):
ko: 다음 예에서는 UID가 1001인 사용자가 TCP 포트 110(POP3) 및 995(POP3s)에 바인딩할 수 있도록 허용합니다:
ru: Следующий пример разрешает пользователю с UID 1001 привязываться к TCP-портам 110 (POP3) и 995 (POP3s):

source: The MAC Partition Policy
ko: MAC Partition 정책
ru: Политика MAC — разделы процессов

source: Module name: [.filename]#mac_partition.ko#
ko: 모듈 이름: [.filename]#mac_partition.ko#
ru: Имя модуля: [.filename]#mac_partition.ko#

source: Kernel configuration line: `options MAC_PARTITION`
ko: 커널 구성 줄: `options MAC_PARTITION`
ru: Строка конфигурации ядра: `options MAC_PARTITION`

source: Boot option: `mac_partition_load="YES"`
ko: 부팅 옵션: `mac_partition_load="YES"`
ru: Опция загрузки: `mac_partition_load="YES"`

source: The man:mac_partition[4] policy drops processes into specific "partitions" based on their MAC label. Most configuration for this policy is done using man:setpmac[8]. One `sysctl` tunable is available for this policy:
ko: man:mac_partition[4] 정책은 프로세스를 MAC 레이블에 따라 특정 "파티션"으로 드롭합니다. 이 정책에 대한 대부분의 구성은 man:setpmac[8]을 사용하여 수행됩니다. 이 정책에는 하나의 `sysctl` 튜너블을 사용할 수 있습니다:
ru: Политика man:mac_partition[4] помещает процессы в определенные "разделы" на основе их метки MAC. Большая часть настройки этой политики выполняется с помощью man:setpmac[8]. Для этой политики доступна одна настраиваемая переменная `sysctl`:

source: `security.mac.partition.enabled` enables the enforcement of MAC process partitions.
ko: `security.mac.partition.enabled` 는 MAC 프로세스 파티션의 적용을 활성화합니다.
ru: `security.mac.partition.enabled` включает принудительное применение разделов процессов MAC.

source: When this policy is enabled, users will only be permitted to see their processes, and any others within their partition, but will not be permitted to work with utilities outside the scope of this partition. For instance, a user in the `insecure` class will not be permitted to access `top` as well as many other commands that must spawn a process.
ko: 이 정책을 활성화하면 사용자는 자신의 프로세스와 파티션 내의 다른 프로세스를 볼 수 있지만 이 파티션의 범위를 벗어난 유틸리티로 작업할 수 없습니다. 예를 들어, `insecure` 클래스의 사용자는 프로세스를 생성해야 하는 다른 많은 명령뿐만 아니라 `top` 에도 액세스할 수 없습니다.
ru: Когда эта политика включена, пользователи смогут видеть только свои процессы и процессы в своем разделе, но не смогут работать с утилитами за пределами этого раздела. Например, пользователь из класса `insecure` не сможет получить доступ к `top`, а также ко многим другим командам, которые должны запускать процессы.

source: This example adds `top` to the label set on users in the `insecure` class. All processes spawned by users in the `insecure` class will stay in the `partition/13` label.
ko: 이 예에서는 `insecure` 클래스의 사용자에 설정된 레이블에 `top` 을 추가합니다. `insecure` 클래스의 사용자에 의해 생성된 모든 프로세스는 `partition/13` 레이블에 유지됩니다.
ru: В этом примере `top` добавляется к набору меток пользователей в классе `insecure`. Все процессы, запущенные пользователями из класса `insecure`, останутся с меткой `partition/13`.

source: This command displays the partition label and the process list:
ko: 이 명령은 파티션 레이블과 프로세스 목록을 표시합니다:
ru: Эта команда отображает метку раздела и список процессов:

source: This command displays another user's process partition label and that user's currently running processes:
ko: 이 명령은 다른 사용자의 프로세스 파티션 레이블과 해당 사용자의 현재 실행 중인 프로세스를 표시합니다:
ru: Эта команда отображает метку раздела процессов другого пользователя и его текущие запущенные процессы:

source: Users can see processes in ``root``'s label unless the man:mac_seeotheruids[4] policy is loaded.
ko: man:mac_seeotheruids[4] 정책이 로드되지 않는 한 사용자는 ``root`` 의 레이블에서 프로세스를 볼 수 있습니다.
ru: Пользователи могут видеть процессы с меткой ``root``, если не загружена политика man:mac_seeotheruids[4].

source: The MAC Multi-Level Security Module
ko: MAC Multi-Level Security 모듈
ru: Модуль многоуровневой безопасности MAC

source: Module name: [.filename]#mac_mls.ko#
ko: 모듈 이름: [.filename]#mac_mls.ko#
ru: Имя модуля: [.filename]#mac_mls.ko#

source: Kernel configuration line: `options MAC_MLS`
ko: 커널 구성 줄: `options MAC_MLS`
ru: Строка конфигурации ядра: `options MAC_MLS`

source: Boot option: `mac_mls_load="YES"`
ko: 부팅 옵션: `mac_mls_load="YES"`
ru: Параметр загрузки: `mac_mls_load="YES"`

source: The man:mac_mls[4] policy controls access between subjects and objects in the system by enforcing a strict information flow policy.
ko: man:mac_mls[4] 정책은 엄격한 정보 흐름 정책을 적용하여 시스템에서 주체와 객체 간의 액세스를 제어합니다.
ru: Политика man:mac_mls[4] контролирует доступ между субъектами и объектами в системе, применяя строгую политику управления потоком информации.

source: In MLS environments, a "clearance" level is set in the label of each subject or object, along with compartments. Since these clearance levels can reach numbers greater than several thousand, it would be a daunting task to thoroughly configure every subject or object. To ease this administrative overhead, three labels are included in this policy: `mls/low`, `mls/equal`, and `mls/high`, where:
ko: MLS 환경에서는 구획과 함께 각 주체 또는 개체의 라벨에 "클리어런스" 레벨이 설정됩니다. 이러한 클리어런스 수준은 수천 개가 넘는 숫자에 달할 수 있으므로 모든 주체 또는 개체를 철저하게 구성하는 것은 어려운 작업입니다. 이러한 관리 부담을 덜어주기 위해 이 정책에는 세 가지 레이블이 포함되어 있습니다: 'mls/low', 'mls/equal', 'mls/high' 입니다:
ru: В средах MLS в метке каждого субъекта или объекта устанавливается уровень "допуска" вместе с компартментами. Поскольку эти уровни допуска могут достигать значений, превышающих несколько тысяч, тщательная настройка каждого субъекта или объекта была бы сложной задачей. Для снижения административной нагрузки в эту политику включены три метки: `mls/low`, `mls/equal` и `mls/high`, где:

source: Anything labeled with `mls/low` will have a low clearance level and not be permitted to access information of a higher level. This label also prevents objects of a higher clearance level from writing or passing information to a lower level.
ko: `mls/low` 로 레이블이 지정된 모든 항목은 낮은 권한 수준을 가지며 더 높은 수준의 정보에 액세스할 수 없습니다. 또한 이 레이블은 더 높은 수준의 개체가 더 낮은 수준의 개체에 정보를 쓰거나 전달할 수 없도록 차단합니다.
ru: Все объекты, помеченные меткой `mls/low`, будут иметь низкий уровень доступа и не смогут обращаться к информации более высокого уровня. Эта метка также предотвращает запись или передачу информации от объектов с более высоким уровнем доступа к объектам с более низким уровнем.

source: `mls/equal` should be placed on objects which should be exempt from the policy.
ko: 정책에서 제외되어야 하는 객체에는 `mls/equal` 을 설정해야 합니다.
ru: `mls/equal` следует размещать на объектах, которые должны быть освобождены от политики.

source: `mls/high` is the highest level of clearance possible. Objects assigned this label will hold dominance over all other objects in the system; however, they will not permit the leaking of information to objects of a lower class.
ko: `mls/high` 는 가능한 가장 높은 수준의 클리어런스입니다. 이 레이블이 할당된 개체는 시스템의 다른 모든 개체보다 우월한 권한을 갖지만, 하위 클래스의 개체에 대한 정보 유출은 허용하지 않습니다.
ru: `mls/high` — это наивысший возможный уровень допуска. Объекты с этой меткой будут доминировать над всеми остальными объектами в системе; однако они не допустят утечки информации к объектам более низкого класса.

source: MLS provides:
ko: MLS는 다음을 제공합니다:
ru: MLS предоставляет:

source: A hierarchical security level with a set of non-hierarchical categories.
ko: 계층적 보안 수준과 비계층적 카테고리 집합이 포함된 계층적 보안 수준.
ru: Иерархический уровень безопасности с набором неиерархических категорий.

source: Fixed rules of `no read up, no write down`. This means that a subject can have read access to objects on its own level or below, but not above. Similarly, a subject can have write access to objects on its own level or above, but not beneath.
ko: '상향 읽기 금지, 하향 쓰기 금지'의 고정된 규칙. 즉, 주체는 자신의 레벨 이하에 있는 객체에 대한 읽기 액세스 권한을 가질 수 있지만 그 위에는 액세스할 수 없습니다. 마찬가지로, 주체는 자신의 레벨 또는 그 위에 있는 객체에 대한 쓰기 액세스 권한을 가질 수 있지만 그 아래에는 액세스할 수 없습니다.
ru: Фиксированные правила `нет чтения вверх, нет записи вниз`. Это означает, что субъект может иметь право чтения объектов на своём уровне или ниже, но не выше. Аналогично, субъект может иметь право записи объектов на своём уровне или выше, но не ниже.

source: Secrecy, or the prevention of inappropriate disclosure of data.
ko: 비밀 유지 또는 부적절한 데이터 공개 방지.
ru: Секретность, или предотвращение несанкционированного раскрытия данных.

source: A basis for the design of systems that concurrently handle data at multiple sensitivity levels without leaking information between secret and confidential.
ko: 비밀과 기밀 사이의 정보 유출 없이 여러 민감도 수준의 데이터를 동시에 처리하는 시스템 설계를 위한 기반.
ru: Основы проектирования систем, которые одновременно обрабатывают данные с разными уровнями конфиденциальности, не допуская утечки информации между секретными и конфиденциальными данными.

source: The following `sysctl` tunables are available:
ko: 다음과 같은 `sysctl` 튜너블을 사용할 수 있습니다:
ru: Доступны следующие настраиваемые параметры `sysctl`:

source: `security.mac.mls.enabled` is used to enable or disable the MLS policy.
ko: `security.mac.mls.enabled` 는 MLS 정책을 활성화 또는 비활성화하는 데 사용됩니다.
ru: `security.mac.mls.enabled` используется для включения или отключения политики MLS.

source: `security.mac.mls.ptys_equal` labels all man:pty[4] devices as `mls/equal` during creation.
ko: `security.mac.mls.ptys_equal` 은 생성하는 동안 모든 man:pty[4] 디바이스를 `mls/equal` 로 레이블을 지정합니다.
ru: `security.mac.mls.ptys_equal` помечает все устройства man:pty[4] как `mls/equal` при создании.

source: `security.mac.mls.revocation_enabled` revokes access to objects after their label changes to a label of a lower grade.
ko: `security.mac.mls.revocation_enabled` 는 레이블이 더 낮은 등급의 레이블로 변경시킨 후 개체에 대한 액세스를 취소합니다.
ru: `security.mac.mls.revocation_enabled` отзывает доступ к объектам после изменения их метки на метку более низкого уровня целостности.

source: `security.mac.mls.max_compartments` sets the maximum number of compartment levels allowed on a system.
ko: `security.mac.mls.max_compartments` 는 시스템에서 허용되는 최대 구획 레벨 수를 설정합니다.
ru: `security.mac.mls.max_compartments` устанавливает максимальное количество уровней компартментов, разрешенных в системе.

source: To manipulate MLS labels, use man:setfmac[8]. To assign a label to an object:
ko: MLS 레이블을 조작하려면 man:setfmac[8]을 사용합니다. 객체에 레이블을 할당하려면:
ru: Для работы с метками MLS используйте man:setfmac[8]. Чтобы назначить метку объекту:

source: To get the MLS label for the file [.filename]#test#:
ko: [.filename]#test# 파일에 대한 MLS 레이블을 가져오려면:
ru: Чтобы получить метку MLS для файла [.filename]#test#:

source: Another approach is to create a master policy file in [.filename]#/etc/# which specifies the MLS policy information and to feed that file to `setfmac`.
ko: 또 다른 접근 방식은 [.filename]#/etc/# 에 MLS 정책 정보를 지정하는 마스터 정책 파일을 만들고 해당 파일을 `setfmac` 에 제공하는 것입니다.
ru: Другой подход заключается в создании основного файла политики в [.filename]#/etc/#, который определяет информацию о политике MLS, и передаче этого файла в `setfmac`.

source: When using the MLS policy module, an administrator plans to control the flow of sensitive information. The default `block read up block write down` sets everything to a low state. Everything is accessible and an administrator slowly augments the confidentiality of the information.
ko: MLS 정책 모듈을 사용할 때 관리자는 민감한 정보의 흐름을 제어할 계획을 합니다. 기본 '블록 읽기 블록 쓰기' 는 모든 것을 낮은 상태로 설정합니다. 모든 항목에 액세스할 수 있으며 관리자는 정보의 기밀성을 서서히 강화합니다.
ru: При использовании модуля политики MLS администратор планирует контролировать поток конфиденциальной информации. Значение по умолчанию `block read up block write down` устанавливает всё в состояние low. Вся информация доступна, и администратор постепенно повышает её конфиденциальность.

source: Beyond the three basic label options, an administrator may group users and groups as required to block the information flow between them. It might be easier to look at the information in clearance levels using descriptive words, such as classifications of `Confidential`, `Secret`, and `Top Secret`. Some administrators instead create different groups based on project levels. Regardless of the classification method, a well thought out plan must exist before implementing a restrictive policy.
ko: 세 가지 기본 라벨 옵션 외에도 관리자는 필요에 따라 사용자 및 그룹을 그룹화하여 사용자 간의 정보 흐름을 차단할 수 있습니다. `Confidential`, `Secret`, `Top Secret` 과 같은 분류를 사용하면 정보를 등급별로 보기가 더 쉬워질 수 있습니다. 대신 일부 관리자는 프로젝트 레벨에 따라 다른 그룹을 만들기도 합니다. 어떤 분류 방법을 사용하든, 제한적인 정책을 시행하기 전에 신중한 계획이 있어야 합니다.
ru: Помимо трех основных вариантов меток, администратор может группировать пользователей и группы по мере необходимости, чтобы блокировать поток информации между ними. Возможно, будет проще рассматривать информацию на уровнях допуска, используя описательные слова, такие как классификации `Confidential` (`Конфиденциально`), `Secret` (`Секретно`) и `Top Secret` (`Совершенно секретно`). Некоторые администраторы вместо этого создают разные группы на основе уровней проектов. Независимо от метода классификации, перед внедрением ограничительной политики должен существовать продуманный план.

source: Some example situations for the MLS policy module include an e-commerce web server, a file server holding critical company information, and financial institution environments.
ko: MLS 정책 모듈의 몇 가지 예시 상황에는 전자상거래 웹 서버, 중요한 회사 정보를 보관하는 파일 서버, 금융 기관 환경 등이 있습니다.
ru: Некоторые примеры ситуаций для модуля политики MLS включают веб-сервер электронной коммерции, файловый сервер с критически важной информацией компании и среды финансовых учреждений.

source: The MAC Biba Module
ko: MAC Biba 모듈
ru: Модуль MAC Biba

source: Module name: [.filename]#mac_biba.ko#
ko: 모듈 이름: [.filename]#mac_biba.ko#
ru: Имя модуля: [.filename]#mac_biba.ko#

source: Kernel configuration line: `options MAC_BIBA`
ko: 커널 구성 줄: `options MAC_BIBA`
ru: Строка конфигурации ядра: `options MAC_BIBA`

source: Boot option: `mac_biba_load="YES"`
ko: 부팅 옵션: `mac_biba_load="YES"`
ru: Опция загрузки: `mac_biba_load="YES"`

source: The man:mac_biba[4] module loads the MAC Biba policy. This policy is similar to the MLS policy with the exception that the rules for information flow are slightly reversed. This is to prevent the downward flow of sensitive information whereas the MLS policy prevents the upward flow of sensitive information.
ko: man:mac_biba[4] 모듈은 MAC Biba 정책을 로드합니다. 이 정책은 정보 흐름에 대한 규칙이 약간 뒤바뀐다는 점을 제외하면 MLS 정책과 유사합니다. 이는 MLS 정책이 민감한 정보의 하향 흐름을 방지하는 반면, 민감한 정보의 상향 흐름을 방지하기 위한 것입니다.
ru: Модуль man:mac_biba[4] загружает политику MAC Biba. Эта политика похожа на политику MLS, за исключением того, что правила передачи информации слегка изменены в обратном порядке. Это предотвращает поток конфиденциальной информации вниз, тогда как политика MLS предотвращает поток конфиденциальной информации вверх.

source: In Biba environments, an "integrity" label is set on each subject or object. These labels are made up of hierarchical grades and non-hierarchical components. As a grade ascends, so does its integrity.
ko: Biba 환경에서는 각 주제 또는 객체에 "integrity" 레이블이 설정됩니다. 이러한 레이블은 계층적 성적과 비계층적 구성 요소로 구성됩니다. 등급이 올라갈수록 무결성도 높아집니다.
ru: В средах Biba для каждого субъекта или объекта устанавливается метка «целостности». Эти метки состоят из иерархических уровней целостности и неиерархических компонентов. По мере повышения уровня увеличивается и его целостность.

source: Supported labels are `biba/low`, `biba/equal`, and `biba/high`, where:
ko: 지원되는 레이블은 `biba/low`, `biba/equal`, `biba/high` 이며, 여기서:
ru: Поддерживаемые метки: `biba/low`, `biba/equal` и `biba/high`, где:

source: `biba/low` is considered the lowest integrity an object or subject may have. Setting this on objects or subjects blocks their write access to objects or subjects marked as `biba/high`, but will not prevent read access.
ko: `biba/low` 는 객체 또는 주체가 가질 수 있는 가장 낮은 무결성으로 간주됩니다. 객체 또는 주체에 이 값을 설정하면 `biba/high` 로 표시된 객체 또는 주체에 대한 쓰기 액세스가 차단되지만 읽기 액세스는 차단되지 않습니다.
ru: `biba/low` считается самой низкой целостностью, которую может иметь объект или субъект. Установка этого уровня на объекты или субъекты блокирует их запись в объекты или субъекты с меткой `biba/high`, но не предотвращает чтение.

source: `biba/equal` should only be placed on objects considered to be exempt from the policy.
ko: `biba/equal` 는 정책에서 제외되는 것으로 간주되는 객체에만 배치해야 합니다.
ru: `biba/equal` следует размещать только на объектах, которые считаются исключёнными из политики.

source: `biba/high` permits writing to objects set at a lower label, but does not permit reading that object. It is recommended that this label be placed on objects that affect the integrity of the entire system.
ko: `biba/high` 는 하위 레이블로 설정된 개체에 대한 쓰기는 허용하지만 해당 개체에 대한 읽기는 허용하지 않습니다. 이 레이블은 전체 시스템의 무결성에 영향을 미치는 개체에 설정하는 것이 좋습니다.
ru: `biba/high` разрешает запись в объекты с более низкой меткой, но запрещает чтение этих объектов. Рекомендуется устанавливать эту метку для объектов, которые влияют на целостность всей системы.

source: Biba provides:
ko: Biba는 다음을 제공합니다:
ru: Biba обеспечивает:

source: Hierarchical integrity levels with a set of non-hierarchical integrity categories.
ko: 계층적 무결성 수준과 비계층적 무결성 카테고리가 포함된 계층적 무결성 수준.
ru: Иерархические уровни целостности с набором неиерархических категорий целостности.

source: Fixed rules are `no write up, no read down`, the opposite of MLS. A subject can have write access to objects on its own level or below, but not above. Similarly, a subject can have read access to objects on its own level or above, but not below.
ko: '상향 쓰기 금지, 하향 읽기 금지'의 고정된 규칙, MLS와 반대입니다. 주체는 자신의 수준 이하에 있는 개체에 대한 쓰기 권한을 가질 수 있지만 그 위에는 접근할 수 없습니다. 마찬가지로 주체는 자신의 수준 또는 그 위에 있는 객체에 대한 읽기 액세스 권한을 가질 수 있지만 그 아래에는 액세스할 수 없습니다.
ru: Фиксированные правила — это `нет записи вверх, нет чтения вниз`, что противоположно MLS. Субъект может иметь право записи в объекты на своём уровне или ниже, но не выше. Аналогично, субъект может иметь право чтения объектов на своём уровне или выше, но не ниже.

source: Integrity by preventing inappropriate modification of data.
ko: 데이터의 부적절한 수정을 방지하여 무결성을 유지.
ru: Целостность за счет предотвращения нежелательного изменения данных.

source: Integrity levels instead of MLS sensitivity levels.
ko: MLS 민감도 수준 대신 무결성 수준.
ru: Уровни целостности вместо уровней чувствительности MLS.

source: The following tunables can be used to manipulate the Biba policy:
ko: 다음 튜너블을 사용하여 Biba 정책을 조작할 수 있습니다:
ru: Следующие настраиваемые параметры могут быть использованы для управления политикой Biba:

source: `security.mac.biba.enabled` is used to enable or disable enforcement of the Biba policy on the target machine.
ko: `security.mac.biba.enabled` 는 대상 머신에서 비바 정책의 적용을 활성화 또는 비활성화하는 데 사용됩니다.
ru: `security.mac.biba.enabled` используется для включения или отключения принудительного применения политики Biba на целевой машине.

source: `security.mac.biba.ptys_equal` is used to disable the Biba policy on man:pty[4] devices.
ko: `security.mac.biba.ptys_equal` 은 man:pty[4] 장치에서 Biba 정책을 비활성화하는 데 사용됩니다.
ru: `security.mac.biba.ptys_equal` используется для отключения политики Biba на устройствах man:pty[4].

source: `security.mac.biba.revocation_enabled` forces the revocation of access to objects if the label is changed to dominate the subject.
ko: `security.mac.biba.revocation_enabled` 는 레이블이 주체를 지배하도록 변경한 경우 개체에 대한 액세스 권한을 강제로 취소합니다.
ru: `security.mac.biba.revocation_enabled` принудительно отзывает доступ к объектам, если их метка изменяется так, чтобы доминировать над субъектом.

source: To access the Biba policy setting on system objects, use `setfmac` and `getfmac`:
ko: 시스템 개체의 Biba 정책 설정에 액세스하려면 `setfmac` 및 `getfmac` 을 사용합니다:
ru: Для доступа к настройкам политики Biba для системных объектов используйте `setfmac` и `getfmac`:

source: Integrity, which is different from sensitivity, is used to guarantee that information is not manipulated by untrusted parties. This includes information passed between subjects and objects. It ensures that users will only be able to modify or access information they have been given explicit access to. The man:mac_biba[4] security policy module permits an administrator to configure which files and programs a user may see and invoke while assuring that the programs and files are trusted by the system for that user.
ko: 민감도와는 다른 무결성은, 신뢰할 수 없는 당사자가 정보를 조작하지 못하도록 보장하는 데 사용됩니다. 여기에는 주체와 객체 간에 전달되는 정보가 포함됩니다. 이는 사용자가 명시적으로 액세스 권한이 부여된 정보만 수정하거나 액세스할 수 있도록 보장합니다. 관리자는 man:mac_biba[4] 보안 정책 모듈을 사용하여 사용자가 보고 호출할 수 있는 파일과 프로그램을 구성하는 동시에 해당 사용자를 위해 시스템에서 해당 프로그램과 파일을 신뢰할 수 있도록 보장할 수 있습니다.
ru: Целостность, которая отличается от конфиденциальности, используется для гарантии того, что информация не будет изменена ненадёжными сторонами. Это включает информацию, передаваемую между субъектами и объектами. Она обеспечивает пользователям возможность изменять или получать доступ только к той информации, к которой у них есть явный доступ. Модуль политики безопасности man:mac_biba[4] позволяет администратору настроить, какие файлы и программы пользователь может просматривать и запускать, гарантируя, что эти программы и файлы считаются системой доверенными для данного пользователя.
