Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: This chapter focuses on the MAC framework and the set of pluggable security policy modules FreeBSD provides for enabling various security mechanisms
ko: 이 장에서는 다양한 보안 메커니즘을 활성화하기 위해 FreeBSD가 제공하는 MAC 프레임워크와 플러그 가능한 보안 정책 모듈 세트에 중점을 둡니다
ru: Эта глава посвящена инфраструктуре MAC и набору модулей политики безопасности, предоставляемых FreeBSD для включения различных механизмов безопасности

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 18. Mandatory Access Control
ko: 18장. 필수 액세스 제어 (Mandatory Access Control)
ru: Глава 18. Принудительное управление доступом (MAC)

source: Mandatory Access Control
ru: Принудительный контроль доступа (MAC)

source: Synopsis
ko: 요약
ru: Обзор

source: FreeBSD supports security extensions based on the POSIX(R).1e draft. These security mechanisms include file system Access Control Lists (crossref:security[fs-acl,“Access Control Lists”]) and Mandatory Access Control (MAC). MAC allows access control modules to be loaded in order to implement security policies. Some modules provide protections for a narrow subset of the system, hardening a particular service. Others provide comprehensive labeled security across all subjects and objects. The mandatory part of the definition indicates that enforcement of controls is performed by administrators and the operating system. This is in contrast to the default security mechanism of Discretionary Access Control (DAC) where enforcement is left to the discretion of users.
ko: FreeBSD는 POSIX(R).1e 초안에 기반한 보안 확장을 지원합니다. 이러한 보안 메커니즘에는 파일 시스템 접근 제어 목록(crossref:security[fs-acl,“Access Control Lists”])과 필수 접근 제어(MAC)가 포함됩니다. MAC을 사용하면 보안 정책을 구현하기 위해 액세스 제어 모듈을 로드할 수 있습니다. 일부 모듈은 시스템의 좁은 하위 집합에 대한 보호 기능을 제공하여 특정 서비스를 강화합니다. 다른 모듈은 모든 주체와 객체에 대해 포괄적인 레이블이 지정된 보안을 제공합니다. 정의의 필수 부분은 제어의 시행이 관리자와 운영 체제에 의해 수행됨을 나타냅니다. 이는 시행이 사용자의 재량에 맡겨지는 DAC(임의 액세스 제어)의 기본 보안 메커니즘과 대조적입니다.
ru: FreeBSD поддерживает расширения безопасности, основанные на документах POSIX(R).1e. Эти механизмы безопасности включают списки контроля доступа к файловой системе (crossref:security[fs-acl,“Списки контроля доступа”]) и принудительный контроль доступа (MAC). MAC позволяет загружать модули контроля доступа для реализации политик безопасности. Некоторые модули обеспечивают защиту узкого подмножества системы, укрепляя определённую службу. Другие предоставляют всеобъемлющую безопасность с метками на всех субъектах и объектах. Обязательная часть определения указывает на то, что применение контроля осуществляется администраторами и операционной системой. Это отличается от механизма безопасности по умолчанию — обычного контроля доступа (Discretionary Access Control, DAC), где применение контроля остаётся на усмотрение пользователей.

source: This chapter focuses on the MAC framework and the set of pluggable security policy modules FreeBSD provides for enabling various security mechanisms.
ko: 이 장에서는 MAC 프레임워크와 다양한 보안 메커니즘을 활성화하기 위해 FreeBSD가 제공하는 플러그 가능한 보안 정책 모듈 세트에 중점을 둡니다.
ru: Эта глава посвящена инфраструктуре MAC и набору модулей политики безопасности, предоставляемых FreeBSD для включения различных механизмов безопасности.

source: After reading this chapter, you will know:
ko: 이 장을 읽고 나면 다음을 알 수 있습니다:
ru: Прочитав эту главу, вы будете знать:

source: The terminology associated with the MAC framework.
ko: MAC 프레임워크와 관련된 용어.
ru: Терминология, связанная с инфраструктурой MAC.

source: The capabilities of MAC security policy modules as well as the difference between a labeled and non-labeled policy.
ko: MAC 보안 정책 모듈의 능력과 레이블이 지정된 정책과 레이블이 지정되지 않은 정책의 차이점.
ru: Возможности модулей политики безопасности MAC, а также разница между политикой с метками и без меток.

source: The considerations to take into account before configuring a system to use the MAC framework.
ko: MAC 프레임워크를 사용하도록 시스템을 구성하기 전에 고려해야 할 사항.
ru: Соображения, которые необходимо учитывать перед настройкой системы для использования инфраструктуры MAC.

source: Which MAC security policy modules are included in FreeBSD and how to configure them.
ko: FreeBSD에 포함된 MAC 보안 정책 모듈과 이를 구성하는 방법.
ru: Какие модули политики безопасности MAC включены в FreeBSD и как их настроить.

source: How to implement a more secure environment using the MAC framework.
ko: MAC 프레임워크를 사용하여 더욱 안전한 환경을 구현하는 방법.
ru: Как реализовать более безопасную среду с использованием инфраструктуры MAC.

source: How to test the MAC configuration to ensure the framework has been properly implemented.
ko: 프레임워크가 제대로 구현되었는지 확인하기 위해 MAC 구성을 테스트하는 방법.
ru: Как проверить конфигурацию MAC, чтобы убедиться в правильном использовании инфраструктуры.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 알아두어야 할 사항입니다:
ru: Прежде чем читать эту главу, вы должны:

source: Understand UNIX(R) and FreeBSD basics (crossref:basics[basics,FreeBSD Basics]).
ko: UNIX(R) 및 FreeBSD 기본 사항을 이해합니다(crossref:basics[basics,FreeBSD Basics]).
ru: Понимать основы UNIX(R) и FreeBSD (crossref:basics[basics,Основы FreeBSD]).

source: Have some familiarity with security and how it pertains to FreeBSD (crossref:security[security,Security]).
ko: 보안과 그것이 FreeBSD와 어떻게 관련되어 있는지 어느 정도 알고 있어야 합니다(crossref:security[security,Security]).
ru: Иметь некоторое представление о безопасности и о том, как она относится к FreeBSD (crossref:security[security,Безопасность]).

source: Improper MAC configuration may cause loss of system access, aggravation of users, or inability to access the features provided by Xorg. More importantly, MAC should not be relied upon to completely secure a system. The MAC framework only augments an existing security policy. Without sound security practices and regular security checks, the system will never be completely secure.
ko: 부적절한 MAC 구성은 시스템 액세스 손실, 사용자 성능 저하 또는 Xorg가 제공하는 기능에 대한 액세스 불능을 초래할 수 있습니다. 더 중요한 것은 MAC이 시스템을 완전히 보호하는 데 의존해서는 안 된다는 것입니다. MAC 프레임워크는 기존 보안 정책을 보강할 뿐입니다. 건전한 보안 관행과 정기적인 보안 점검 없이는 시스템을 완벽하게 보호할 수 없습니다.
ru: Неправильная настройка MAC может привести к потере доступа к системе, недовольству пользователей или невозможности использования функций, предоставляемых Xorg. Важно отметить, что нельзя полагаться исключительно на MAC для полной защиты системы. Инфраструктура MAC лишь дополняет существующую политику безопасности. Без грамотных мер безопасности и регулярных проверок система никогда не будет полностью защищена.

source: The examples contained within this chapter are for demonstration purposes and the example settings should _not_ be implemented on a production system. Implementing any security policy takes a good deal of understanding, proper design, and thorough testing.
ko: 이 장에 포함된 예제는 데모용이며 예제 설정은 프로덕션 시스템에서 구현해서는 _안 됩니다_ . 보안 정책을 구현하려면 많은 이해와 적절한 설계, 철저한 테스트가 필요합니다.
ru: Примеры, приведённые в этой главе, предназначены для демонстрации, и их настройки _не_ следует применять в рабочей системе. Внедрение любой политики безопасности требует глубокого понимания, правильного проектирования и тщательного тестирования.

source: While this chapter covers a broad range of security issues relating to the MAC framework, the development of new MAC security policy modules will not be covered. A number of security policy modules included with the MAC framework have specific characteristics which are provided for both testing and new module development. Refer to man:mac_test[4], man:mac_stub[4] and man:mac_none[4] for more information on these security policy modules and the various mechanisms they provide.
ko: 이 장에서는 MAC 프레임워크와 관련된 광범위한 보안 문제를 다루지만, 새로운 MAC 보안 정책 모듈의 개발은 다루지 않습니다. MAC 프레임워크에 포함된 여러 보안 정책 모듈에는 테스트와 새 모듈 개발 모두를 위해 제공되는 특성이 있습니다. 이러한 보안 정책 모듈과 이 모듈이 제공하는 다양한 메커니즘에 대한 자세한 내용은 man:mac_test[4], man:mac_stub[4] 및 man:mac_none[4]을 참조하세요.
ru: Хотя в этой главе рассматривается широкий спектр вопросов безопасности, связанных с инфраструктурой MAC, разработка новых модулей политики безопасности MAC не будет освещена. Ряд модулей политики безопасности, включенных в фреймворк MAC, обладают специфическими характеристиками, которые предоставляются как для тестирования, так и для разработки новых модулей. Дополнительную информацию об этих модулях политики безопасности и предоставляемых ими механизмах можно найти в man:mac_test[4], man:mac_stub[4] и man:mac_none[4].

source: Key Terms
ko: 핵심 용어
ru: Ключевые термины

source: The following key terms are used when referring to the MAC framework:
ko: MAC 프레임워크를 언급할 때 사용되는 주요 용어는 다음과 같습니다:
ru: В документации FreeBSD при обращении к инфраструктуре MAC используются следующие ключевые термины:

source: _compartment_: a set of programs and data to be partitioned or separated, where users are given explicit access to specific component of a system. A compartment represents a grouping, such as a work group, department, project, or topic. Compartments make it possible to implement a need-to-know-basis security policy.
ko: _compartment_ : 분할 또는 분리할 프로그램과 데이터의 집합으로, 사용자에게 시스템의 특정 구성 요소에 대한 명시적 액세스 권한이 부여됩니다. 구획은 작업 그룹, 부서, 프로젝트 또는 주제와 같은 그룹을 나타냅니다. 구획을 사용하면 알아야 할 필요 기반 보안 정책을 구현할 수 있습니다.
ru: _компартмент (compartment)_: набор программ и данных, которые должны быть разделены или изолированы, при этом пользователи получают явный доступ к определенным компонентам системы. Компартмент представляет собой группу, такую как рабочая группа, отдел, проект или тема. Компартменты позволяют реализовать политику безопасности на основе принципа "необходимо знать".

source: _integrity_: the level of trust which can be placed on data. As the integrity of the data is elevated, so does the ability to trust that data.
ko: _integrity_ : 데이터에 대해 신뢰할 수 있는 수준. 데이터의 무결성이 높아질수록 해당 데이터의 신뢰도도 높아집니다.
ru: _целостность (integrity)_: уровень доверия, который может быть оказан данным. По мере повышения целостности данных возрастает и возможность доверять этим данным.

source: _level_: the increased or decreased setting of a security attribute. As the level increases, its security is considered to elevate as well.
ko: _level_ : 보안 속성의 증가 또는 감소된 설정입니다. 레벨이 높아지면 보안도 높아지는 것으로 간주합니다.
ru: _уровень (level)_: увеличенное или уменьшенное значение атрибута безопасности. По мере повышения уровня его безопасность также считается более высокой.

source: _label_: a security attribute which can be applied to files, directories, or other items in the system. It could be considered a confidentiality stamp. When a label is placed on a file, it describes the security properties of that file and will only permit access by files, users, and resources with a similar security setting. The meaning and interpretation of label values depends on the policy configuration. Some policies treat a label as representing the integrity or secrecy of an object while other policies might use labels to hold rules for access.
ko: _label_ : 시스템의 파일, 디렉터리 또는 기타 항목에 적용할 수 있는 보안 속성입니다. 기밀성 스탬프로 간주할 수 있습니다. 파일에 레이블을 지정하면 해당 파일의 보안 속성을 설명하며 유사한 보안 설정을 가진 파일, 사용자 및 리소스에 대해서만 액세스를 허용합니다. 레이블 값의 의미와 해석은 정책 구성에 따라 다릅니다. 일부 정책에서는 레이블을 개체의 무결성 또는 기밀성을 나타내는 것으로 취급하는 반면, 다른 정책에서는 레이블을 사용하여 액세스 규칙을 정할 수 있습니다.
ru: _метка (label)_: атрибут безопасности, который может быть применён к файлам, каталогам или другим элементам системы. Его можно рассматривать как штамп конфиденциальности. Когда метка назначается файлу, она описывает его свойства безопасности и разрешает доступ только файлам, пользователям и ресурсам с аналогичными настройками безопасности. Значение и интерпретация меток зависят от конфигурации политики. Некоторые политики рассматривают метку как показатель целостности или секретности объекта, тогда как другие могут использовать метки для хранения правил доступа.

source: _multilabel_: this property is a file system option which can be set in single-user mode using man:tunefs[8], during boot using man:fstab[5], or during the creation of a new file system. This option permits an administrator to apply different MAC labels on different objects. This option only applies to security policy modules which support labeling.
ko: _multilabel_ : 이 속성은 단일 사용자 모드에서 man:tunefs[8]를 사용하거나, 부팅 중에 man:fstab[5]을 사용하거나, 새 파일 시스템을 생성하는 동안 설정할 수 있는 파일 시스템 옵션입니다. 이 옵션을 사용하면 관리자가 여러 개체에 서로 다른 MAC 레이블을 적용할 수 있습니다. 이 옵션은 라벨링을 지원하는 보안 정책 모듈에만 적용됩니다.
ru: _множественные метки (multilabel)_: это свойство является параметром файловой системы, которое можно установить в однопользовательском режиме с помощью man:tunefs[8], во время загрузки с использованием man:fstab[5] или при создании новой файловой системы. Эта опция позволяет администратору применять различные метки MAC к разным объектам. Данная опция применяется только к модулям политики безопасности, которые поддерживают маркировку метками (далее — маркировку).

source: _single label_: a policy where the entire file system uses one label to enforce access control over the flow of data. Whenever `multilabel` is not set, all files will conform to the same label setting.
ko: _single label_ : 전체 파일 시스템에서 하나의 레이블을 사용하여 데이터 흐름에 대한 액세스 제어를 적용하는 정책입니다. `multilabel` 을 설정하지 않으면 모든 파일이 동일한 레이블 설정을 따르게 됩니다.
ru: _одиночная метка (single label)_: политика, при которой вся файловая система использует одну метку для контроля доступа к потокам данных. Если параметр `multilabel` не установлен, все файлы будут соответствовать одной и той же настройке метки.

source: _object_: an entity through which information flows under the direction of a _subject_. This includes directories, files, fields, screens, keyboards, memory, magnetic storage, printers or any other data storage or moving device. An object is a data container or a system resource. Access to an object effectively means access to its data.
ko: _object_ : _주체_ 의 지시에 따라 정보가 흐르는 개체를 말합니다. 여기에는 디렉터리, 파일, 필드, 화면, 키보드, 메모리, 자기 저장 장치, 프린터 또는 기타 데이터 저장 또는 이동 장치가 포함됩니다. 객체는 데이터 컨테이너 또는 시스템 리소스입니다. 객체에 대한 액세스는 사실상 해당 데이터에 대한 액세스를 의미합니다.
ru: _объект (object)_: сущность, через которую информация передается под управлением _субъекта_. Это включает каталоги, файлы, поля, экраны, клавиатуры, память, магнитные накопители, принтеры или любые другие устройства хранения или передачи данных. Объект является контейнером данных или системным ресурсом. Доступ к объекту фактически означает доступ к его данным.

source: _subject_: any active entity that causes information to flow between _objects_ such as a user, user process, or system process. On FreeBSD, this is almost always a thread acting in a process on behalf of a user.
ko: _subject_ : 사용자, 사용자 프로세스 또는 시스템 프로세스와 같은 _객체_ 간에 정보를 흐르게 하는 모든 활성 엔티티입니다. FreeBSD에서는 거의 항상 사용자를 대신하여 프로세스에서 작동하는 스레드가 해당됩니다.
ru: _субъект (subject)_: любая активная сущность, вызывающая передачу информации между _объектами_, например, пользователь, пользовательский процесс или системный процесс. В FreeBSD это почти всегда поток, действующий в процессе от имени пользователя.

source: _policy_: a collection of rules which defines how objectives are to be achieved. A policy usually documents how certain items are to be handled. This chapter considers a policy to be a collection of rules which controls the flow of data and information and defines who has access to that data and information.
ko: _policy_ : 목표를 달성하는 방법을 정의하는 규칙 모음입니다. 정책은 일반적으로 특정 항목을 처리하는 방법을 문서화합니다. 이 장에서는 정책을 데이터와 정보의 흐름을 제어하고 해당 데이터와 정보에 액세스할 수 있는 사용자를 정의하는 규칙 모음으로 간주합니다.
ru: _политика (policy)_: набор правил, определяющий, как достичь поставленных целей. Политика обычно документирует, каким образом следует обращаться с определёнными элементами. В этой главе под политикой понимается набор правил, контролирующих поток данных и информации, а также определяющих, кто имеет доступ к этим данным и информации.

source: _high-watermark_: this type of policy permits the raising of security levels for the purpose of accessing higher level information. In most cases, the original level is restored after the process is complete. Currently, the FreeBSD MAC framework does not include this type of policy.
ko: _high-watermark_ : 이 유형의 정책은 더 높은 수준의 정보에 액세스할 목적으로 보안 수준을 높일 수 있도록 허용합니다. 대부분의 경우, 프로세스가 완료된 후 원래 수준으로 복원됩니다. 현재 FreeBSD MAC 프레임워크에는 이 유형의 정책이 포함되어 있지 않습니다.
ru: _верхний уровень (high-watermark)_: этот тип политики позволяет повышать уровни безопасности для доступа к информации более высокого уровня. В большинстве случаев исходный уровень восстанавливается после завершения процесса. В настоящее время в инфраструктуре MAC в FreeBSD отсутствует такой тип политики.

source: _low-watermark_: this type of policy permits lowering security levels for the purpose of accessing information which is less secure. In most cases, the original security level of the user is restored after the process is complete. The only security policy module in FreeBSD to use this is man:mac_lomac[4].
ko: _low-watermark_ : 이 유형의 정책은 보안 수준이 낮은 정보에 액세스할 목적으로 보안 수준을 낮추는 것을 허용합니다. 대부분의 경우, 프로세스가 완료된 후 사용자의 원래 보안 수준이 복원됩니다. 이를 사용할 수 있는 FreeBSD의 유일한 보안 정책 모듈은 man:mac_lomac[4]입니다.
ru: _нижний уровень (low-watermark)_: этот тип политики позволяет понижать уровни безопасности для доступа к информации с более низким уровнем защиты. В большинстве случаев исходный уровень безопасности пользователя восстанавливается после завершения процесса. Единственный модуль политики безопасности в FreeBSD, использующий этот подход, — это man:mac_lomac[4].

source: _sensitivity_: usually used when discussing Multilevel Security (MLS). A sensitivity level describes how important or secret the data should be. As the sensitivity level increases, so does the importance of the secrecy, or confidentiality, of the data.
ko: _sensitivity_ : 일반적으로 다단계 보안(Multilevel Security, MLS)을 논의할 때 사용됩니다. 민감도 수준은 데이터가 얼마나 중요하거나 비밀이어야 하는지를 설명합니다. 민감도 수준이 높아질수록 데이터의 비밀성 또는 기밀성의 중요성도 높아집니다.
ru: _ чувствительность (sensivity)_: обычно используется при обсуждении Многоуровневой Безопасности (Multilevel Security, MLS). Уровень чувствительности описывает, насколько важными или секретными должны быть данные. По мере увеличения уровня чувствительности возрастает и важность секретности, или конфиденциальности, данных.

source: Understanding MAC Labels
ko: MAC 레이블 이해하기
ru: Метки MAC

source: A MAC label is a security attribute which may be applied to subjects and objects throughout the system. When setting a label, the administrator must understand its implications in order to prevent unexpected or undesired behavior of the system. The attributes available on an object depend on the loaded policy module, as policy modules interpret their attributes in different ways.
ko: MAC 레이블은 시스템 전체의 주체와 객체에 적용될 수 있는 보안 속성입니다. 레이블을 설정할 때 관리자는 시스템의 예기치 않거나 원치 않는 동작을 방지하기 위해 그 의미를 이해해야 합니다. 정책 모듈은 각기 다른 방식으로 속성을 해석하므로 개체에 사용할 수 있는 속성은 로드된 정책 모듈에 따라 달라집니다.
ru: Метка MAC — это атрибут безопасности, который может быть применён к субъектам и объектам в системе. При установке метки администратор должен понимать её последствия, чтобы избежать неожиданного или нежелательного поведения системы. Доступные атрибуты объекта зависят от загруженного модуля политики, так как модули политики интерпретируют свои атрибуты по-разному.

source: The security label on an object is used as a part of a security access control decision by a policy. With some policies, the label contains all of the information necessary to make a decision. In other policies, the labels may be processed as part of a larger rule set.
ko: 개체의 보안 레이블은 정책에 의한 보안 액세스 제어 결정의 일부로 사용됩니다. 일부 정책에서는 레이블에 결정을 내리는 데 필요한 모든 정보가 포함되어 있습니다. 다른 정책에서는 레이블이 더 큰 규칙 집합의 일부로 처리될 수 있습니다.
ru: Метка безопасности объекта используется как часть решения по контролю доступа в соответствии с политикой. В некоторых политиках метка содержит всю информацию, необходимую для принятия решения. В других политиках метки могут обрабатываться как часть более обширного набора правил.

source: There are two types of label policies: single label and multi label. By default, the system will use single label. The administrator should be aware of the pros and cons of each in order to implement policies which meet the requirements of the system's security model.
ko: 레이블 정책에는 단일 레이블과 다중 레이블의 두 가지 유형이 있습니다. 기본적으로 시스템은 단일 레이블을 사용합니다. 관리자는 시스템 보안 모델의 요구 사항을 충족하는 정책을 구현하기 위해 각각의 장단점을 알고 있어야 합니다.
ru: Существует два типа политик меток: одноуровневые и многоуровневые. По умолчанию система использует одноуровневые метки. Администратор должен учитывать преимущества и недостатки каждого типа, чтобы реализовать политики, соответствующие требованиям модели безопасности системы.

source: A single label security policy only permits one label to be used for every subject or object. Since a single label policy enforces one set of access permissions across the entire system, it provides lower administration overhead, but decreases the flexibility of policies which support labeling. However, in many environments, a single label policy may be all that is required.
ko: 단일 레이블 보안 정책은 모든 대상 또는 개체에 대해 하나의 레이블만 사용할 수 있도록 허용합니다. 단일 레이블 정책은 전체 시스템에 하나의 액세스 권한 세트를 적용하므로 관리 오버헤드가 줄어들지만 레이블을 지원하는 정책의 유연성이 떨어집니다. 그러나 많은 환경에서는 단일 레이블 정책으로 충분할 수도 있습니다.
ru: Политика безопасности с одной меткой разрешает использование только одной метки для каждого субъекта или объекта. Поскольку политика с одной меткой применяет единый набор прав доступа во всей системе, это снижает нагрузку на администрирование, но уменьшает гибкость политик, поддерживающих маркировку. Однако во многих средах политика с одной меткой может быть всем, что требуется.

source: A single label policy is somewhat similar to DAC as `root` configures the policies so that users are placed in the appropriate categories and access levels. A notable difference is that many policy modules can also restrict `root`. Basic control over objects will then be released to the group, but `root` may revoke or modify the settings at any time.
ko: 단일 레이블 정책은 사용자가 적절한 카테고리와 액세스 수준에 배치되도록 정책을 구성하기 때문에 DAC와 다소 유사합니다. 주목할 만한 차이점은 많은 정책 모듈이 `root` 를 제한할 수도 있다는 것입니다. 그러면 개체에 대한 기본 제어 권한이 그룹으로 풀리지만 `root` 는 언제든지 설정을 취소하거나 수정할 수 있습니다.
ru: Политика с одной меткой несколько похожа на DAC, поскольку `root` настраивает политики так, чтобы пользователи попадали в соответствующие категории и уровни доступа. Заметное отличие заключается в том, что многие модули политики также могут ограничивать пользователя `root`. Базовый контроль над объектами затем передаётся группе, но `root` может отозвать или изменить настройки в любое время.

source: When appropriate, a multi label policy can be set on a UFS file system by passing `multilabel` to man:tunefs[8]. A multi label policy permits each subject or object to have its own independent MAC label. The decision to use a multi label or single label policy is only required for policies which implement the labeling feature, such as `biba`, `lomac`, and `mls`. Some policies, such as `seeotheruids`, `portacl` and `partition`, do not use labels at all.
ko: 적절한 경우, man:tunefs[8]에 `multilabel` 을 전달하여 UFS 파일 시스템에 다중 레이블 정책을 설정할 수 있습니다. 다중 레이블 정책을 사용하면 각 주체 또는 오브젝트가 독립적인 MAC 레이블을 가질 수 있습니다. 다중 레이블 또는 단일 레이블 정책을 사용할지 여부는 `biba`, `lomac`, `mls` 와 같은 레이블 기능을 구현하는 정책에만 필요합니다. `seeotheruids`, `portacl`, `partition` 과 같은 일부 정책은 레이블을 전혀 사용하지 않습니다.
ru: Когда это уместно, политику с несколькими метками можно установить на файловой системе UFS, передав `multilabel` в man:tunefs[8]. Политика с несколькими метками позволяет каждому субъекту или объекту иметь свою собственную независимую метку MAC. Решение использовать политику с несколькими метками или одной меткой требуется только для политик, реализующих функцию маркировки, таких как `biba`, `lomac` и `mls`. Некоторые политики, такие как `seeotheruids`, `portacl` и `partition`, вообще не используют метки.
