Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: The overhead is minimal when compared to the lasting effect of a framework which provides the ability to pick and choose which policies are required for a specific configuration and which keeps performance overhead down. The reduction of support for unneeded policies can increase the overall performance of the system as well as offer flexibility of choice. A good implementation would consider the overall security requirements and effectively implement the various security policy modules offered by the framework.
ko: 오버헤드는 특정 구성에 필요한 정책을 선택할 수 있는 기능을 제공하고 성능 오버헤드를 낮추는 프레임워크의 지속적인 효과와 비교하면 미미합니다. 불필요한 정책에 대한 지원을 줄이면 시스템의 전반적인 성능이 향상될 뿐만 아니라 선택의 유연성을 제공할 수 있습니다. 올바른 구현은 전반적인 보안 요구 사항을 고려하고 프레임워크에서 제공하는 다양한 보안 정책 모듈을 효과적으로 구현하는 것입니다.
ru: Накладные расходы минимальны по сравнению с долгосрочным эффектом от инфраструктуры, который предоставляет возможность выбирать необходимые политики для конкретной конфигурации и минимизирует снижение производительности. Уменьшение поддержки ненужных политик может повысить общую производительность системы, а также обеспечить гибкость выбора. Хорошая реализация должна учитывать общие требования безопасности и эффективно внедрять различные модули политик безопасности, предоставляемые инфраструктурой.

source: A system utilizing MAC guarantees that a user will not be permitted to change security attributes at will. All user utilities, programs, and scripts must work within the constraints of the access rules provided by the selected security policy modules and control of the MAC access rules is in the hands of the system administrator.
ko: MAC을 사용하는 시스템은 사용자가 보안 속성을 마음대로 변경할 수 없도록 보장합니다. 모든 사용자 유틸리티, 프로그램 및 스크립트는 선택한 보안 정책 모듈에서 제공하는 액세스 규칙의 제약 내에서 작동해야 하며, MAC 액세스 규칙의 제어는 시스템 관리자의 손에 달려 있습니다.
ru: Система, использующая MAC, гарантирует, что пользователь не сможет по своему желанию изменять атрибуты безопасности. Все пользовательские утилиты, программы и скрипты должны работать в рамках ограничений, установленных правилами доступа выбранных модулей политики безопасности, а управление правилами доступа MAC находится в руках системного администратора.

source: It is the duty of the system administrator to carefully select the correct security policy modules. For an environment that needs to limit access control over the network, the man:mac_portacl[4], man:mac_ifoff[4], and man:mac_biba[4] policy modules make good starting points. For an environment where strict confidentiality of file system objects is required, consider the man:mac_bsdextended[4] and man:mac_mls[4] policy modules.
ko: 올바른 보안 정책 모듈을 신중하게 선택하는 것은 시스템 관리자의 의무입니다. 네트워크를 통한 접근 제어를 제한해야 하는 환경의 경우 man:mac_portacl[4], man:mac_ifoff[4] 및 man:mac_biba[4] 정책 모듈이 좋은 출발점이 될 수 있습니다. 파일 시스템 개체에 대한 엄격한 기밀성이 필요한 환경에서는 man:mac_bsdextended[4] 및 man:mac_mls[4] 정책 모듈을 고려하세요.
ru: Обязанностью системного администратора является тщательный выбор подходящих модулей политики безопасности. Для среды, где требуется ограничить контроль доступа по сети, модули политик man:mac_portacl[4], man:mac_ifoff[4] и man:mac_biba[4] могут стать хорошей отправной точкой. В среде, где необходима строгая конфиденциальность объектов файловой системы, следует рассмотреть модули политик man:mac_bsdextended[4] и man:mac_mls[4].

source: Policy decisions could be made based on network configuration. If only certain users should be permitted access to man:ssh[1], the man:mac_portacl[4] policy module is a good choice. In the case of file systems, access to objects might be considered confidential to some users, but not to others. As an example, a large development team might be broken off into smaller projects where developers in project A might not be permitted to access objects written by developers in project B. Yet both projects might need to access objects created by developers in project C. Using the different security policy modules provided by the MAC framework, users could be divided into these groups and then given access to the appropriate objects.
ko: 네트워크 구성에 따라 정책을 결정할 수 있습니다. 특정 사용자에게만 man:ssh[1]에 대한 액세스를 허용해야 하는 경우 man:mac_portacl[4] 정책 모듈을 사용하는 것이 좋습니다. 파일 시스템의 경우 일부 사용자에게는 개체에 대한 액세스가 기밀로 간주될 수 있지만 다른 사용자에게는 기밀로 간주되지 않을 수 있습니다. 예를 들어, 대규모 개발 팀이 소규모 프로젝트로 나뉘어 프로젝트 A의 개발자는 프로젝트 B의 개발자가 작성한 개체에 액세스할 수 없지만 두 프로젝트 모두 프로젝트 C의 개발자가 만든 개체에 액세스해야 할 수 있습니다. MAC 프레임워크에서 제공하는 다양한 보안 정책 모듈을 사용하여 사용자를 이러한 그룹으로 구분한 다음 적절한 개체에 대한 액세스 권한을 부여할 수 있습니다.
ru: Решения о политиках могут приниматься на основе конфигурации сети. Если только определенные пользователи должны иметь доступ к man:ssh[1], модуль политики man:mac_portacl[4] является хорошим выбором. В случае файловых систем доступ к объектам может считаться конфиденциальным для одних пользователей, но не для других. Например, большая команда разработчиков может быть разделена на меньшие проекты, где разработчики из проекта A не должны иметь доступа к объектам, созданным разработчиками из проекта B. Однако оба проекта могут нуждаться в доступе к объектам, созданным разработчиками из проекта C. Используя различные модули политик безопасности, предоставляемые MAC-фреймворком, пользователи могут быть разделены на эти группы и затем получить доступ к соответствующим объектам.

source: Each security policy module has a unique way of dealing with the overall security of a system. Module selection should be based on a well thought out security policy which may require revision and reimplementation. Understanding the different security policy modules offered by the MAC framework will help administrators choose the best policies for their situations.
ko: 각 보안 정책 모듈은 시스템의 전반적인 보안을 처리하는 고유한 방식을 가지고 있습니다. 모듈 선택은 수정 및 재구현이 필요할 수 있는 신중한 보안 정책을 기반으로 해야 합니다. MAC 프레임워크에서 제공하는 다양한 보안 정책 모듈을 이해하면 관리자가 상황에 가장 적합한 정책을 선택하는 데 도움이 됩니다.
ru: Каждый модуль политики безопасности имеет уникальный способ обработки общей безопасности системы. Выбор модуля должен основываться на продуманной политике безопасности, которая может потребовать пересмотра и повторной реализации. Понимание различных модулей политики безопасности, предоставляемых инфраструктурой MAC, поможет администраторам выбрать наилучшие политики для их ситуаций.

source: The rest of this chapter covers the available modules, describes their use and configuration, and in some cases, provides insight on applicable situations.
ko: 이 장의 나머지 부분에서는 사용 가능한 모듈을 다루고, 사용 및 구성을 설명하며, 경우에 따라 적용 가능한 상황에 대한 인사이트를 제공합니다.
ru: Остальная часть этой главы посвящена доступным модулям, описанию их использования и настройки, а в некоторых случаях содержит рекомендации по их применению в различных ситуациях.

source: Implementing MAC is much like implementing a firewall since care must be taken to prevent being completely locked out of the system. The ability to revert back to a previous configuration should be considered and the implementation of MAC over a remote connection should be done with extreme caution.
ko: MAC을 구현하는 것은 방화벽을 구현하는 것과 매우 유사하므로 시스템에서 완전히 잠기지 않도록 주의를 기울여야 합니다. 이전 구성으로 되돌릴 수 있는 기능을 고려해야 하며 원격 연결을 통한 MAC 구현은 매우 신중하게 수행해야 합니다.
ru: Внедрение MAC во многом похоже на настройку межсетевого экрана, так как необходимо соблюдать осторожность, чтобы не оказаться полностью заблокированным в системе. Следует предусмотреть возможность возврата к предыдущей конфигурации, а реализацию MAC через удалённое соединение следует выполнять с особой осторожностью.

source: Available MAC Policies
ko: 사용 가능한 MAC 정책
ru: Доступные политики MAC

source: The default FreeBSD kernel includes `options MAC`. This means that every module included with the MAC framework can be loaded with `kldload` as a run-time kernel module. After testing the module, add the module name to [.filename]#/boot/loader.conf# so that it will load during boot. Each module also provides a kernel option for those administrators who choose to compile their own custom kernel.
ko: 기본 FreeBSD 커널에는 `options MAC` 이 포함되어 있습니다. 즉, MAC 프레임워크에 포함된 모든 모듈은 런타임 커널 모듈로 `kldload` 를 사용하여 로드할 수 있습니다. 모듈을 테스트한 후 부팅 중에 로드될 수 있도록 [.filename]#/boot/loader.conf# 에 모듈 이름을 추가합니다. 각 모듈은 자체 커널을 컴파일하려는 관리자를 위한 커널 옵션도 제공합니다.
ru: Стандартное ядро FreeBSD включает `options MAC`. Это означает, что каждый модуль, входящий в состав инфраструктуры MAC, может быть загружен с помощью `kldload` как модуль ядра во время выполнения. После тестирования модуля добавьте его имя в [.filename]#/boot/loader.conf#, чтобы он загружался при старте системы. Каждый модуль также предоставляет опцию ядра для администраторов, которые предпочитают компилировать собственное ядро системы.

source: FreeBSD includes a group of policies that will cover most security requirements. Each policy is summarized below. The last three policies support integer settings in place of the three default labels.
ko: FreeBSD에는 대부분의 보안 요구사항을 충족시킬 수 있는 정책 그룹이 포함되어 있습니다. 각 정책은 아래에 요약되어 있습니다. 마지막 세 가지 정책은 세 가지 기본 레이블 대신 정수 설정을 지원합니다.
ru: FreeBSD включает набор политик, которые охватывают большинство требований безопасности. Каждая политика кратко описана ниже. Последние три политики поддерживают целочисленные настройки вместо трёх стандартных меток.

source: The MAC See Other UIDs Policy
ko: MAC See Other UIDs 정책
ru: Политика MAC — See Other UIDs

source: Module name: [.filename]#mac_seeotheruids.ko#
ko: 모듈 이름: [.filename]#mac_seeotheruids.ko#
ru: Название модуля: [.filename]#mac_seeotheruids.ko#

source: Kernel configuration line: `options MAC_SEEOTHERUIDS`
ko: 커널 구성 줄: `options MAC_SEEOTHERUIDS`
ru: Строка конфигурации ядра: `options MAC_SEEOTHERUIDS`

source: Boot option: `mac_seeotheruids_load="YES"`
ko: 부팅 옵션: `mac_seeotheruids_load="YES"`
ru: Опция загрузки: `mac_seeotheruids_load="YES"`

source: The man:mac_seeotheruids[4] module extends the `security.bsd.see_other_uids` and `security.bsd.see_other_gids sysctl` tunables. This option does not require any labels to be set before configuration and can operate transparently with other modules.
ko: man:mac_seeotheruids[4] 모듈은 `security.bsd.see_other_uids` 및 `security.bsd.see_other_gids sysctl` 튜너블을 확장합니다. 이 옵션은 구성 전에 레이블을 설정할 필요가 없으며 다른 모듈과 함께 투명하게 작동할 수 있습니다.
ru: Модуль man:mac_seeotheruids[4] расширяет настройки `security.bsd.see_other_uids` и `security.bsd.see_other_gids sysctl`. Эта опция не требует предварительной установки меток для настройки и может работать прозрачно с другими модулями.

source: After loading the module, the following `sysctl` tunables may be used to control its features:
ko: 모듈을 로드한 후 다음 `sysctl` 튜너블을 사용하여 모듈의 기능을 제어할 수 있습니다:
ru: После загрузки модуля следующие настройки `sysctl` могут быть использованы для управления его функциями:

source: `security.mac.seeotheruids.enabled` enables the module and implements the default settings which deny users the ability to view processes and sockets owned by other users.
ko: `security.mac.seeotheruids.enabled` 는 모듈을 활성화하고 사용자가 다른 사용자가 소유한 프로세스 및 소켓을 볼 수 없도록 하는 기본 설정을 구현합니다.
ru: `security.mac.seeotheruids.enabled` включает модуль и реализует настройки по умолчанию, которые запрещают пользователям возможность просматривать процессы и сокеты, принадлежащие другим пользователям.

source: `security.mac.seeotheruids.specificgid_enabled` allows specified groups to be exempt from this policy. To exempt specific groups, use the `security.mac.seeotheruids.specificgid=_XXX_ sysctl` tunable, replacing _XXX_ with the numeric group ID to be exempted.
ko: `security.mac.seeotheruids.specificgid_enabled` 를 사용하면 지정된 그룹이 이 정책에서 면제될 수 있습니다. 특정 그룹을 면제하려면 `security.mac.seeotheruids.specificgid=_XXX_ sysctl` 튜너블을 사용하여 _XXX_ 를 면제할 숫자 그룹 ID로 바꾸면 됩니다.
ru: `security.mac.seeotheruids.specificgid_enabled` позволяет исключить указанные группы из действия этой политики. Чтобы исключить определённые группы, используйте параметр `security.mac.seeotheruids.specificgid=_XXX_ sysctl`, заменив _XXX_ на числовой идентификатор группы, которую нужно исключить.

source: `security.mac.seeotheruids.primarygroup_enabled` is used to exempt specific primary groups from this policy. When using this tunable, `security.mac.seeotheruids.specificgid_enabled` may not be set.
ko: `security.mac.seeotheruids.primarygroup_enabled` 는 특정 주 그룹을 이 정책에서 제외하는 데 사용됩니다. 이 튜너블을 사용하는 경우 `security.mac.seeotheruids.specificgid_enabled` 가 설정되지 않을 수 있습니다.
ru: `security.mac.seeotheruids.primarygroup_enabled` используется для исключения определённых первичных групп из этой политики. При использовании этого параметра `security.mac.seeotheruids.specificgid_enabled` не может быть установлен.

source: The MAC BSD Extended Policy
ko: MAC BSD Extended 정책
ru: Политика MAC — BSD Extended

source: Module name: [.filename]#mac_bsdextended.ko#
ko: 모듈 이름: [.filename]#mac_bsdextended.ko#
ru: Имя модуля: [.filename]#mac_bsdextended.ko#

source: Kernel configuration line: `options MAC_BSDEXTENDED`
ko: 커널 구성 줄: `options MAC_BSDEXTENDED`
ru: Строка конфигурации ядра: `options MAC_BSDEXTENDED`

source: Boot option: `mac_bsdextended_load="YES"`
ko: 부팅 옵션: `mac_bsdextended_load="YES"`
ru: Параметр загрузки: `mac_bsdextended_load="YES"`

source: The man:mac_bsdextended[4] module enforces a file system firewall. It provides an extension to the standard file system permissions model, permitting an administrator to create a firewall-like ruleset to protect files, utilities, and directories in the file system hierarchy. When access to a file system object is attempted, the list of rules is iterated until either a matching rule is located or the end is reached. This behavior may be changed using `security.mac.bsdextended.firstmatch_enabled`. Similar to other firewall modules in FreeBSD, a file containing the access control rules can be created and read by the system at boot time using an man:rc.conf[5] variable.
ko: man:mac_bsdextended[4] 모듈은 파일 시스템 방화벽에 적용됩니다. 이 모듈은 표준 파일 시스템 권한 모델에 대한 확장을 제공하여 관리자가 파일 시스템 계층 구조에서 파일, 유틸리티 및 디렉터리를 보호하기 위해 방화벽과 유사한 규칙 집합을 만들 수 있도록 합니다. 파일 시스템 개체에 대한 액세스가 시도되면 일치하는 규칙을 찾거나 끝 부분에 도달할 때까지 규칙 목록이 반복됩니다. 이 동작은 `security.mac.bsdextended.firstmatch_enabled` 를 사용하여 변경할 수 있습니다. FreeBSD의 다른 방화벽 모듈과 유사하게, 접근 제어 규칙이 포함된 파일은 부팅 시 man:rc.conf[5] 변수를 사용하여 시스템에서 생성하고 읽을 수 있습니다.
ru: Модуль man:mac_bsdextended[4] обеспечивает файловый межсетевой экран. Он расширяет стандартную модель прав доступа к файловой системе, позволяя администратору создавать набор правил, подобный межсетевому экрану, для защиты файлов, утилит и каталогов в иерархии файловой системы. При попытке доступа к объекту файловой системы происходит перебор списка правил до тех пор, пока не будет найдено соответствующее правило или не будет достигнут конец списка. Это поведение можно изменить с помощью параметра `security.mac.bsdextended.firstmatch_enabled`. Подобно другим модулям межсетевого экрана в FreeBSD, файл с правилами контроля доступа может быть создан и прочитан системой во время загрузки с использованием переменной man:rc.conf[5].

source: The rule list may be entered using man:ugidfw[8] which has a syntax similar to man:ipfw[8]. More tools can be written by using the functions in the man:libugidfw[3] library.
ko: 규칙 목록은 man:ipfw[8]와 유사한 구문을 가진 man:ugidfw[8]를 사용하여 입력할 수 있습니다. man:libugidfw[3] 라이브러리에 있는 함수를 사용하여 더 많은 도구를 작성할 수 있습니다.
ru: Список правил может быть введён с помощью man:ugidfw[8], синтаксис которого похож на man:ipfw[8]. Дополнительные инструменты могут быть написаны с использованием функций из библиотеки man:libugidfw[3].

source: After the man:mac_bsdextended[4] module has been loaded, the following command may be used to list the current rule configuration:
ko: man:mac_bsdextended[4] 모듈을 로드한 후 다음 명령을 사용하여 현재 규칙 구성을 나열할 수 있습니다:
ru: После загрузки модуля man:mac_bsdextended[4] для просмотра текущей конфигурации правил можно использовать следующую команду:

source: By default, no rules are defined and everything is completely accessible. To create a rule which blocks all access by users but leaves `root` unaffected:
ko: 기본적으로 규칙이 정의되어 있지 않으며 모든 항목에 완전히 액세스할 수 있습니다. 사용자의 모든 액세스를 차단하지만 `root` 는 영향을 받지 않는 규칙을 만들려면 다음과 같이 하세요:
ru: По умолчанию никакие правила не определены, и доступ полностью открыт. Чтобы создать правило, которое блокирует доступ для всех пользователей, кроме `root`:

source: While this rule is simple to implement, it is a very bad idea as it blocks all users from issuing any commands. A more realistic example blocks `user1` all access, including directory listings, to ``_user2_``'s home directory:
ko: 이 규칙은 구현하기는 간단하지만 모든 사용자가 명령을 실행하지 못하도록 차단하므로 매우 나쁜 아이디어입니다. 보다 현실적인 예는 ``_user1`` 의 홈 디렉터리에 대한 디렉토리 목록을 포함한 모든 액세스를 ``_user2_`` 에서 차단하는 것입니다:
ru: Хотя это правило просто реализовать, это очень плохая идея, так как оно блокирует всех пользователей от выполнения любых команд. Более реалистичный пример запрещает `user1` любой доступ, включая просмотр каталогов, к домашней директории ``_user2_``:

source: Instead of `user1`, `not uid _user2_` could be used in order to enforce the same access restrictions for all users. However, the `root` user is unaffected by these rules.
ko: 모든 사용자에게 동일한 접근 제한을 적용하기 위해 `user1` 대신 `not uid _user2_` 를 사용할 수 있습니다. 그러나 `root` 사용자는 이러한 규칙의 영향을 받지 않습니다.
ru: Вместо `user1` можно использовать `not uid _user2_`, чтобы применять одинаковые ограничения доступа для всех пользователей. Однако пользователь `root` не подвержен влиянию этих правил.

source: Extreme caution should be taken when working with this module as incorrect use could block access to certain parts of the file system.
ko: 이 모듈을 잘못 사용하면 파일 시스템의 특정 부분에 대한 액세스가 차단될 수 있으므로 이 모듈로 작업할 때는 각별한 주의를 기울여야 합니다.
ru: Следует проявлять крайнюю осторожность при работе с этим модулем, так как неправильное использование может заблокировать доступ к определенным частям файловой системы.

source: The MAC Interface Silencing Policy
ko: MAC Interface Silencing 정책
ru: Политика MAC — подавление интерфейсов

source: Module name: [.filename]#mac_ifoff.ko#
ko: 모듈 이름: [.filename]#mac_ifoff.ko#
ru: Имя модуля: [.filename]#mac_ifoff.ko#

source: Kernel configuration line: `options MAC_IFOFF`
ko: 커널 구성 줄: `options MAC_IFOFF`
ru: Строка конфигурации ядра: `options MAC_IFOFF`

source: Boot option: `mac_ifoff_load="YES"`
ko: 부팅 옵션: `mac_ifoff_load="YES"`
ru: Параметр загрузки: `mac_ifoff_load="YES"`

source: The man:mac_ifoff[4] module is used to disable network interfaces on the fly and to keep network interfaces from being brought up during system boot. It does not use labels and does not depend on any other MAC modules.
ko: man:mac_ifoff[4] 모듈은 네트워크 인터페이스를 즉시 비활성화하고 시스템 부팅 중에 네트워크 인터페이스가 나타나지 않도록 하는 데 사용됩니다. 이 모듈은 레이블을 사용하지 않으며 다른 MAC 모듈에 의존하지 않습니다.
ru: Модуль man:mac_ifoff[4] используется для отключения сетевых интерфейсов на лету и предотвращения их включения во время загрузки системы. Он не использует метки и не зависит от других модулей MAC.

source: Most of this module's control is performed through these `sysctl` tunables:
ko: 이 모듈의 제어는 대부분 이 `sysctl` 튜너블을 통해 수행됩니다:
ru: Большая часть управления этим модулем осуществляется через следующие настраиваемые параметры `sysctl`:

source: `security.mac.ifoff.lo_enabled` enables or disables all traffic on the loopback, man:lo[4], interface.
ko: `security.mac.ifoff.lo_enabled` 는 루프백, man:lo[4], 인터페이스의 모든 트래픽을 활성화 또는 비활성화합니다.
ru: `security.mac.ifoff.lo_enabled` включает или отключает весь трафик на интерфейсе loopback, man:lo[4].

source: `security.mac.ifoff.bpfrecv_enabled` enables or disables all traffic on the Berkeley Packet Filter interface, man:bpf[4].
ko: `security.mac.ifoff.bpfrecv_enabled` 는 버클리 패킷 필터 인터페이스의 모든 트래픽을 활성화 또는 비활성화합니다(man:bpf[4]).
ru: `security.mac.ifoff.bpfrecv_enabled` включает или отключает весь трафик на интерфейсе Berkeley Packet Filter, man:bpf[4].

source: `security.mac.ifoff.other_enabled` enables or disables traffic on all other interfaces.
ko: `security.mac.ifoff.other_enabled` 는 다른 모든 인터페이스의 트래픽을 활성화 또는 비활성화합니다.
ru: `security.mac.ifoff.other_enabled` включает или отключает трафик на всех остальных интерфейсах.

source: One of the most common uses of man:mac_ifoff[4] is network monitoring in an environment where network traffic should not be permitted during the boot sequence. Another use would be to write a script which uses an application such as package:security/aide[] to automatically block network traffic if it finds new or altered files in protected directories.
ko: man:mac_ifoff[4]의 가장 일반적인 용도 중 하나는 부팅 시퀀스 중에 네트워크 트래픽이 허용되지 않아야 하는 환경에서 네트워크 모니터링입니다. 또 다른 용도로는 package:security/aide[] 같은 애플리케이션을 사용하여 보호된 디렉터리에서 새 파일이나 변경된 파일을 발견하면 네트워크 트래픽을 자동으로 차단하는 스크립트를 작성할 수 있습니다.
ru: Одним из наиболее распространённых применений `mac_ifoff(4)` является мониторинг сети в среде, где сетевой трафик не должен разрешаться во время последовательности загрузки. Другое применение — написание скрипта, который использует приложение, например package:security/aide[], для автоматической блокировки сетевого трафика при обнаружении новых или изменённых файлов в защищённых каталогах.

source: The MAC Port Access Control List Policy
ko: MAC Port Access Control List 정책
ru: Политика MAC - списки управления доступом к портам

source: Module name: [.filename]#mac_portacl.ko#
ko: 모듈 이름: [.filename]#mac_portacl.ko#
ru: Имя модуля: [.filename]#mac_portacl.ko#

source: Kernel configuration line: `MAC_PORTACL`
ko: 커널 구성 줄: `MAC_PORTACL`
ru: Строка конфигурации ядра: `MAC_PORTACL`

source: Boot option: `mac_portacl_load="YES"`
ko: 부팅 옵션: `mac_portacl_load="YES"`
ru: Параметр загрузки: `mac_portacl_load="YES"`

source: The man:mac_portacl[4] module is used to limit binding to local TCP and UDP ports, making it possible to allow non-`root` users to bind to specified privileged ports below 1024.
ko: man:mac_portacl[4] 모듈은 로컬 TCP 및 UDP 포트로 바인딩을 제한하는 데 사용되며, `root` 가 아닌 사용자가 1024 미만의 지정된 권한 포트에 바인딩하도록 허용할 수 있습니다.
ru: Модуль man:mac_portacl[4] используется для ограничения привязки к локальным TCP- и UDP-портам, позволяя непривилегированным пользователям (не `root`) привязываться к указанным привилегированным портам ниже 1024.

source: Once loaded, this module enables the MAC policy on all sockets. The following tunables are available:
ko: 이 모듈이 로드되면 모든 소켓에서 MAC 정책을 활성화합니다. 다음과 같은 튜너블을 사용할 수 있습니다:
ru: После загрузки этот модуль включает политику MAC для всех сокетов. Доступны следующие настраиваемые параметры:

source: `security.mac.portacl.enabled` enables or disables the policy completely.
ko: `security.mac.portacl.enabled` 는 정책을 완전히 활성화 또는 비활성화합니다.
ru: `security.mac.portacl.enabled` включает или отключает политику полностью.

source: `security.mac.portacl.port_high` sets the highest port number that man:mac_portacl[4] protects.
ko: `security.mac.portacl.port_high` 는 man:mac_portacl[4]이 보호하는 가장 높은 포트 번호를 설정합니다.
ru: `security.mac.portacl.port_high` устанавливает наибольший номер порта, который защищает man:mac_portacl[4].

source: `security.mac.portacl.suser_exempt`, when set to a non-zero value, exempts the `root` user from this policy.
ko: `security.mac.portacl.suser_exempt` 를 0이 아닌 값으로 설정하면 이 정책에서 `root` 사용자를 면제합니다.
ru: `security.mac.portacl.suser_exempt` при установке в ненулевое значение освобождает пользователя `root` от действия данной политики.
