Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/mac/_index.po
Languages: ko, ru

source: During the initial planning phase, an administrator must be prepared to partition users into grades, levels, and areas. The system will default to a high label once this policy module is enabled, and it is up to the administrator to configure the different grades and levels for users. Instead of using clearance levels, a good planning method could include topics. For instance, only allow developers modification access to the source code repository, source code compiler, and other development utilities. Other users would be grouped into other categories such as testers, designers, or end users and would only be permitted read access.
ko: 초기 계획 단계에서 관리자는 사용자를 등급, 수준 및 영역으로 분할할 준비가 되어 있어야 합니다. 이 정책 모듈이 활성화되면 시스템은 기본적으로 높은 레이블로 설정되며, 사용자에 대한 다양한 등급 및 레벨을 구성하는 것은 관리자의 몫입니다. 권한 수준을 사용하는 대신 주제를 포함하는 것도 좋은 계획 방법이 될 수 있습니다. 예를 들어 개발자에게만 소스 코드 리포지토리, 소스 코드 컴파일러 및 기타 개발 유틸리티에 대한 수정 액세스 권한을 허용할 수 있습니다. 다른 사용자는 테스터, 디자이너 또는 최종 사용자와 같은 다른 카테고리로 그룹화하여 읽기 액세스 권한만 허용할 수 있습니다.
ru: В ходе начального этапа планирования администратор должен быть готов разделить пользователей по уровням целостности (grade), уровням объектов (level) и областям. После включения этого модуля политики система по умолчанию перейдет на высокий уровень метки, и администратору потребуется настроить различные уровни целостности и уровни объектов для пользователей. Вместо использования уровней доступа хорошим методом планирования может стать использование тематик. Например, разрешить разработчикам доступ на изменение только к репозиторию исходного кода, компилятору исходного кода и другим инструментам разработки. Остальные пользователи будут распределены по другим категориям, таким как тестировщики, дизайнеры или конечные пользователи, и им будет разрешен только доступ на чтение.

source: A lower integrity subject is unable to write to a higher integrity subject and a higher integrity subject cannot list or read a lower integrity object. Setting a label at the lowest possible grade could make it inaccessible to subjects. Some prospective environments for this security policy module would include a constrained web server, a development and test machine, and a source code repository. A less useful implementation would be a personal workstation, a machine used as a router, or a network firewall.
ko: 무결성이 낮은 주체는 무결성이 높은 주체에 쓰기를 할 수 없으며, 무결성이 높은 주체는 무결성이 낮은 객체를 나열하거나 읽을 수 없습니다. 레이블을 가능한 가장 낮은 등급으로 설정하면 주체가 해당 레이블에 접근할 수 없게 될 수 있습니다. 이 보안 정책 모듈을 구현할 수 있는 환경으로는 제한된 웹 서버, 개발 및 테스트 머신, 소스 코드 리포지토리 등이 있습니다. 덜 유용한 구현으로는 개인 워크스테이션, 라우터로 사용되는 컴퓨터 또는 네트워크 방화벽이 있습니다.
ru: Субъект с более низким уровнем целостности не может записывать данные в субъект с более высоким уровнем целостности, а субъект с более высоким уровнем целостности не может просматривать или читать объект с более низким уровнем целостности. Установка метки на минимально возможном уровне может сделать объект недоступным для субъектов. Перспективными средами для использования этого модуля политики безопасности могут быть ограниченный веб-сервер, машина для разработки и тестирования, а также репозиторий исходного кода. Менее полезной реализацией будет персональная рабочая станция, машина, используемая в качестве маршрутизатора, или сетевой межсетевой экран.

source: The MAC Low-watermark Module
ko: MAC Low-watermark 모듈
ru: Модуль MAC Low-watermark (нижний порог)

source: Module name: [.filename]#mac_lomac.ko#
ko: 모듈 이름: [.filename]#mac_lomac.ko#
ru: Имя модуля: [.filename]#mac_lomac.ko#

source: Kernel configuration line: `options MAC_LOMAC`
ko: 커널 구성 줄: `options MAC_LOMAC`
ru: Строка конфигурации ядра: `options MAC_LOMAC`

source: Boot option: `mac_lomac_load="YES"`
ko: 부팅 옵션: `mac_lomac_load="YES"`
ru: Параметр загрузки: `mac_lomac_load="YES"`

source: Unlike the MAC Biba policy, the man:mac_lomac[4] policy permits access to lower integrity objects only after decreasing the integrity level to not disrupt any integrity rules.
ko: MAC Biba 정책과 달리, man:mac_lomac[4] 정책은 무결성 규칙을 방해하지 않도록 무결성 수준을 낮춘 후에만 낮은 무결성 개체에 대한 액세스를 허용합니다.
ru: В отличие от политики MAC Biba, политика man:mac_lomac[4] разрешает доступ к объектам с более низким уровнем целостности только после понижения уровня целостности, чтобы не нарушать правила целостности.

source: The Low-watermark integrity policy works almost identically to Biba, with the exception of using floating labels to support subject demotion via an auxiliary grade compartment. This secondary compartment takes the form `[auxgrade]`. When assigning a policy with an auxiliary grade, use the syntax `lomac/10[2]`, where `2` is the auxiliary grade.
ko: Low-watermark 무결성 정책은 보조 등급 칸을 통해 주체 강등을 지원하기 위한 플로팅 레이블을 사용하는 것을 제외하고는 Biba와 거의 동일하게 작동합니다. 이 보조 구획은 `[auxgrade]` 형식을 취합니다. 보조 등급이 있는 정책을 할당할 때는 `lomac/10[2]` 구문을 사용하며, 여기서 `2` 는 보조 등급입니다.
ru: Политика целостности Low-watermark работает почти идентично Biba, за исключением использования плавающих меток для поддержки понижения уровня субъекта через компартмент с вспомогательным уровнем целостности. Этот вторичный компартмент имеет вид `[auxgrade]`. При назначении политики с вспомогательным уровнем целостности используйте синтаксис `lomac/10[2]`, где `2` — это вспомогательный уровень целостности.

source: This policy relies on the ubiquitous labeling of all system objects with integrity labels, permitting subjects to read from low integrity objects and then downgrading the label on the subject to prevent future writes to high integrity objects using `[auxgrade]`. The policy may provide greater compatibility and require less initial configuration than Biba.
ko: 이 정책은 모든 시스템 개체에 무결성 레이블을 유비쿼터스 레이블로 지정하여 주체가 낮은 무결성 개체를 읽을 수 있도록 허용한 다음 주체의 레이블을 다운그레이드하여 향후 '[auxgrade]` 를 사용하여 높은 무결성 오브젝트에 쓰지 못하도록 하는 방식입니다. 이 정책은 Biba보다 호환성이 더 뛰어나고 초기 구성이 덜 필요할 수 있습니다.
ru: Данная политика основывается на повсеместной маркировке всех системных объектов метками целостности, позволяя субъектам читать из объектов с низкой целостностью, а затем понижая уровень метки на субъекте с помощью `[auxgrade]`, чтобы предотвратить последующие записи в объекты с высокой целостностью. Эта политика может обеспечить большую совместимость и потребовать меньше начальной настройки по сравнению с Biba.

source: Like the Biba and MLS policies, `setfmac` and `setpmac` are used to place labels on system objects:
ko: Biba 및 MLS 정책과 마찬가지로 `setfmac` 및 `setpmac` 은 시스템 개체에 레이블을 배치하는 데 사용됩니다:
ru: Как и в политиках Biba и MLS, `setfmac` и `setpmac` используются для назначения меток объектам системы:

source: The auxiliary grade `low` is a feature provided only by the MACLOMAC policy.
ko: 보조 등급 `low` 은 MACLOMAC 정책으로만 제공되는 기능입니다.
ru: Вспомогательный уровень целостности `low` — это функция, предоставляемая только политикой MACLOMAC.

source: User Lock Down
ko: 사용자 잠금
ru: Блокировка пользователя

source: This example considers a relatively small storage system with fewer than fifty users. Users will have login capabilities and are permitted to store data and access resources.
ko: 이 예에서는 사용자가 50명 미만인 비교적 작은 스토리지 시스템을 고려합니다. 사용자에게는 로그인 기능이 있으며 데이터를 저장하고 리소스에 액세스할 수 있습니다.
ru: Этот пример рассматривает относительно небольшую систему хранения данных с менее чем пятьюдесятью пользователями. Пользователи будут иметь возможность входа в систему и могут хранить данные и получать доступ к ресурсам.

source: For this scenario, the man:mac_bsdextended[4] and man:mac_seeotheruids[4] policy modules could co-exist and block access to system objects while hiding user processes.
ko: 이 시나리오의 경우, 사용자 프로세스를 숨기면서 시스템 오브젝트에 대한 액세스를 차단하는 man:mac_bsdextended[4] 및 man:mac_seeotheruids[4] 정책 모듈이 공존하여 시스템 오브젝트에 대한 액세스를 차단할 수 있습니다.
ru: Для данного сценария модули политик man:mac_bsdextended[4] и man:mac_seeotheruids[4] могут сосуществовать и блокировать доступ к системным объектам, скрывая при этом пользовательские процессы.

source: Begin by adding the following line to [.filename]#/boot/loader.conf#:
ko: [.filename]#/boot/loader.conf# 에 다음 줄을 추가하여 시작합니다:
ru: Начните с добавления следующей строки в [.filename]#/boot/loader.conf#:

source: The man:mac_bsdextended[4] security policy module may be activated by adding this line to [.filename]#/etc/rc.conf#:
ko: man:mac_bsdextended[4] 보안 정책 모듈은 [.filename]#/etc/rc.conf# 에 이 줄을 추가하여 활성화할 수 있습니다:
ru: Модуль политики безопасности man:mac_bsdextended[4] может быть активирован добавлением следующей строки в [.filename]#/etc/rc.conf#:

source: Default rules stored in [.filename]#/etc/rc.bsdextended# will be loaded at system initialization. However, the default entries may need modification. Since this machine is expected only to service users, everything may be left commented out except the last two lines in order to force the loading of user owned system objects by default.
ko: [.filename]#/etc/rc.bsdextended# 에 저장된 기본 규칙은 시스템 초기화 시 로드됩니다. 그러나 기본 항목은 수정이 필요할 수 있습니다. 이 머신은 사용자에게만 서비스를 제공할 것으로 예상되므로 기본적으로 사용자 소유의 시스템 객체를 강제로 로드하기 위해 마지막 두 줄을 제외한 모든 항목을 주석 처리하지 않을 수 있습니다.
ru: Файл с правилами по умолчанию, хранящийся в [.filename]#/etc/rc.bsdextended#, будет загружен при инициализации системы. Однако стандартные записи могут потребовать изменения. Поскольку предполагается, что данная машина будет обслуживать только пользователей, все строки можно оставить закомментированными, за исключением последних двух, чтобы обеспечить принудительную загрузку системных объектов, принадлежащих пользователям, по умолчанию.

source: Add the required users to this machine and reboot. For testing purposes, try logging in as a different user across two consoles. Run `ps aux` to see if processes of other users are visible. Verify that running man:ls[1] on another user's home directory fails.
ko: 이 머신에 필요한 사용자를 추가하고 재부팅합니다. 테스트를 위해 두 콘솔에서 다른 사용자로 로그인해 보세요. `ps aux` 를 실행하여 다른 사용자의 프로세스가 표시되는지 확인합니다. 다른 사용자의 홈 디렉터리에서 man:ls[1]를 실행해도 실패하는지 확인합니다.
ru: Добавьте необходимых пользователей на эту машину и перезагрузитесь. Для тестирования попробуйте войти в систему под разными пользователями на двух консолях. Выполните `ps -aux`, чтобы проверить, видны ли процессы других пользователей. Убедитесь, что выполнение man:ls[1] для домашнего каталога другого пользователя завершается ошибкой.

source: Do not try to test with the `root` user unless the specific ``sysctl``s have been modified to block super user access.
ko: 슈퍼 유저의 접근을 차단하기 위해 특정 ``sysctl`` 을 수정하지 않는 한 `root` 사용자로 테스트하지 마세요.
ru: Не пытайтесь проводить тестирование от пользователя `root`, если специальные параметры ``sysctl`` не были изменены для блокировки доступа суперпользователя.

source: When a new user is added, their man:mac_bsdextended[4] rule will not be in the ruleset list. To update the ruleset quickly, unload the security policy module and reload it again using man:kldunload[8] and man:kldload[8].
ko: 새 사용자가 추가되면 해당 사용자의 man:mac_bsdextended[4] 규칙은 규칙 집합 목록에 없습니다. 규칙 집합을 빠르게 업데이트하려면 보안 정책 모듈을 언로드한 후 man:kldunload[8] 및 man:kldload[8]을 사용하여 다시 로드하세요.
ru: При добавлении нового пользователя его правило man:mac_bsdextended[4] не будет в списке набора правил. Чтобы быстро обновить набор правил, выгрузите модуль политики безопасности и загрузите его снова с помощью man:kldunload[8] и man:kldload[8].

source: Nagios in a MAC Jail
ko: MAC Jail안의 Nagios
ru: Nagios в MAC клетке

source: This section demonstrates the steps that are needed to implement the Nagios network monitoring system in a MAC environment. This is meant as an example which still requires the administrator to test that the implemented policy meets the security requirements of the network before using in a production environment.
ko: 이 섹션에서는 MAC 환경에서 Nagios 네트워크 모니터링 시스템을 구현하는 데 필요한 단계를 설명합니다. 이는 프로덕션 환경에서 사용하기 전에 구현된 정책이 네트워크의 보안 요구 사항을 충족하는지 관리자가 테스트해야 하는 예시입니다.
ru: В этом разделе показаны шаги, необходимые для внедрения системы мониторинга сети Nagios в среде MAC. Это пример, который требует от администратора проверки соответствия реализованной политики требованиям безопасности сети перед использованием в рабочей среде.

source: This example requires `multilabel` to be set on each file system. It also assumes that package:net-mgmt/nagios-plugins[], package:net-mgmt/nagios[], and package:www/apache22[] are all installed, configured, and working correctly before attempting the integration into the MAC framework.
ko: 이 예제에서는 각 파일 시스템에 `multilabel` 을 설정해야 합니다. 또한 MAC 프레임워크에 통합을 시도하기 전에 package:net-mgmt/nagios-plugins[], package:net-mgmt/nagios[] 및 package:www/apache22[]가 모두 설치, 구성 및 올바르게 작동하고 있다고 가정합니다.
ru: Этот пример требует установки `multilabel` на каждой файловой системе. Также предполагается, что package:net-mgmt/nagios-plugins[], package:net-mgmt/nagios[] и package:www/apache22[] установлены, настроены и корректно работают до попытки интеграции в инфраструктуре MAC.

source: Create an Insecure User Class
ko: Insecure 사용자 클래스 생성
ru: Создайте небезопасный класс пользователя

source: Begin the procedure by adding the following user class to [.filename]#/etc/login.conf#:
ko: 다음 사용자 클래스를 [.filename]#/etc/login.conf# 에 추가하여 절차를 시작합니다:
ru: Начните процедуру, добавив следующий класс пользователя в [.filename]#/etc/login.conf#:

source: Then, add the following line to the default user class section:
ko: 그런 다음 기본 사용자 클래스 섹션에 다음 줄을 추가합니다:
ru: Затем добавьте следующую строку в раздел класса пользователя по умолчанию:

source: Save the edits and issue the following command to rebuild the database:
ko: 편집 내용을 저장하고 다음 명령을 실행하여 데이터베이스를 다시 빌드합니다:
ru: Сохраните изменения и выполните следующую команду для перестроения базы данных:

source: Configure Users
ko: 사용자 구성
ru: Настройте пользователей

source: Set the `root` user to the default class using:
ko: 다음을 사용하여 `root` 사용자를 기본 클래스로 설정합니다:
ru: Установите пользователя `root` в класс по умолчанию с помощью:

source: All user accounts that are not `root` will now require a login class. The login class is required, otherwise users will be refused access to common commands. The following `sh` script should do the trick:
ko: 이제 `root` 가 아닌 모든 사용자 계정에 로그인 클래스가 필요합니다. 로그인 클래스가 필요하지 않으면 사용자는 일반 명령에 대한 액세스가 거부됩니다. 다음 `sh` 스크립트를 사용하면 됩니다:
ru: Все пользовательские учетные записи, кроме `root`, теперь требуют указания класса входа. Класс входа обязателен, в противном случае пользователям будет отказано в доступе к распространенным командам. Следующий скрипт на `sh` должен помочь:

source: Next, drop the `nagios` and `www` accounts into the insecure class:
ko: 다음으로, `nagios` 및 `www` 계정을 안전하지 않은 클래스로 드롭합니다:
ru: Затем добавьте учетные записи `nagios` и `www` в класс insecure:

source: Create the Contexts File
ko: 컨텍스트 파일 생성
ru: Создайте файл контекстов

source: A contexts file should now be created as [.filename]#/etc/policy.contexts#:
ko: 컨텍스트 파일은 이제 [.filename]#/etc/policy.contexts# 형태로 만들어집니다:
ru: Файл контекстов теперь должен быть создан как [.filename]#/etc/policy.contexts#:

source: This policy enforces security by setting restrictions on the flow of information. In this specific configuration, users, including `root`, should never be allowed to access Nagios. Configuration files and processes that are a part of Nagios will be completely self contained or jailed.
ko: 이 정책은 정보 흐름에 제한을 설정하여 보안을 강화합니다. 이 특정 구성에서는 `root` 를 포함한 사용자가 Nagios에 액세스할 수 있도록 해서는 안 됩니다. Nagios의 일부인 구성 파일 및 프로세스는 완전히 자체적으로 포함되거나 jail화 됩니다.
ru: Эта политика обеспечивает безопасность, устанавливая ограничения на поток информации. В данной конкретной конфигурации пользователям, включая `root`, никогда не должно быть разрешено обращаться к Nagios. Конфигурационные файлы и процессы, являющиеся частью Nagios, будут полностью самодостаточными или изолированными.

source: This file will be read after running `setfsmac` on every file system. This example sets the policy on the root file system:
ko: 이 파일은 모든 파일 시스템에서 `setfsmac` 을 실행한 후에 읽습니다. 이 예에서는 루트 파일 시스템에 대한 정책을 설정합니다:
ru: Этот файл будет прочитан после выполнения `setfsmac` для каждой файловой системы. В этом примере устанавливается политика для корневой файловой системы:

source: Next, add these edits to the main section of [.filename]#/etc/mac.conf#:
ko: 그런 다음 [.filename]#/etc/mac.conf# 의 기본 섹션에 이러한 편집 내용을 추가합니다:
ru: Далее добавьте эти изменения в основной раздел файла [.filename]#/etc/mac.conf#:

source: Loader Configuration
ko: 로더 구성
ru: Конфигурация загрузчика

source: To finish the configuration, add the following lines to [.filename]#/boot/loader.conf#:
ko: 구성을 완료하려면 [.filename]#/boot/loader.conf# 에 다음 줄을 추가합니다:
ru: Для завершения настройки добавьте следующие строки в [.filename]#/boot/loader.conf#:

source: And the following line to the network card configuration stored in [.filename]#/etc/rc.conf#. If the primary network configuration is done via DHCP, this may need to be configured manually after every system boot:
ko: 그리고 [.filename]#/etc/rc.conf# 파일의 저장된 네트워크 카드 구성에 다음 줄을 추가합니다. 기본 네트워크 구성이 DHCP를 통해 수행되는 경우 시스템을 부팅할 때마다 수동으로 구성해야 할 수 있습니다:
ru: Добавьте следующую строку в конфигурацию сетевой карты, хранящуюся в [.filename]#/etc/rc.conf#. Если основная настройка сети выполняется через DHCP, это может потребовать ручной настройки после каждой загрузки системы:

source: Testing the Configuration
ko: 구성 테스트하기
ru: Проверка конфигурации

source: First, ensure that the web server and Nagios will not be started on system initialization and reboot. Ensure that `root` cannot access any of the files in the Nagios configuration directory. If `root` can list the contents of [.filename]#/var/spool/nagios#, something is wrong. Instead, a "permission denied" error should be returned.
ko: 먼저, 시스템 초기화 및 재부팅 시 웹 서버와 Nagios가 시작되지 않도록 합니다. `root` 가 Nagios 구성 디렉터리에 있는 파일에 액세스할 수 없는지 확인합니다. `root` 가 [.filename]#/var/spool/nagios# 의 내용을 나열할 수 있다면 문제가 있는 것입니다. 대신 "permission denied" 오류가 반환되어야 합니다.
ru: Сначала убедитесь, что веб-сервер и Nagios не будут запускаться при инициализации системы и перезагрузке. Убедитесь, что `root` не имеет доступа к любым файлам в конфигурационном каталоге Nagios. Если `root` может просматривать содержимое [.filename]#/var/spool/nagios#, значит что-то не так. Вместо этого должна возвращаться ошибка "permission denied".

source: If all seems well, Nagios, Apache, and Sendmail can now be started:
ko: 모든 것이 정상이면 이제 Nagios, Apache 및 Sendmail을 시작할 수 있습니다:
ru: Если все выглядит нормально, можно запустить Nagios, Apache и Sendmail:

source: Double check to ensure that everything is working properly. If not, check the log files for error messages. If needed, use man:sysctl[8] to disable the man:mac_biba[4] security policy module and try starting everything again as usual.
ko: 모든 것이 제대로 작동하는지 다시 확인하세요. 그렇지 않은 경우 로그 파일에서 오류 메시지를 확인하세요. 필요한 경우 man:sysctl[8]을 사용하여 man:mac_biba[4] 보안 정책 모듈을 비활성화하고 평소와 같이 모든 것을 다시 시작하세요.
ru: Тщательно проверьте, чтобы всё работало правильно. Если нет, проверьте файлы журналов на наличие сообщений об ошибках. При необходимости используйте `man:sysctl[8]` для отключения модуля политики безопасности `man:mac_biba[4]` и попробуйте запустить всё снова как обычно.

source: The `root` user can still change the security enforcement and edit its configuration files. The following command will permit the degradation of the security policy to a lower grade for a newly spawned shell:
ko: `root` 사용자는 여전히 보안 적용을 변경하고 구성 파일을 편집할 수 있습니다. 다음 명령은 새로 생성된 셸에 대해 보안 정책을 더 낮은 등급으로 낮출 수 있도록 허용합니다:
ru: Пользователь `root` всё ещё может изменять параметры безопасности и редактировать конфигурационные файлы. Следующая команда разрешит понижение уровня целостности политики безопасности для нового запущенного shell:

source: To block this from happening, force the user into a range using man:login.conf[5]. If man:setpmac[8] attempts to run a command outside of the compartment's range, an error will be returned and the command will not be executed. In this case, set root to `biba/high(high-high)`.
ko: 이런 일이 발생하지 않도록 차단하려면 man:login.conf[5]를 사용하여 사용자를 강제로 범위 안에 넣으세요. man:setpmac[8]이 구획의 범위를 벗어난 명령을 실행하려고 하면 오류가 반환되고 명령이 실행되지 않습니다. 이 경우 루트를 `biba/high(high-high)` 로 설정하세요.
ru: Чтобы предотвратить это, принудительно ограничьте пользователя диапазоном с помощью man:login.conf[5]. Если man:setpmac[8] попытается выполнить команду вне пределов компартмента, будет возвращена ошибка и команда не выполнится. В данном случае установите root в `biba/high(high-high)`.

source: Troubleshooting the MAC Framework
ko: MAC 프레임워크 문제 해결
ru: Устранение проблем с инфраструктурой MAC

source: This section discusses common configuration errors and how to resolve them.
ko: 이 섹션에서는 일반적인 구성 오류와 이를 해결하는 방법에 대해 설명합니다.
ru: Этот раздел посвящён распространённым ошибкам конфигурации и способам их устранения.

source: The `multilabel` flag does not stay enabled on the root ([.filename]#/#) partition
ko: `multilabel` 플래그가 루트( [.filename]#/# ) 파티션에서 활성화된 상태로 유지되지 않습니다
ru: Флаг `multilabel` не сохраняется на корневом ([.filename]#/#) разделе

source: The following steps may resolve this transient error:
ko: 다음 단계를 수행하면 이 일시적인 오류를 해결할 수 있습니다:
ru: Следующие действия могут помочь устранить эту временную ошибку:

source: Edit [.filename]#/etc/fstab# and set the root partition to `ro` for read-only.
ko: [.filename]#/etc/fstab# 을 편집하고 루트 파티션을 읽기 전용인 `ro` 로 설정합니다.
ru: Отредактируйте файл [.filename]#/etc/fstab# и установите корневой раздел в `ro` для режима только для чтения.

source: Reboot into single user mode.
ko: 단일 사용자 모드로 재부팅합니다.
ru: Перезагрузитесь в однопользовательском режиме.

source: Run `tunefs -l enable` on [.filename]#/#.
ko: [.filename]#/# 에서 `tunefs -l enable` 을 실행합니다.
ru: Выполните команду `tunefs -l enable` для раздела [.filename]#/#.

source: Reboot the system.
ko: 시스템을 재부팅합니다.
ru: Перезагрузите систему.

source: Run `mount -urw`[.filename]#/# and change the `ro` back to `rw` in [.filename]#/etc/fstab# and reboot the system again.
ko: `mount -urw` [.filename]#/# 를 실행하고 [.filename]#/etc/fstab# 에서 `ro` 를 다시 `rw` 로 변경한 후 시스템을 다시 부팅합니다.
ru: Выполните `mount -urw`[.filename]#/#, измените `ro` обратно на `rw` в [.filename]#/etc/fstab# и перезагрузите систему снова.

source: Double-check the output from `mount` to ensure that `multilabel` has been properly set on the root file system.
ko: `mount` 의 출력을 다시 확인하여 `multilabel` 이 루트 파일 시스템에 올바르게 설정되었는지 확인합니다.
ru: Перепроверьте вывод команды `mount`, чтобы убедиться, что опция `multilabel` корректно установлена для корневой файловой системы.

source: After establishing a secure environment with MAC, Xorg no longer starts
ko: MAC으로 보안 환경을 설정한 후 Xorg가 더 이상 시작되지 않습니다
ru: После настройки безопасной среды с MAC, Xorg больше не запускается

source: This could be caused by the MAC `partition` policy or by a mislabeling in one of the MAC labeling policies. To debug, try the following:
ko: 이는 MAC `partition` 정책 또는 MAC 레이블링 정책 중 하나에서 잘못된 레이블링으로 인해 발생할 수 있습니다. 디버그하려면 다음을 시도해 보세요:
ru: Это может быть вызвано политикой MAC `partition` или ошибкой маркировки в одной из политик маркировки MAC. Для диагностики попробуйте следующее:

source: Check the error message. If the user is in the `insecure` class, the `partition` policy may be the culprit. Try setting the user's class back to the `default` class and rebuild the database with `cap_mkdb`. If this does not alleviate the problem, go to step two.
ko: 오류 메시지를 확인합니다. 사용자가 `insecure` 클래스에 속하는 경우 `partition` 정책이 원인일 수 있습니다. 사용자의 클래스를 `default` 클래스로 다시 설정하고 `cap_mkdb` 로 데이터베이스를 다시 빌드해 보세요. 그래도 문제가 해결되지 않으면 2단계로 이동합니다.
ru: Проверьте сообщение об ошибке. Если пользователь находится в классе `insecure`, проблема может быть в политике `partition`. Попробуйте вернуть пользователя в класс `default` и пересобрать базу данных с помощью `cap_mkdb`. Если это не решит проблему, перейдите ко второму шагу.

source: Double-check that the label policies are set correctly for the user, Xorg, and the [.filename]#/dev# entries.
ko: 레이블 정책이 사용자, Xorg 및 [.filename]#/dev# 항목에 대해 올바르게 설정되었는지 다시 확인합니다.
ru: Перепроверьте, что политики меток правильно установлены для пользователя, Xorg и записей в [.filename]#/dev#.
