Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/trademarks/_index.po
Languages: es, it_it

source: Guidelines for trademarks in the FreeBSD Documentation Project
es: Directrices para marcas registradas en el Proyecto de Documentación de FreeBSD
it_it: Linee guida sui marchi registrati nel FreeBSD Documentation Project

source: Chapter 13. Trademarks
it_it: Capitolo 13. Marchi Registrati

source: Trademarks
es: Marcas registradas
it_it: Marchi registrati

source: For all documents on the FreeBSD Documentation Project, citing registered trademarks is necessary and other trademarks is customary, and that is a requirement for every writer and contributor.
es: En todos los documentos del Proyecto de Documentación de FreeBSD es necesario citar las marcas registradas y es habitual citar otras marcas, y esto es un requisito para todo escritor y colaborador.
it_it: Per tutti i documenti del FreeBSD Documentation Project è necessario citare marchi registrati mentre citare altri marchi è prassi, e ciò costituisce un impegno per ogni scrittore e partecipante.

source: Trademark Symbols
es: Símbolos de marcas registradas
it_it: Simboli di marchio registrato

source: Append a trademark symbol ((TM), (R), or other) to the first occurrence of the trademarked name, and always when using logos. Use the extref:{fdp-primer}/writing-style/#writing-style-special-characters[equivalent ASCII sequence], which will be rendered as the actual Unicode character. Also, write the trademarked name following its trademark guidelines.
es: Añada un símbolo de marca comercial ((TM), (R) u otro) a la primera aparición del nombre de la marca, y siempre que utilice logotipos. Utilice el extref:{fdp-primer}/writing-style/#writing-style-special-characters[secuencia ASCII equivalente], que se representará como el carácter Unicode real. Además, escriba el nombre de la marca comercial siguiendo sus directrices.
it_it: Si aggiunga un simbolo di marchio registrato ((TM), (R) o altro simbolo) in coda alla prima occorrenza del nome del marchio e ogni volta che si usano loghi. Si usi la extref:{fdp-primer}/writing-style/#writing-style-special-characters[sequenza ASCII equivalente], che apparirà come il carattere Unicode corrispondente. Inoltre, si scriva il nome del marchio seguendo le linee guida del marchio stesso.

source: When in doubt, research the trademark owner's website, the product's website, and or the link:https://www.uspto.gov/trademarks[United States Patent and Trademark Office trademark search website].
es: En caso de duda, investigue en el sitio web del propietario de la marca, en el sitio web del producto o en el enlace:https://www.uspto.gov/trademarks[Sitio web de búsqueda de marcas de la Oficina de Patentes y Marcas de Estados Unidos].
it_it: Nel caso di dubbi, si svolgano ricerche sul sito internet del proprietario del marchio, sul sito del prodotto e/o sul link:https://www.uspto.gov/trademarks[sito di ricerca dei marchi dell'United States Patent and Trademark Office].

source: Trademark Citing
es: Citas de marcas
it_it: Citare marchi registrati

source: The FreeBSD Documentation Project provides a template for citing trademarks, which also avoids duplicating trademarks in the documents.
es: El Proyecto de Documentación de FreeBSD proporciona una plantilla para citar marcas registradas, que también evita duplicar marcas registradas en los documentos.
it_it: Il FreeBSD Documentation Project fornisce un template per citare marchi registrati, che permette anche di evitare la duplicazione di marchi nei documenti.

source: First, look for the trademark in the link:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[Copyright section in the project's template], then add it to the trademarks tag on the `Front Matter` section of the document, located at the beginning of each document.
es: En primer lugar, busque la marca en el enlace:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[sección Copyright de la plantilla del proyecto] y, a continuación, añádala a la etiqueta trademarks de la sección `Front Matter` del documento, situada al principio de cada documento.
it_it: Per prima cosa, si cerchi il marchio registrato nella ink:https://cgit.freebsd.org/doc/tree/documentation/themes/beastie/i18n/en.toml#n328[sezione dei copyright nel template del progetto], quindi lo si aggiunga al tag trademarks nella sezione `Frontespizio` del documento, che si trova all'inizio di ogni documento.

source: The following is an example of the `Front Matter` of the extref:{contributing}[Contributing to FreeBSD] article:
es: El siguiente es un ejemplo del `Front Matter` del artículo extref:{contributing}[Contribuyendo a FreeBSD]:
it_it: Quanto segue è un esempio di `Frontespizio` dall'articolo extref:{contributing}[Partecipare a FreeBSD]:

source: title: Contributing to FreeBSD authors: - author: Jordan Hubbard - author: Sam Lawrance - author: Mark Linimon description: How to contribute to the FreeBSD Project trademarks: ["freebsd", "ieee", "general"] weight: 15 tags: ["Contributing", "FreeBSD", "Non-Programmer Tasks", "Programmer Tasks"] ---
it_it: title: Contributing to FreeBSD authors: - author: Jordan Hubbard - author: Sam Lawrance - author: Mark Linimon description: Come partecipare al FreeBSD Project trademarks: ["freebsd", "ieee", "general"] weight: 15 tags: ["Partecipare", "FreeBSD", "Compiti per Non Programmatori", "Compiti per Programmatori"] ---

source: The trademark tags `freebsd`, `ieee`, and `general` will be automatically rendered when building the document like this:
es: Las etiquetas de marca `freebsd`, `ieee`, y `general` se renderizarán automáticamente al construir el documento de esta forma:
it_it: A seguito della compilazione del documento i tag di marchio registrato `freebsd`, `ieee` e `general` saranno automaticamente visualizzati come segue:

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
es: FreeBSD es una marca registrada de la FreeBSD Foundation.
it_it: FreeBSD è un marchio registrato della FreeBSD Foundation.

source: IEEE, POSIX, and 802 are registered trademarks of Institute of Electrical and Electronics Engineers, Inc. in the United States.
es: IEEE, POSIX y 802 son marcas registradas del Institute of Electrical and Electronics Engineers, Inc. en Estados Unidos.
it_it: IEEE, POSIX e 802 sono marchi registrate dell'Institute of Electrical and Electronics Engineers, Inc. negli United States.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the “™” or the “®” symbol.
es: Muchas de las designaciones usadas por fabricantes y vendedores para distinguir sus productos son reclamadas como marcas registradas. Cuando esas designaciones aparecen en este documento, y el Proyecto FreeBSD tiene conocimiento de la reclamación de marca registrada, las designaciones han sido seguidas por el símbolo "™" o "®".
it_it: Molti dei nomi identificativi usati dai produttori e dai venditori per distinguere i loro prodotti sono anche dei marchi. Quando questi nomi appaiono in questo documento, e il FreeBSD Project è al corrente del marchio, vengono fatti seguire dal simbolo “™” o “®”.

source: If a trademark is not present in the project's template, it must be submitted. Any developer or contributor can update the trademarks.
es: Si una marca no está presente en la plantilla del proyecto, debe presentarse. Cualquier desarrollador o colaborador puede actualizar las marcas.
it_it: Se un marchio registrato non è presente nel template del progetto, deve essere aggiunto. Qualsiasi programmatore o partecipante può aggiornare i marchi registrati.

source: The `freebsd` and `general` trademark tags are usually present in all documents.
es: Las etiquetas de marca `freebsd` y `general` suelen estar presentes en todos los documentos.
it_it: I marchi registrati `freebsd` e `general` sono solitamente presenti in tutti i documenti.

source: Chapter 14. Trademarks
es: Capítulo 14. Marcas registradas
