Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: `Shell` opens a shell prompt where advanced users can create customized partitions using command-line utilities like man:gpart[8], man:fdisk[8], and man:bsdlabel[8].
es: `Shell` abre un símbolo del sistema (shell) donde los usuarios avanzados pueden crear particiones personalizadas utilizando utilidades de línea de comandos como man:gpart[8], man:fdisk[8] y man:bsdlabel[8].
ru: `Оболочка (Shell)` открывает командную оболочку, где опытные пользователи могут создавать настраиваемые разделы с помощью утилит командной строки, таких как man:gpart[8], man:fdisk[8] и man:bsdlabel[8].

source: This section describes what to consider when laying out the disk partitions. It then demonstrates how to use the different partitioning methods.
es: Esta sección describe lo que se debe tener en cuenta al diseñar las particiones del disco. A continuación, demuestra cómo utilizar los diferentes métodos de particionado.
ru: Этот раздел описывает, что следует учитывать при разметке разделов диска. Затем демонстрируется, как использовать различные методы разметки.

source: Designing the Partition Layout
es: Diseño de la distribución de las particiones
ru: Проектирование разметки разделов

source: The default partition layout for file systems includes one file system for the entire system. When using `UFS` it may be worth considering the use of multiple file systems with sufficient disk space or multiple disks available. When laying out file systems, remember that hard drives transfer data faster from the outer tracks to the inner. Thus, smaller and heavier-accessed file systems should be closer to the outside of the drive, while larger partitions like `/usr` should be placed toward the inner parts of the disk. It is a good idea to create partitions in an order similar to: `/`, swap, `/var`, and `/usr`.
es: La distribución de las particiones por defecto para los sistemas de archivos incluye un único sistema de archivos para todo el sistema. Al utilizar `UFS`, puede valer la pena considerar el uso de múltiples sistemas de archivos si se dispone de suficiente espacio en disco o de varios discos. Al diseñar la distribución de los sistemas de archivos, recuerde que los discos duros transfieren datos más rápido desde las pistas exteriores hacia las interiores. Por lo tanto, los sistemas de archivos más pequeños y con mayor frecuencia de acceso deben estar más cerca del exterior de la unidad, mientras que las particiones más grandes como `/usr` deben colocarse hacia las partes internas del disco. Es una buena idea crear las particiones en un orden similar a: `/`, swap, `/var` y `/usr`.

source: The size of the `/var` partition reflects the intended machine's usage. This partition is used to hold mailboxes, log files, and printer spools. Mailboxes and log files can grow to unexpected sizes depending on the number of users and how long log files are kept. On average, most users rarely need more than about a gigabyte of free disk space in `/var`.
es: El tamaño de la partición `/var` refleja el uso previsto de la máquina. Esta partición se utiliza para contener buzones de correo, archivos de registro (logs) y colas de impresión. Los buzones de correo y los archivos de registro pueden crecer hasta tamaños inesperados dependiendo del número de usuarios y de cuánto tiempo se conserven los registros. En promedio, la mayoría de los usuarios rara vez necesitan más de un gigabyte de espacio libre en `/var`.
ru: Размер раздела `/var` зависит от предполагаемого использования машины. Этот раздел используется для хранения почтовых ящиков, файлов журналов и очередей печати. Почтовые ящики и файлы журналов могут достигать неожиданно больших размеров в зависимости от количества пользователей и срока хранения журналов. В среднем большинству пользователей редко требуется более одного гигабайта свободного места на диске в `/var`.

source: Sometimes, a lot of disk space is required in `/var/tmp`. When new software is installed, the packaging tools extract a temporary copy of the packages under `/var/tmp`. Large software packages, like Firefox or LibreOffice may be tricky to install if there is not enough disk space under `/var/tmp`.
es: A veces, se requiere mucho espacio en disco en `/var/tmp`. Cuando se instala software nuevo, las herramientas de empaquetado extraen una copia temporal de los paquetes bajo `/var/tmp`. Los paquetes de software grandes, como Firefox o LibreOffice, pueden ser difíciles de instalar si no hay suficiente espacio en disco en `/var/tmp`.
ru: Иногда в `/var/tmp` требуется много дискового пространства. При установке нового программного обеспечения утилиты управления пакетами извлекают временную копию пакетов в `/var/tmp`. У крупных пакетов, таких как Firefox или LibreOffice, могут возникнуть сложности во время установки, если в `/var/tmp` недостаточно места на диске.

source: The `/usr` partition holds many of the files which support the system, including the FreeBSD Ports Collection and system source code. At least 2 gigabytes of space is recommended for this partition. Also, note that home directories for users are placed in `/usr/home` by default, but can be placed on another partition. By default, `/home` is a symbolic link to `/usr/home`.
es: La partición `/usr` contiene muchos de los archivos que dan soporte al sistema, incluyendo la Colección de Ports de FreeBSD y el código fuente del sistema. Se recomienda al menos 2 gigabytes de espacio para esta partición. Además, tenga en cuenta que los directorios personales de los usuarios se ubican en `/usr/home` por defecto, pero pueden situarse en otra partición. Por defecto, `/home` es un enlace simbólico a `/usr/home`.
ru: Раздел `/usr` содержит множество файлов, поддерживающих систему, включая коллекцию портов FreeBSD и исходный код системы. Для этого раздела рекомендуется выделить не менее 2 гигабайт пространства. Также учтите, что домашние каталоги пользователей по умолчанию размещаются в `/usr/home`, но могут быть расположены на другом разделе. По умолчанию `/home` является символической ссылкой на `/usr/home`.

source: When selecting partition sizes, keep the space requirements in mind. Running out of space in one partition while barely using another can be a hassle.
es: Al seleccionar los tamaños de las particiones, tenga en cuenta los requisitos de espacio. Quedarse sin espacio en una partición mientras apenas se utiliza otra puede ser un problema.
ru: При выборе размера разделов учитывайте требования к пространству. Нехватка места в одном разделе при почти полном отсутствии использования другого может создать проблемы.

source: As a rule of thumb, the swap partition should be about double the size of physical memory (RAM). Systems with minimal RAM (less for larger-memory configurations) may perform better with more swap. Configuring too little swap can lead to inefficiencies in the VM page scanning code and might create issues later if more memory is added.
es: Como regla general, la partición swap debe tener aproximadamente el doble del tamaño de la memoria física (RAM). Los sistemas con RAM mínima (menos en configuraciones de memoria mayor) pueden funcionar mejor con más swap. Configurar muy poca swap puede provocar ineficiencias en el código de escaneo de páginas de la memoria virtual (VM) y podría generar problemas más adelante si se añade más memoria.
ru: Как правило, размер раздела подкачки должен быть примерно в два раза больше объема физической памяти (RAM). Системам с малым объемом RAM (меньше для конфигураций с большим объемом памяти) может быть полезно иметь больше область подкачки. Слишком маленький объем подкачки может привести к неэффективности работы кода сканирования страниц виртуальной памяти и создать проблемы в будущем при добавлении памяти.

source: On larger systems with multiple SCSI disks or multiple IDE disks operating on different controllers, it is recommended that swap be configured on each drive, up to four drives. The swap partitions should be approximately the same size. The kernel can handle arbitrary sizes, but internal data structures scale to 4 times the largest swap partition. Keeping the swap partitions near the same size will allow the kernel to optimally stripe swap space across disks. Large swap sizes may elicit a kernel warning message about the total configured swap. The limit is raised by increasing the amount of memory allowed for keeping track of swap allocations, as instructed by the warning message. It might be easier to recover from a runaway program before being forced to reboot.
es: En sistemas más grandes con múltiples discos SCSI o múltiples discos IDE que operan en diferentes controladoras, se recomienda configurar la swap en cada unidad, hasta un máximo de cuatro unidades. Las particiones swap deben tener aproximadamente el mismo tamaño. El kernel puede manejar tamaños arbitrarios, pero las estructuras de datos internas se escalan a 4 veces el tamaño de la partición swap más grande. Mantener las particiones swap con un tamaño similar permitirá al kernel realizar un "striping" óptimo del espacio de intercambio entre los discos. Los tamaños de swap muy grandes pueden provocar un mensaje de advertencia del kernel sobre el total de swap configurado. El límite se aumenta incrementando la cantidad de memoria permitida para realizar el seguimiento de las asignaciones de swap, tal como indica el mensaje de advertencia. Podría ser más fácil recuperarse de un programa fuera de control antes de verse obligado a reiniciar.
ru: На больших системах с несколькими SCSI-дисками или несколькими IDE-дисками, работающими на разных контроллерах, рекомендуется настраивать раздел подкачки на каждом диске, вплоть до четырёх дисков. Разделы подкачки должны быть примерно одинакового размера. Ядро может обрабатывать разделы произвольного размера, но внутренние структуры данных масштабируются до 4-кратного размера наибольшего раздела подкачки. Поддержание разделов подкачки примерно одинакового размера позволит ядру оптимально распределять пространство подкачки по дискам. Большие размеры подкачки могут вызвать предупреждение ядра о суммарном объёме настроенной подкачки. Лимит можно увеличить, выделив больше памяти для отслеживания распределения подкачки, как указано в сообщении с предупреждением. Это может облегчить восстановление после сбоя программы без необходимости перезагрузки системы.

source: By properly partitioning a system, fragmentation introduced in the smaller write-heavy partitions will not bleed over into the mostly read partitions. Keeping the write-loaded partitions closer to the disk's edge will increase I/O performance in the partitions where it occurs the most. While I/O performance in the larger partitions may be needed, shifting them more toward the edge of the disk will not lead to a significant performance improvement over moving `/var` to the edge.
es: Al particionar un sistema adecuadamente, la fragmentación introducida en las particiones pequeñas con gran carga de escritura no se propagará a las particiones que son mayoritariamente de lectura. Mantener las particiones con mayor carga de escritura más cerca del borde del disco aumentará el rendimiento de E/S en las particiones donde más ocurre. Aunque el rendimiento de E/S en las particiones más grandes puede ser necesario, desplazarlas más hacia el borde del disco no supondrá una mejora de rendimiento tan significativa como mover `/var` al borde.
ru: Правильное разделение системы на разделы предотвращает распространение фрагментации, возникающей в небольших разделах с высокой нагрузкой на запись, на преимущественно читаемые разделы. Размещение разделов с высокой нагрузкой на запись ближе к краю диска повышает производительность ввода-вывода в тех разделах, где это наиболее критично. Хотя производительность ввода-вывода в крупных разделах также может быть важной, их смещение ближе к краю диска не даст значительного прироста производительности по сравнению с перемещением `/var` к краю.

source: Guided Partitioning Using UFS
es: Particionado guiado mediante UFS
ru: Разметка диска с использованием UFS с помощью мастера

source: When this method is selected, a menu will display the available disk(s). If multiple disks are connected, choose the one where FreeBSD is to be installed.
es: Cuando se selecciona este método, un menú mostrará el disco o los discos disponibles. Si hay varios discos conectados, elija aquel donde se va a instalar FreeBSD.
ru: При выборе этого метода отобразится меню с доступными дисками. Если подключено несколько дисков, выберите тот, на который будет установлена FreeBSD.

source: Selecting from Multiple Disks
es: Selección entre varios discos
ru: Выбор из нескольких дисков

source: Shows the list of disks on which FreeBSD can be installed
es: Muestra la lista de discos en los que se puede instalar FreeBSD
ru: Показывает список дисков, на которые может быть установлена FreeBSD

source: Once the disk is selected, the next menu prompts to install to either the entire disk or to create a partition using free space. If btn:[Entire Disk] is chosen, a general partition layout filling the whole disk is automatically created. Selecting btn:[Partition] creates a partition layout from the unused space on the disk.
es: Una vez seleccionado el disco, el siguiente menú preguntará si desea realizar la instalación en el disco completo o crear una partición utilizando el espacio libre. Si se elige btn:[Entire Disk], se crea automáticamente un esquema de particiones general que ocupa todo el disco. Al seleccionar btn:[Partition], se crea un esquema de particiones a partir del espacio no utilizado en el disco.
ru: После выбора диска в следующем меню предлагается установить систему на весь диск или создать раздел в свободном пространстве. Если выбран btn:[Весь диск], автоматически создаётся общая схема разделов, занимающая весь диск. При выборе btn:[Раздел] создаётся схема разделов из неиспользуемого пространства на диске.

source: Selecting Entire Disk or Partition
es: Selección de disco completo o partición
ru: Выбор всего диска или раздела

source: Menu asking the user if he wants to use all the available space on the disk or wants to make a partition
es: Menú que pregunta al usuario si desea utilizar todo el espacio disponible en el disco o si desea crear una partición
ru: Меню с вопросом к пользователю, хочет ли он использовать все доступное пространство на диске или создать раздел

source: After the btn:[Entire Disk] option is chosen, bsdinstall displays a dialog indicating that the disk will be erased.
es: Después de elegir la opción btn:[Entire Disk], bsdinstall muestra un cuadro de diálogo que indica que el disco será borrado.
ru: После выбора варианта btn:[Весь диск] программа bsdinstall отображает диалоговое окно с предупреждением о том, что диск будет очищен.

source: Confirmation
es: Confirmación
ru: Подтверждение

source: Menu indicating the user that all data on the disk will be deleted and asking for confirmation
es: Menú que indica al usuario que todos los datos del disco se borrarán y solicita confirmación
ru: Меню, предупреждающее пользователя о том, что все данные на диске будут удалены, и запрашивающее подтверждение

source: The next menu shows a list with the available partition scheme types. GPT is usually the most appropriate choice for amd64 computers. Older computers that are not compatible with GPT should use MBR. The other partition schemes are generally used for uncommon or older computers. More information is available in crossref:bsdinstall[partition-schemes,Partitioning Schemes].
es: El siguiente menú muestra una lista con los tipos de esquemas de particiones disponibles. GPT suele ser la opción más apropiada para ordenadores amd64. Los ordenadores más antiguos que no son compatibles con GPT deben utilizar MBR. Los demás esquemas de particiones se utilizan generalmente para ordenadores poco comunes o antiguos. Hay más información disponible en crossref:bsdinstall[partition-schemes,Esquemas de particionado].
ru: Следующее меню показывает список доступных типов схем разделов. GPT обычно является наиболее подходящим выбором для компьютеров amd64. Более старые компьютеры, несовместимые с GPT, должны использовать MBR. Остальные схемы разделов, как правило, применяются для редких или устаревших компьютеров. Дополнительная информация доступна в таблице crossref:bsdinstall[partition-schemes,Схемы разделов].

source: Select Partition Scheme
es: Seleccionar el esquema de particiones
ru: Выбор схемы разделов

source: Menu showing the user the different the different types of partition that exist and requesting one of them
es: Menú que muestra al usuario los diferentes tipos de esquemas de particionado existentes y le solicita que elija uno
ru: Меню, показывающее пользователю различные типы существующих разделов и запрашивающее выбор одного из них

source: After the partition layout has been created, review it to ensure it meets the needs of the installation. Selecting btn:[Revert] will reset the partitions to their original values. Pressing btn:[Auto] will recreate the automatic FreeBSD partitions. Partitions can also be manually created, modified, or deleted. When the partitioning is correct, select btn:[Finish] to continue with the installation.
es: Después de crear la distribución de las particiones, revísela para asegurarse de que satisface las necesidades de la instalación. Al seleccionar btn:[Revert] se restablecerán las particiones a sus valores originales. Al pulsar btn:[Auto] se volverán a crear las particiones automáticas de FreeBSD. Las particiones también pueden crearse, modificarse o eliminarse manualmente. Cuando el particionado sea correcto, seleccione btn:[Finish] para continuar con la instalación.
ru: После создания разметки разделов просмотрите её, чтобы убедиться, что она соответствует требованиям установки. Выбор btn:[Отменить (Revert)] вернёт разделы к исходным значениям. Нажатие btn:[Автоматически (Auto)] воссоздаст автоматические разделы FreeBSD. Разделы также можно создавать, изменять или удалять вручную. Когда разметка разделов будет правильной, выберите btn:[Готово (Finish)] для продолжения установки.

source: Review Created Partitions
es: Revisar las particiones creadas
ru: Проверка созданных разделов

source: Menu showing created partitions
es: Menú que muestra las particiones creadas
ru: Меню с созданными разделами

source: Once the disks are configured, the next menu provides the last chance to make changes before the selected drives are formatted. If changes need to be made, select btn:[Back] to return to the main partitioning menu. btn:[Revert & Exit] exits the installer without making any changes to the drive. Otherwise, select btn:[Commit] to start the installation process.
es: Una vez configurados los discos, el siguiente menú ofrece la última oportunidad de realizar cambios antes de que se formateen las unidades seleccionadas. Si es necesario realizar cambios, seleccione btn:[Back] para volver al menú principal de particionado. btn:[Revert & Exit] sale del instalador sin realizar ningún cambio en la unidad. De lo contrario, seleccione btn:[Commit] para iniciar el proceso de instalación.
ru: После настройки дисков в следующем меню предоставляется последняя возможность внести изменения перед форматированием выбранных накопителей. Если изменения необходимы, выберите btn:[Назад], чтобы вернуться в главное меню разметки. btn:[Отменить & Выйти] завершает работу установщика без внесения изменений в накопитель. В противном случае выберите btn:[Применить], чтобы начать процесс установки.

source: Final Confirmation
es: Confirmación final
ru: Окончательное подтверждение

source: Menu indicating to the user that all changes will be written to disk and informing that if he decides to continue the existing data will be permanently deleted.
es: Menú que indica al usuario que todos los cambios se escribirán en el disco e informa que, si decide continuar, los datos existentes se borrarán permanentemente.
ru: Меню, уведомляющее пользователя о том, что все изменения будут записаны на диск, и предупреждающее, что в случае продолжения существующие данные будут безвозвратно удалены.

source: To continue with the installation process, go to crossref:bsdinstall[bsdinstall-fetching-distribution, Fetching Distribution Files].
es: Para continuar con el proceso de instalación, vaya a crossref:bsdinstall[bsdinstall-fetching-distribution, Obtención de los archivos de distribución].
ru: Для продолжения процесса установки перейдите к разделу crossref:bsdinstall[bsdinstall-fetching-distribution, Загрузка файлов дистрибутива].

source: Manual Partitioning
es: Particionado manual
ru: Ручное разбиение на разделы

source: Selecting this method opens the partition editor:
es: Al seleccionar este método, se abre el editor de particiones:
ru: Выбор этого метода открывает редактор разделов:

source: Manually Create Partitions
es: Crear particiones manualmente
ru: Ручное создание разделов

source: Menu showing the Partition Editor.
es: Menú que muestra el editor de particiones.
ru: Меню с отображением редактора разделов.

source: Highlight the installation drive (`ada0` in this example) and select btn:[Create] to display a menu of available partition schemes:
es: Resalte la unidad de instalación (`ada0` en este ejemplo) y seleccione btn:[Create] para mostrar un menú con los esquemas de particionado disponibles:
ru: Выделите диск для установки (в данном примере `ada0`) и нажмите btn:[Создать (Create)], чтобы отобразить меню доступных схем разделов:

source: Menu showing the different kind of partition schemes
es: Menú que muestra los diferentes tipos de esquemas de particionado
ru: Меню с различными типами схем разделов

source: GPT is usually the most appropriate choice for amd64 computers. Older computers that are not compatible with GPT should use MBR. The other partition schemes are generally used for uncommon or older computers.
es: GPT suele ser la opción más apropiada para ordenadores amd64. Los ordenadores más antiguos que no son compatibles con GPT deben utilizar MBR. Los demás esquemas de particiones se utilizan generalmente para ordenadores poco comunes o antiguos.
ru: Для компьютеров на архитектуре amd64 обычно наиболее подходящим выбором является GPT. Старые компьютеры, несовместимые с GPT, должны использовать MBR. Остальные схемы разделов, как правило, применяются для редких или устаревших компьютеров.

source: Partitioning Schemes
es: Esquemas de particionado
ru: Схемы разделов

source: Abbreviation
es: Abreviatura
ru: Сокращение

source: Description
es: Descripción
ru: Описание

source: Apple Partition Map, used by PowerPC(R).
es: Apple Partition Map, utilizado por PowerPC(R).
ru: Apple Partition Map, используется в PowerPC(R).

source: BSD label without an MBR, sometimes called _dangerously dedicated mode_ as non-BSD disk utilities may not recognize it.
es: Etiqueta BSD sin MBR, a veces llamada _dangerously dedicated mode_ (modo peligrosamente dedicado), ya que las utilidades de disco que no son BSD podrían no reconocerla.
ru: Метка BSD без MBR, иногда называемая _опасно выделенным режимом_, так как не-BSD утилиты для работы с дисками могут её не распознать.
