Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: `disable_syslogd` - Disable opening the syslogd network socket. By default, FreeBSD runs syslogd in a secure way with `-s`. This prevents the daemon from listening for incoming UDP requests on port 514. With this option enabled, syslogd will instead run with `-ss`, which prevents syslogd from opening any port. For more information, see man:syslogd[8].
es: `disable_syslogd` - Deshabilita la apertura del socket de red de syslogd. Por defecto, FreeBSD ejecuta syslogd de forma segura con la opción `-s`. Esto evita que el demonio escuche peticiones UDP entrantes en el puerto 514. Con esta opción habilitada, syslogd se ejecutará con `-ss`, lo que impide que syslogd abra cualquier puerto. Para más información, consulte man:syslogd[8].
ru: `disable_syslogd` — Отключить открытие сетевого сокета syslogd. По умолчанию FreeBSD запускает syslogd в безопасном режиме с параметром `-s`, что предотвращает прослушивание входящих UDP-запросов на порту 514. При включении этой опции syslogd будет запущен с параметром `-ss`, что запрещает ему открывать какие-либо порты. Подробнее см. man:syslogd[8].

source: `disable_sendmail` - Disable the sendmail mail transport agent.
es: `disable_sendmail` - Deshabilita el agente de transferencia de correo sendmail.
ru: `disable_sendmail` — Отключить почтовый транспортный агент sendmail.

source: `secure_console` - Make the command prompt request the `root` password when entering single-user mode.
es: `secure_console` - Hace que el intérprete de comandos solicite la contraseña de `root` al entrar en modo monousuario.
ru: `secure_console` — заставляет командную строку запрашивать пароль `root` при входе в однопользовательский режим.

source: `disable_ddtrace` - DTrace can run in a mode that affects the running kernel. Destructive actions may not be used unless explicitly enabled. Use `-w` to enable this option when using DTrace. For more information, see man:dtrace[1].
es: `disable_ddtrace` - DTrace puede ejecutarse en un modo que afecta al kernel en ejecución. No se pueden utilizar acciones destructivas a menos que se habiliten explícitamente. Use la opción `-w` para habilitar esto cuando utilice DTrace. Para más información, consulte man:dtrace.
ru: `disable_ddtrace` — DTrace может работать в режиме, который влияет на работающее ядро. Деструктивные действия не могут быть использованы, если они явно не включены. Используйте `-w` для включения этой опции при работе с DTrace. Для получения дополнительной информации см. man:dtrace[1].

source: `enable_aslr` - Enable address layout randomization. For more information about address layout randomization the link:https://en.wikipedia.org/wiki/Address_space_layout_randomization[Wikipedia article] can be consulted.
es: `enable_aslr` - Habilita la aleatorización del diseño del espacio de direcciones. Para obtener más información sobre la aleatorización del diseño del espacio de direcciones, puede consultar el link:https://en.wikipedia.org/wiki/Address_space_layout_randomization[artículo de Wikipedia].
ru: `enable_aslr` — Включить рандомизацию раскладки адресного пространства. Для получения дополнительной информации о рандомизации раскладки адресного пространства можно обратиться к link:https://en.wikipedia.org/wiki/Address_space_layout_randomization[статье в Википедии].

source: Add Users
es: Agregar usuarios
ru: Добавление пользователей

source: The next menu prompts to create at least one user account. It is recommended to log into the system using a user account rather than as `root`. When logged in as `root`, there are essentially no limits or protection on what can be done. Logging in as a normal user is safer and more secure.
es: El siguiente menú solicita la creación de al menos una cuenta de usuario. Se recomienda iniciar sesión en el sistema con una cuenta de usuario en lugar de hacerlo como `root`. Cuando se inicia sesión como `root`, esencialmente no hay límites ni protección sobre lo que se puede hacer. Iniciar sesión como un usuario normal es más seguro y fiable.
ru: Следующее меню предлагает создать хотя бы одну учетную запись пользователя. Рекомендуется входить в систему под учетной записью пользователя, а не как `root`. При входе под `root` практически отсутствуют ограничения или защита от возможных действий. Вход под обычным пользователем безопаснее и надежнее.

source: Select btn:[Yes] to add new users.
es: Seleccione btn:[Yes] para agregar nuevos usuarios.
ru: Выберите btn:[Да], чтобы добавить новых пользователей.

source: Add User Accounts
es: Agregar cuentas de usuario
ru: Добавить учетные записи пользователей

source: Menu requesting if a user want to be added to the system.
es: Menú que pregunta si se desea agregar un usuario al sistema.
ru: Меню с запросом о желании пользователя быть добавленным в систему.

source: Follow the prompts and input the requested information for the user account. The example shown in crossref:bsdinstall[bsdinstall-add-user2,Enter User Information] creates the `asample` user account.
es: Siga las instrucciones e introduzca la información solicitada para la cuenta de usuario. El ejemplo mostrado en crossref:bsdinstall[bsdinstall-add-user2,Enter User Information] crea la cuenta de usuario `asample`.
ru: Следуйте подсказкам и введите запрашиваемую информацию для учетной записи пользователя. Пример, показанный в crossref:bsdinstall[bsdinstall-add-user2,Ввод информации о пользователе], создает учетную запись пользователя `asample`.

source: Enter User Information
es: Introducir información del usuario
ru: Введите информацию о пользователе

source: Menu requesting different information for the new user.
es: Menú que solicita diferente información para el nuevo usuario.
ru: Меню, запрашивающее различную информацию для нового пользователя.

source: Here is a summary of the information to input:
es: Aquí hay un resumen de la información a introducir:
ru: Вот сводка информации для ввода:

source: `Username` - The name the user will enter to log in. A common convention is to use the first letter of the first name combined with the last name, as long as each username is unique for the system. The username is case sensitive and should not contain any spaces.
es: `Username` - El nombre que el usuario introducirá para iniciar sesión. Una convención común es utilizar la primera letra del nombre combinada con el apellido, siempre que cada nombre de usuario sea único en el sistema. El nombre de usuario distingue entre mayúsculas y minúsculas y no debe contener espacios.
ru: `Имя пользователя (Username)` — Имя пользователя, которое будет использоваться для входа. Обычно применяется соглашение, согласно которому имя пользователя формируется из первой буквы имени и фамилии, при условии что каждое имя пользователя уникально в системе. Имя пользователя чувствительно к регистру и не должно содержать пробелов.

source: `Full name` - The user's full name. This can contain spaces and is used as a description for the user account.
es: `Full name` - El nombre completo del usuario. Esto puede contener espacios y se utiliza como descripción para la cuenta de usuario.
ru: `Полное имя (Full name)` — Полное имя пользователя. Может содержать пробелы и используется в качестве описания учётной записи пользователя.

source: `Uid` - User ID. This is typically left blank so the system automatically assigns a value.
es: `Uid` - ID de usuario. Normalmente se deja en blanco para que el sistema asigne uno automáticamente.
ru: `Uid` - Идентификатор пользователя. Обычно оставляется пустым, чтобы система автоматически назначила значение.

source: `Login group` - The user's group. This is typically left blank to accept the default.
es: `Login group` - El grupo de inicio de sesión del usuario. Normalmente se deja en blanco para aceptar el valor predeterminado.
ru: `Группа (Login group)` - Группа пользователя. Обычно оставляется пустым для использования значения по умолчанию.

source: `Invite _user_ into other groups?` - Additional groups to which the user will be added as a member. If the user needs administrative access, type `wheel` here.
es: `Invite _user_ into other groups?` - Grupos adicionales a los que el usuario será añadido como miembro. Si el usuario necesita acceso administrativo, escriba `wheel` aquí.
ru: `Добавить _пользователя_ в другие группы?` — Дополнительные группы, в которые будет добавлен пользователь. Если пользователю нужны административные права, укажите здесь `wheel`.

source: `Login class` - Typically left blank for the default.
es: `Login class` - Normalmente se deja en blanco para el valor predeterminado.
ru: `Класс логина (Login class)` - Обычно оставляется пустым для значений по умолчанию.

source: `Shell` - Type in one of the listed values to set the interactive shell for the user. Refer to crossref:basics[shells,Shells] for more information about shells.
es: `Shell` - Escriba uno de los valores enumerados para establecer la shell interactiva para el usuario. Consulte crossref:basics[shells,Shells] para obtener más información sobre las shells.
ru: `Оболочка (Shell)` - Введите одно из предложенных значений, чтобы установить интерактивную оболочку для пользователя. Дополнительную информацию об оболочках см. в crossref:basics[shells,Оболочки].

source: `Home directory` - The user's home directory. The default is usually correct.
es: `Home directory` - El directorio de inicio del usuario. El valor predeterminado suele ser el correcto.
ru: `Домашний каталог (Home directory)` - Домашний каталог пользователя. Обычно значение по умолчанию является правильным.

source: `Home directory permissions` - Permissions on the user's home directory. The default is usually correct.
es: `Home directory permissions` - Permisos en el directorio de inicio del usuario. El valor predeterminado suele ser el correcto.
ru: `Права доступа к домашнему каталогу (Home directory permissions)` - Права доступа к домашнему каталогу пользователя. Обычно значение по умолчанию является правильным.

source: `Use password-based authentication?` - Typically `yes` so that the user is prompted to input their password at login.
es: `Use password-based authentication?` - Normalmente `yes` para que se le pida al usuario que introduzca su contraseña al iniciar sesión.
ru: `Использовать аутентификацию на основе пароля (Use password-based authentication)?` - Обычно `yes`, чтобы пользователь вводил пароль при входе.

source: `Use an empty password?` - Typically `no` as empty or blank passwords are insecure.
es: `Use an empty password?` - Normalmente `no`, ya que las contraseñas vacías o en blanco son inseguras.
ru: `Использовать пустой пароль (Use an empty password)?` - Обычно `нет`, так как пустые или простые пароли ненадёжны.

source: `Use a random password?` - Typically `no` so that the user can set their own password in the next prompt.
es: `Use a random password?` - Normalmente `no` para que el usuario pueda establecer su propia contraseña en la siguiente solicitud.
ru: `Использовать случайный пароль (Use a random password)?` - Обычно `нет`, чтобы пользователь мог установить свой пароль в следующем запросе.

source: `Enter password` - The password for this user. Typed-in characters will not be shown on the screen.
es: `Enter password` - La contraseña para este usuario. Los caracteres escritos no se mostrarán en la pantalla.
ru: `Введите пароль (Enter password)` - Пароль для этого пользователя. Вводимые символы не будут отображаться на экране.

source: `Enter password again` - The password must be typed again for verification.
es: `Enter password again` - La contraseña debe escribirse de nuevo para su verificación.
ru: `Повторите пароль (Enter password again)` - Пароль должен быть введён повторно для проверки.

source: `Lock out the account after creation?` - Typically `no` so that the user can log in.
es: `Lock out the account after creation?` - Normalmente `no` para que el usuario pueda iniciar sesión.
ru: `Заблокировать учетную запись после создания (Lock out the account after creation)?` - Обычно `нет`, чтобы пользователь мог войти в систему.

source: After entering all the details, a summary is shown for review. If a mistake was made, enter `no` to correct it. Once everything is correct, enter `yes` to create the new user.
es: Después de introducir todos los detalles, se muestra un resumen para su revisión. Si se cometió un error, introduzca `no` para corregirlo. Una vez que todo esté correcto, introduzca `yes` para crear el nuevo usuario.
ru: После ввода всех данных отображается сводка для проверки. Если была допущена ошибка, введите `no`, чтобы исправить её. Когда всё верно, введите `yes` для создания нового пользователя.

source: Exit User and Group Management
es: Salir de la administración de usuarios y grupos
ru: Выход из управления пользователями и группами

source: Menu showing the information of the new user and requesting if everything is correct.
es: Menú que muestra la información del nuevo usuario y pregunta si todo es correcto.
ru: Меню с информацией о новом пользователе и запросом на подтверждение корректности данных.

source: If there are more users to add, answer the `Add another user?` question with `yes`. Enter `no` to finish adding users and continue the installation.
es: Si hay más usuarios que añadir, responda a la pregunta `Add another user?` con `yes`. Introduzca `no` para terminar de añadir usuarios y continuar la instalación.
ru: Если нужно добавить других пользователей, ответьте `yes` на вопрос `Добавить другого пользователя (Add another user)?`. Введите `no`, чтобы завершить добавление пользователей и продолжить установку.

source: For more information on adding users and user management, see crossref:basics[users-synopsis,Users and Basic Account Management].
es: Para obtener más información sobre cómo añadir usuarios y la gestión de usuarios, consulte crossref:basics[users-synopsis,Users and Basic Account Management] para obtener más información.
ru: Для получения дополнительной информации о добавлении пользователей и управлении учетными записями см. crossref:basics[users-synopsis,Пользователи и основы управления учетными записями].

source: Final Configuration
es: Configuración final
ru: Окончательная конфигурация

source: After everything has been installed and configured, a final chance is provided to modify settings.
es: Después de que todo haya sido instalado y configurado, se ofrece una última oportunidad para modificar los ajustes.
ru: После установки и настройки всех компонентов предоставляется последняя возможность изменить параметры.

source: Menu showing different options to perform before finishing the installation. Ex: Add user
es: Menú que muestra diferentes opciones a realizar antes de finalizar la instalación. Ej: Añadir usuario
ru: Меню с различными вариантами действий перед завершением установки. Например: Добавить пользователя

source: Use this menu to make any changes or to do any additional configuration before completing the installation.
es: Use este menú para realizar cualquier cambio o para hacer cualquier configuración adicional antes de completar la instalación.
ru: Используйте это меню для внесения изменений или выполнения дополнительной настройки перед завершением установки.

source: `Add User` - Described in crossref:bsdinstall[bsdinstall-addusers, Add Users].
es: `Add User` - Descrito en crossref:bsdinstall[bsdinstall-addusers, Add Users].
ru: `Добавить пользователя (Add User)` - Описано в crossref:bsdinstall[bsdinstall-addusers, Добавление пользователей].

source: `Root Password` - Described in crossref:bsdinstall[bsdinstall-post-root, Setting the `root` Password].
es: `Root Password` - Descrito en crossref:bsdinstall[bsdinstall-post-root, Setting the `root` Password].
ru: `Пароль root (Root Password)` - Описано в crossref:bsdinstall[bsdinstall-post-root, Установка пароля `root`].

source: `Hostname` - Described in crossref:bsdinstall[bsdinstall-hostname, Setting the Hostname].
es: `Hostname` - Descrito en crossref:bsdinstall[bsdinstall-hostname, Setting the Hostname].
ru: `Имя хоста (Hostname)` - Описано в crossref:bsdinstall[bsdinstall-hostname, Установка имени хоста].

source: `Network` - Described in crossref:bsdinstall[bsdinstall-config-network-dev, Configuring Network Interfaces].
es: `Network` - Descrito en crossref:bsdinstall[bsdinstall-config-network-dev, Configuring Network Interfaces].
ru: `Сеть (Network)` - Описано в crossref:bsdinstall[bsdinstall-config-network-dev, Настройка сетевых интерфейсов].

source: `Services` - Described in crossref:bsdinstall[bsdinstall-sysconf, Enabling Services].
es: `Services` - Descrito en crossref:bsdinstall[bsdinstall-sysconf, Enabling Services].
ru: `Службы (Services)` - Описано в crossref:bsdinstall[bsdinstall-sysconf, Включение служб].

source: `System Hardening` - Described in crossref:bsdinstall[bsdinstall-hardening, Enabling Hardening Security Options].
es: `System Hardening` - Descrito en crossref:bsdinstall[bsdinstall-hardening, Enabling Hardening Security Options].
ru: `Усиление защиты системы (System Hardening)` - Описано в crossref:bsdinstall[bsdinstall-hardening, Включение опций усиления безопасности].

source: `Time Zone` - Described in crossref:bsdinstall[bsdinstall-timezone, Setting the Time Zone].
es: `Time Zone` - Descrito en crossref:bsdinstall[bsdinstall-timezone, Setting the Time Zone].
ru: `Часовая зона (Time Zone)` - Описано в crossref:bsdinstall[bsdinstall-timezone, Настройка часовой зоны].

source: `Handbook` - Download and install the FreeBSD Handbook.
es: `Handbook` - Descargue e instale el Manual de FreeBSD.
ru: `Руководство (Handbook)` - Загрузить и установить Руководство FreeBSD.

source: Once configuration is complete, select btn:[Exit].
es: Una vez que la configuración esté completa, seleccione btn:[Exit].
ru: После завершения настройки выберите btn:[Выход (Exit)].

source: Manual Configuration
es: Configuración manual
ru: Ручная настройка

source: Menu showing that the installation has finished. And asking if a shell to make manual changes should open.
es: Menú que muestra que la instalación ha finalizado. Y preguntando si se debe abrir una shell para realizar cambios manuales.

source: bsdinstall will prompt for any additional configuration that needs to be done before rebooting into the new system. Select btn:[Yes] to exit to a shell within the new system or btn:[No] to proceed to the last step of the installation.
es: bsdinstall solicitará cualquier configuración adicional que deba realizarse antes de reiniciar en el nuevo sistema. Seleccione btn:[Yes] para salir a una shell dentro del nuevo sistema o btn:[No] para proceder al último paso de la instalación.
ru: bsdinstall предложит выполнить любую дополнительную настройку, необходимую перед перезагрузкой в новую систему. Выберите btn:[Да], чтобы выйти в оболочку новой системы, или btn:[Нет], чтобы перейти к последнему шагу установки.

source: Complete the Installation
es: Completar la instalación
ru: Завершение установки

source: Menu showing that the installation has finished and asking whether to reboot the system or access the Live CD.
es: Menú que muestra que la instalación ha finalizado y pregunta si se desea reiniciar el sistema o acceder al Live CD.
ru: Меню, показывающее завершение установки и предлагающее перезагрузить систему или получить доступ к Live CD.

source: If further configuration or special setup is needed, select btn:[Live CD] to boot the install media into Live CD mode.
es: Si se necesita más configuración o un ajuste especial, seleccione btn:[Live CD] para arrancar el medio de instalación en modo Live CD.
ru: Если требуется дополнительная настройка или специальная установка, выберите btn:[Live CD], чтобы загрузить установочный носитель в режиме Live CD.

source: If the installation is complete, select btn:[Reboot] to reboot the computer and start the new FreeBSD system. Do not forget to remove the FreeBSD install media or the computer might boot from it again.
es: Si la instalación ha finalizado, seleccione btn:[Reboot] para reiniciar el ordenador e iniciar el nuevo sistema FreeBSD. No olvide retirar el medio de instalación de FreeBSD o el ordenador podría arrancar desde él de nuevo.
ru: Если установка завершена, выберите btn:[Перезагрузка], чтобы перезагрузить компьютер и запустить новую систему FreeBSD. Не забудьте извлечь установочный носитель FreeBSD, иначе компьютер может снова загрузиться с него.

source: As FreeBSD boots, informational messages are displayed. After the system finishes booting, a login prompt is displayed. At the `login:` prompt, enter the username added during the installation. Avoid logging in as `root`. Refer to crossref:basics[users-superuser,The Superuser Account] for instructions on how to become the superuser when administrative access is needed.
es: A medida que FreeBSD arranca, se muestran mensajes informativos. Una vez que el sistema termina de arrancar, se muestra un aviso de inicio de sesión. En el indicador `login:`, introduzca el nombre de usuario añadido durante la instalación. Evite iniciar sesión como `root`. Consulte crossref:basics[users-superuser,The Superuser Account] para obtener instrucciones sobre cómo convertirse en superusuario cuando se necesite acceso administrativo.
ru: При загрузке FreeBSD отображаются информационные сообщения. После завершения загрузки системы появляется приглашение для входа. В ответ на приглашение `login:` введите имя пользователя, добавленное во время установки. Избегайте входа в систему как `root`. Инструкции по получению прав суперпользователя, когда требуется административный доступ, приведены в crossref:basics[users-superuser,Учётная запись суперпользователя].

source: The messages that appear during boot can be reviewed by pressing kbd:[Scroll-Lock] to turn on the scroll-back buffer. The kbd:[PgUp], kbd:[PgDn], and arrow keys can be used to scroll back through the messages. When finished, press kbd:[Scroll-Lock] again to unlock the display and return to the console. To review these messages once the system has been up for some time, type `less /var/run/dmesg.boot` from a command prompt. Press kbd:[q] to return to the command line after viewing.
es: Los mensajes que aparecen durante el arranque pueden revisarse presionando kbd:[Scroll-Lock] para activar el búfer de desplazamiento. Las teclas kbd:[PgUp], kbd:[PgDn] y las flechas se pueden usar para desplazarse hacia atrás a través de los mensajes. Cuando haya terminado, presione kbd:[Scroll-Lock] de nuevo para desbloquear la pantalla y volver a la consola. Para revisar estos mensajes una vez que el sistema haya estado funcionando por algún tiempo, escriba `less /var/run/dmesg.boot` desde un símbolo del sistema. Presione kbd:[q] para volver a la línea de comandos después de la visualización.
ru: Сообщения, появляющиеся во время загрузки, можно просмотреть, нажав kbd:[Scroll-Lock], чтобы включить буфер прокрутки. Для перемещения по сообщениям можно использовать клавиши kbd:[PgUp], kbd:[PgDn] и стрелки. По завершении нажмите kbd:[Scroll-Lock] снова, чтобы разблокировать экран и вернуться к консоли. Для просмотра этих сообщений после работы системы в течение некоторого времени введите `less /var/run/dmesg.boot` в командной строке. Нажмите kbd:[q], чтобы вернуться в командную строку после просмотра.
