Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: The next section is used to toggle the available options to `On` or `Off` by pressing the option's highlighted number or character. The system will always boot using the settings for these options until they are modified. Several options can be toggled using this menu:
es: La siguiente sección se utiliza para alternar las opciones disponibles entre `On` u `Off` presionando el número o carácter resaltado de la opción. El sistema siempre arrancará utilizando los ajustes de estas opciones hasta que sean modificados. Varias opciones pueden alternarse utilizando este menú:
ru: Следующий раздел позволяет переключать доступные опции в состояние `Вкл` или `Выкл`, нажимая выделенную цифру или символ соответствующей опции. Система всегда будет загружаться с использованием текущих настроек этих опций, пока они не будут изменены. С помощью этого меню можно переключать несколько опций:

source: `ACPI Support`: If the system hangs during boot, try toggling this option to `Off`. This option is only present when ACPI support is available but not required.
es: `ACPI Support`: Si el sistema se bloquea durante el arranque, intente cambiar esta opción a `Off`. Esta opción solo se encuentra disponible cuando el soporte ACPI está implementado pero no es obligatorio.
ru: `Поддержка ACPI (ACPI Support)`: Если система зависает во время загрузки, попробуйте переключить этот параметр в положение `Выкл.`. Этот параметр присутствует только в том случае, если поддержка ACPI доступна, но не обязательна.

source: `Safe Mode`: If the system still hangs during boot even with `ACPI Support` set to `Off`, try setting this option to `On`.
es: `Safe Mode`: Si el sistema sigue bloqueándose durante el arranque incluso con `ACPI Support` en `Off`, intente establecer esta opción en `On`.
ru: `Безопасный режим (Safe Mode)`: Если система всё ещё зависает во время загрузки, даже когда `Поддержка ACPI` установлена в `Выкл`, попробуйте установить этот параметр в `Вкл`.

source: `Single User`: Toggle this option to `On` to fix an existing FreeBSD installation as described in crossref:boot[boot-singleuser,“Single-User Mode”]. Once the problem is fixed, set it back to `Off`.
es: `Single User`: Cambie esta opción a `On` para reparar una instalación existente de FreeBSD, tal como se describe en crossref:boot[boot-singleuser,“Single-User Mode”]. Una vez que el problema se haya solucionado, vuelva a establecerla en `Off`.
ru: `Однопользовательский (Single User)`: Установите этот параметр в `Вкл`, чтобы исправить существующую установку FreeBSD, как описано в crossref:boot[boot-singleuser,“Однопользовательский режим”]. После устранения проблемы верните значение `Выкл`.

source: `Verbose`: Toggle this option to `On` to see more detailed messages during the boot process. This can be useful when troubleshooting a piece of hardware.
es: `Verbose`: Cambie esta opción a `On` para visualizar mensajes más detallados durante el proceso de arranque. Esto puede resultar útil al diagnosticar problemas en algún componente de hardware.
ru: `Подробно (Verbose)`: Установите этот параметр в `Вкл`, чтобы видеть более подробные сообщения в процессе загрузки. Это может быть полезно при диагностике проблем с оборудованием.

source: After making the needed selections, press kbd:[1] or kbd:[Backspace] to return to the main boot menu, then press kbd:[Enter] to continue booting into FreeBSD. A series of boot messages will appear as FreeBSD carries out its hardware device probes and loads the installation program. Once the boot is complete, the welcome menu shown in crossref:bsdinstall[bsdinstall-choose-mode,Welcome Menu] will be displayed.
es: Tras realizar las selecciones necesarias, presione kbd:[1] o kbd:[Backspace] para regresar al menú de arranque principal y, a continuación, presione kbd:[Enter] para continuar con el arranque de FreeBSD. Aparecerá una serie de mensajes de arranque a medida que FreeBSD realiza el sondeo de dispositivos de hardware y carga el programa de instalación. Una vez completado el arranque, se mostrará el menú de bienvenida que aparece en crossref:bsdinstall[bsdinstall-choose-mode,Welcome Menu].
ru: После выбора необходимых параметров нажмите kbd:[1] или kbd:[Backspace], чтобы вернуться в главное меню загрузки, затем нажмите kbd:[Enter] для продолжения загрузки FreeBSD. Появится серия сообщений загрузки, пока FreeBSD выполняет обнаружение аппаратных устройств и загружает программу установки. После завершения загрузки будет отображено приветственное меню, показанное на рисунке crossref:bsdinstall[bsdinstall-choose-mode,Приветственное меню].

source: Welcome Menu
es: Menú de bienvenida
ru: Приветственное меню

source: FreeBSD installation welcome menu
es: Menú de bienvenida de la instalación de FreeBSD
ru: Приветственное меню установки FreeBSD

source: Press kbd:[Enter] to select the default of btn:[Install] to enter the installer. The rest of this chapter describes how to use this installer. Otherwise, use the right or left arrows or the colorized letter to select the desired menu item. The btn:[Shell] can be used to access a FreeBSD shell in order to use command line utilities to prepare the disks before installation. The btn:[Live CD] option can be used to try out FreeBSD before installing it. The live version is described in crossref:bsdinstall[using-live-cd, Using the Live CD].
es: Presione kbd:[Enter] para seleccionar la opción predeterminada btn:[Install] e ingresar al instalador. El resto de este capítulo describe cómo utilizar dicho instalador. De lo contrario, utilice las flechas derecha o izquierda, o la letra resaltada en color, para seleccionar el elemento de menú deseado. La opción btn:[Shell] se puede utilizar para acceder a una consola de FreeBSD con el fin de emplear utilidades de línea de comandos para preparar los discos antes de la instalación. La opción btn:[Live CD] permite probar FreeBSD antes de instalarlo. La versión en vivo se describe en crossref:bsdinstall[using-live-cd, Using the Live CD].
ru: Нажмите kbd:[Enter], чтобы выбрать вариант по умолчанию btn:[Install] и перейти к установке. В остальной части этой главы описывается, как использовать этот установщик. В противном случае используйте стрелки вправо или влево или выделенную цветом букву, чтобы выбрать нужный пункт меню. Кнопка btn:[Shell] позволяет получить доступ к оболочке FreeBSD для использования командной строки и подготовки дисков перед установкой. Вариант btn:[Live CD] позволяет попробовать FreeBSD перед установкой. Версия Live CD описана в пункте crossref:bsdinstall[using-live-cd, Использование Live CD].

source: To review the boot messages, including the hardware device probe, press the upper- or lower-case kbd:[S] and then kbd:[Enter] to access a shell. At the shell prompt, type `more /var/run/dmesg.boot` and use the space bar to scroll through the messages. When finished, type `exit` to return to the welcome menu.
es: Para revisar los mensajes de arranque, incluido el sondeo de dispositivos de hardware, presione kbd:[S] en mayúscula o minúscula y luego kbd:[Enter] para acceder a una shell. En el prompt de la shell, escriba `more /var/run/dmesg.boot` y use la barra espaciadora para desplazarse por los mensajes. Cuando haya terminado, escriba `exit` para volver al menú de bienvenida.
ru: Для просмотра загрузочных сообщений, включая информацию об обнаруженных аппаратных устройствах, нажмите kbd:[S] (верхний или нижний регистр) и затем kbd:[Enter], чтобы перейти в оболочку. В командной строке оболочки введите `more /var/run/dmesg.boot` и используйте пробел для прокрутки сообщений. По завершении введите `exit`, чтобы вернуться в меню приветствия.

source: Using bsdinstall
es: Uso de bsdinstall
ru: Использование bsdinstall

source: This section shows the order of the bsdinstall menus and the type of information that will be asked before the system is installed. Use the arrow keys to highlight a menu option, then kbd:[Space] to select or deselect that menu item. When finished, press kbd:[Enter] to save the selection and move onto the next screen.
es: Esta sección muestra el orden de los menús de bsdinstall y el tipo de información que se solicitará antes de instalar el sistema. Utilice las teclas de flecha para resaltar una opción de menú, luego kbd:[Space] para seleccionar o anular la selección de ese elemento de menú. Cuando haya terminado, presione kbd:[Enter] para guardar la selección y pasar a la siguiente pantalla.
ru: В этом разделе показана последовательность меню bsdinstall и тип информации, которая будет запрошена перед установкой системы. Используйте клавиши со стрелками, чтобы выделить пункт меню, затем kbd:[Space] для выбора или отмены выбора этого пункта. По завершении нажмите kbd:[Enter], чтобы сохранить выбор и перейти к следующему экрану.

source: Selecting the Keymap Menu
es: Menú de selección del mapa de teclado
ru: Меню выбора раскладки клавиатуры

source: Before starting the process, bsdinstall will load the keymap files as shown in crossref:bsdinstall[bsdinstall-keymap-loading,Keymap Loading].
es: Antes de comenzar el proceso, bsdinstall cargará los archivos de mapa de teclado, tal como se muestra en crossref:bsdinstall[bsdinstall-keymap-loading,Keymap Loading].
ru: Перед началом процесса bsdinstall загрузит файлы раскладки клавиатуры, как показано на рисунке crossref:bsdinstall[bsdinstall-keymap-loading,Загрузка раскладки клавиатуры].

source: Keymap Loading
es: Carga del mapa de teclado
ru: Загрузка раскладки клавиатуры

source: Keymap loading
es: Carga del mapa de teclado
ru: Загрузка раскладки клавиатуры

source: After the keymaps have been loaded, bsdinstall displays the menu shown in crossref:bsdinstall[bsdinstall-keymap-10,Keymap Selection Menu]. Use the up and down arrows to select the keymap that most closely represents the mapping of the keyboard attached to the system. Press kbd:[Enter] to save the selection.
es: Después de cargar los mapas de teclado, bsdinstall muestra el menú que aparece en crossref:bsdinstall[bsdinstall-keymap-10,Keymap Selection Menu]. Utilice las flechas arriba y abajo para seleccionar el mapa de teclado que más se aproxime a la distribución del teclado conectado al sistema. Presione kbd:[Enter] para guardar la selección.
ru: После загрузки раскладок клавиатур bsdinstall отображает меню, показанное на рисунке crossref:bsdinstall[bsdinstall-keymap-10,Меню выбора раскладки клавиатуры]. Используйте стрелки вверх и вниз, чтобы выбрать раскладку, наиболее точно соответствующую клавиатуре, подключенной к системе. Нажмите kbd:[Enter], чтобы сохранить выбор.

source: Keymap Selection Menu
es: Menú de selección del mapa de teclado
ru: Меню выбора раскладки клавиатуры

source: Keymap selection menu showing all supported keyboards
es: Menú de selección del mapa de teclado que muestra todas las distribuciones de teclado disponibles
ru: Меню выбора раскладки клавиатуры со списком всех поддерживаемых клавиатур

source: Pressing kbd:[Esc] will exit this menu and use the default keymap. If the choice of keymap is not clear, [.guimenuitem]#United States of America ISO-8859-1# is also a safe option.
es: Al presionar kbd:[Esc] se saldrá de este menú y se utilizará el mapa de teclado predeterminado. Si la elección del mapa de teclado no es clara, [.guimenuitem]#United States of America ISO-8859-1# también es una opción segura.
ru: Нажатие kbd:[Esc] выйдет из этого меню и использует раскладку по умолчанию. Если выбор раскладки неочевиден, [.guimenuitem]#United States of America ISO-8859-1# также является безопасным вариантом.

source: In addition, when selecting a different keymap, the user can try the keymap and ensure it is correct before proceeding, as shown in crossref:bsdinstall[bsdinstall-keymap-testing,Keymap Testing Menu].
es: Además, al seleccionar un mapa de teclado diferente, el usuario puede probarlo y asegurarse de que sea el correcto antes de proceder, tal como se muestra en crossref:bsdinstall[bsdinstall-keymap-testing,Keymap Testing Menu].
ru: Кроме того, при выборе другой раскладки клавиатуры пользователь может проверить её и убедиться в правильности перед продолжением, как показано на рисунке crossref:bsdinstall[bsdinstall-keymap-testing,Меню проверки раскладки клавиатуры].

source: Keymap Testing Menu
es: Menú de prueba del mapa de teclado
ru: Меню тестирования раскладки клавиатуры

source: Keymap testing menu
es: Menú de prueba del mapa de teclado
ru: Меню тестирования раскладки клавиатуры

source: Setting the Hostname
es: Configuración del nombre de host
ru: Установка имени хоста

source: The next bsdinstall menu is used to set the hostname for the newly installed system.
es: El siguiente menú de bsdinstall se utiliza para establecer el nombre de host del sistema recién instalado.
ru: Следующее меню bsdinstall используется для установки имени хоста вновь устанавливаемой системы.

source: Setting the hostname
es: Configuración del nombre de host
ru: Установка имени хоста

source: Type in a hostname that is unique for the network. It should be a fully-qualified hostname, such as `machine3.example.com`.
es: Escriba un nombre de host que sea único en la red. Debe ser un nombre de host plenamente calificado, como `machine3.example.com`.
ru: Введите имя хоста, уникальное для сети. Оно должно быть полным доменным именем, например `machine3.example.com`.

source: Selecting Components to Install
es: Selección de los componentes a instalar
ru: Выбор компонентов для установки

source: Next, bsdinstall will prompt to select optional components to install.
es: A continuación, bsdinstall solicitará la selección de los componentes opcionales que se van a instalar.
ru: Затем `bsdinstall` предложит выбрать дополнительные компоненты для установки.

source: Different components that can be installed. Example: base-dbg
es: Diferentes componentes que pueden instalarse. Ejemplo: base-dbg
ru: Различные компоненты, которые могут быть установлены. Пример: `base-dbg`

source: Deciding which components to install will depend largely on the intended use of the system and the amount of disk space available. The FreeBSD kernel and userland, collectively known as the _base system_, are always installed. Depending on the architecture, some of these components may not appear:
es: La decisión de qué componentes instalar dependerá en gran medida del uso previsto del sistema y del espacio en disco disponible. El kernel de FreeBSD y el userland, conocidos colectivamente como el _base system_, se instalan siempre. Dependiendo de la arquitectura, es posible que algunos de estos componentes no aparezcan:
ru: Выбор компонентов для установки в значительной степени зависит от предполагаемого использования системы и доступного дискового пространства. Базовая система FreeBSD, включающая ядро и пользовательское окружение (_base system_), устанавливается всегда. В зависимости от архитектуры некоторые из этих компонентов могут отсутствовать:

source: `base-dbg` - Base tools like cat and ls, among many others, with debug symbols activated.
es: `base-dbg`: herramientas de la base como cat y ls, entre muchas otras, con símbolos de depuración activados.
ru: `base-dbg` - Базовые инструменты, такие как cat и ls, среди многих других, с активированными отладочными символами.

source: `kernel-dbg` - Kernel and modules with debug symbols activated.
es: `kernel-dbg` - Kernel y módulos con los símbolos de depuración activados.
ru: `kernel-dbg` - Ядро и модули с включенными отладочными символами.

source: `lib32-dbg` - Compatibility libraries for running 32-bit applications on a 64-bit version of FreeBSD with debug symbols activated.
es: `lib32-dbg` - Librerías de compatibilidad para ejecutar aplicaciones de 32 bits en una versión de 64 bits de FreeBSD con los símbolos de depuración activados.
ru: `lib32-dbg` - Совместимые библиотеки для запуска 32-битных приложений на 64-битной версии FreeBSD с активированными отладочными символами.

source: `lib32` - Compatibility libraries for running 32-bit applications on a 64-bit version of FreeBSD.
es: `lib32` - Librerías de compatibilidad para ejecutar aplicaciones de 32 bits en una versión de 64 bits de FreeBSD.
ru: `lib32` - Совместимые библиотеки для запуска 32-битных приложений на 64-битной версии FreeBSD.

source: `ports` - The FreeBSD Ports Collection is a collection of files which automates the downloading, compiling and installation of third-party software packages. crossref:ports[ports,Installing Applications: Packages and Ports] discusses how to use the Ports Collection.
es: `ports` - La Colección de Ports de FreeBSD es una colección de archivos que automatiza la descarga, compilación e instalación de paquetes de software de terceros. crossref:ports[ports,Instalación de aplicaciones: paquetes y ports] explica cómo utilizar la Colección de Ports.
ru: `ports` - Коллекция портов FreeBSD представляет собой набор файлов, автоматизирующих загрузку, компиляцию и установку сторонних программных пакетов. В разделе crossref:ports[ports,Установка приложений: Пакеты и Порты] рассматривается, как использовать Коллекцию портов.

source: The installation program does not check for adequate disk space. Select this option only if sufficient hard disk space is available. The FreeBSD Ports Collection takes up about {ports-size} of disk space.
es: El programa de instalación no comprueba si el espacio en disco es adecuado. Seleccione esta opción solo si dispone de suficiente espacio en el disco duro. La Colección de Ports de FreeBSD ocupa aproximadamente {ports-size} de espacio en disco.
ru: Программа установки не проверяет наличие достаточного места на диске. Выбирайте этот вариант, только если доступно достаточно места на жестком диске. Коллекция портов FreeBSD занимает около {ports-size} места на диске.

source: `src` - The complete FreeBSD source code for both the kernel and the userland. Although not required for the majority of applications, it may be required to build device drivers, kernel modules, or some applications from the Ports Collection. It is also used for developing FreeBSD itself. The full source tree requires 1 GB of disk space and recompiling the entire FreeBSD system requires an additional 5 GB of space.
es: `src` - El código fuente completo de FreeBSD tanto para el kernel como para el userland. Aunque no es necesario para la mayoría de las aplicaciones, puede ser requerido para construir controladores de dispositivos, módulos del kernel o algunas aplicaciones de la Colección de Ports. También se utiliza para desarrollar el propio FreeBSD. El árbol de fuentes completo requiere 1 GB de espacio en disco y la recompilación de todo el sistema FreeBSD requiere 5 GB adicionales de espacio.
ru: `src` - Полный исходный код FreeBSD, включая как ядро, так и пользовательское пространство. Хотя он не требуется для большинства приложений, он может быть необходим для сборки драйверов устройств, модулей ядра или некоторых приложений из коллекции портов. Также он используется для разработки самой FreeBSD. Полное дерево исходных кодов занимает 1 ГБ дискового пространства, а перекомпиляция всей системы FreeBSD требует дополнительно 5 ГБ пространства.

source: `tests` - FreeBSD Test Suite.
es: `tests` - Suite de pruebas de FreeBSD.
ru: `tests` — Набор тестов FreeBSD.

source: Installing from the Network
es: Instalación desde la red
ru: Установка по сети

source: The menu shown in crossref:bsdinstall[bsdinstall-netinstall-notify,Installing from the Network] only appears when installing from a `-bootonly.iso` or `-mini-memstick.img`, as this installation media does not hold copies of the installation files. Since the installation files must be retrieved over a network connection, this menu indicates that the network interface must be configured first. If this menu is shown in any step of the process, remember to follow the instructions in crossref:bsdinstall[bsdinstall-config-network-dev, Configuring Network Interfaces].
es: El menú que se muestra en crossref:bsdinstall[bsdinstall-netinstall-notify,Instalación desde la red] solo aparece cuando se instala desde una imagen `-bootonly.iso` o `-mini-memstick.img`, ya que este medio de instalación no contiene copias de los archivos de instalación. Dado que los archivos de instalación deben obtenerse a través de una conexión de red, este menú indica que la interfaz de red debe configurarse primero. Si se muestra este menú en cualquier paso del proceso, recuerde seguir las instrucciones en crossref:bsdinstall[bsdinstall-config-network-dev, Configuración de las interfaces de red].
ru: Меню, показанное на рисунке crossref:bsdinstall[bsdinstall-netinstall-notify,Установка из сети], появляется только при установке с `-bootonly.iso` или `-mini-memstick.img`, так как эти носители не содержат копий файлов установки. Поскольку файлы установки должны быть получены через сетевое соединение, это меню указывает на необходимость предварительной настройки сетевого интерфейса. Если это меню появляется на любом этапе процесса, не забудьте следовать инструкциям из раздела crossref:bsdinstall[bsdinstall-config-network-dev,Настройка сетевых интерфейсов].

source: Indicates that certain components have not been found and will be downloaded using the network.
es: Indica que no se han encontrado ciertos componentes y que se descargarán utilizando la red.
ru: Указывает, что определенные компоненты не были найдены и будут загружены через сеть.

source: Allocating Disk Space
es: Asignar espacio en disco
ru: Выделение дискового пространства

source: The next menu is used to determine the method for allocating disk space.
es: El siguiente menú se utiliza para determinar el método de asignación del espacio en disco.
ru: Следующее меню используется для определения метода распределения дискового пространства.

source: Partitioning Choices
es: Opciones de particionamiento
ru: Варианты разметки разделов

source: Shows the different partition options. Example: Manual
es: Muestra las diferentes opciones de partición. Ejemplo: Manual
ru: Показывает различные варианты разделов. Пример: Ручной

source: bsdinstall gives the user four methods for allocating disk space:
es: bsdinstall ofrece al usuario cuatro métodos para asignar espacio en disco:
ru: bsdinstall предоставляет пользователю четыре метода распределения дискового пространства:

source: `Auto (ZFS)` partitioning creates a root-on-ZFS system with optional GELI encryption support for _boot environments_.
es: El particionado `Auto (ZFS)` crea un sistema root-on-ZFS con soporte opcional de cifrado GELI para los _entornos de arranque (boot environments)_.
ru: `Auto (ZFS)` — автоматическое разбиение на разделы создаёт систему с корневым разделом на ZFS и возможностью использования шифрования GELI для _загрузочных окружений_.

source: `Auto (UFS)` partitioning automatically sets up the disk partitions using the `UFS` file system.
es: El particionado `Auto (UFS)` configura automáticamente las particiones del disco utilizando el sistema de archivos `UFS`.
ru: `Auto (UFS)` — автоматическое разбиение диска с использованием файловой системы `UFS`.

source: `Manual` partitioning allows advanced users to create customized partitions from menu options.
es: El particionado `Manual` permite a los usuarios avanzados crear particiones personalizadas desde las opciones del menú.
ru: `Ручное (Manual)` разбиение позволяет опытным пользователям создавать настраиваемые разделы с помощью параметров меню.
