Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: `*-bootonly.iso*`: This is the smallest installation file as it only contains the installer. A working Internet connection is required during installation as the installer will download the files it needs to complete the FreeBSD installation. This file should be burned to optical media.
es: `*-bootonly.iso*`: Este es el archivo de instalación más pequeño, ya que solo contiene el instalador. Se requiere una conexión a Internet activa durante la instalación, puesto que el instalador descargará los archivos necesarios para completar la instalación de FreeBSD. Este archivo debe grabarse en un soporte óptico.
ru: `*-bootonly.iso*` — это самый маленький установочный файл, так как он содержит только установщик. Для установки требуется работающее интернет-соединение, так как установщик загрузит файлы, необходимые для завершения установки FreeBSD. Этот файл следует записать на оптический носитель.

source: `*-disc1.iso*`: This file contains all of the files needed to install FreeBSD, its source, and the Ports Collection. This file should be burned to optical media.
es: `*-disc1.iso*`: Este archivo contiene todos los archivos necesarios para instalar FreeBSD, su código fuente y la Colección de Ports. Este archivo debe grabarse en un soporte óptico.
ru: `*-disc1.iso*` — этот файл содержит все необходимые файлы для установки FreeBSD, её исходных кодов и Коллекции портов. Данный файл следует записать на оптический носитель.

source: `*-dvd1.iso*`: This file contains all of the files needed to install FreeBSD, its source, and the Ports Collection. It also contains a set of popular binary packages for installing a window manager and some applications so that a complete system can be installed from media without requiring a connection to the Internet. This file should be burned to optical media.
es: `*-dvd1.iso*`: Este archivo contiene todos los archivos necesarios para instalar FreeBSD, su código fuente y la Colección de Ports. También incluye un conjunto de paquetes binarios populares para la instalación de un gestor de ventanas y diversas aplicaciones, de modo que se pueda instalar un sistema completo desde el soporte sin requerir una conexión a Internet. Este archivo debe grabarse en un soporte óptico.
ru: `*-dvd1.iso*` — этот файл содержит все необходимые файлы для установки FreeBSD, его исходные коды и Коллекцию портов. Также в него включён набор популярных бинарных пакетов для установки оконного менеджера и некоторых приложений, что позволяет установить полноценную систему с носителя без подключения к Интернету. Этот файл следует записать на оптический диск.

source: `*-memstick.img*`: This file contains all of the files needed to install FreeBSD, its source, and the Ports Collection. Write this file to a USB stick as shown in crossref:bsdinstall[bsdinstall-usb, Writing an Image File to USB].
es: `*-memstick.img*`: Este archivo contiene todos los archivos necesarios para instalar FreeBSD, su código fuente y la Colección de Ports. Escriba este archivo en una memoria USB tal como se muestra en crossref:bsdinstall[bsdinstall-usb, Writing an Image File to USB].
ru: `*-memstick.img*` — этот файл содержит все необходимые файлы для установки FreeBSD, её исходных кодов и Коллекции портов. Запишите этот файл на USB-накопитель, как показано в crossref:bsdinstall[bsdinstall-usb, Запись образа на USB].

source: `*-mini-memstick.img*`: Like `*-bootonly.iso*`, does not include installation files, but downloads them as needed. A working internet connection is required during installation. It should be written to a USB stick as shown in crossref:bsdinstall[bsdinstall-usb, Writing an Image File to USB].
es: `*-mini-memstick.img*`: Al igual que `*-bootonly.iso*`, no incluye los archivos de instalación, sino que los descarga según sea necesario. Se requiere una conexión a Internet activa durante la instalación. Debe escribirse en una memoria USB tal como se muestra en crossref:bsdinstall[bsdinstall-usb, Writing an Image File to USB].
ru: `*-mini-memstick.img*` — как и `*-bootonly.iso*`, не содержит файлов для установки, но загружает их по мере необходимости. Требуется работающее интернет-подключение во время установки. Этот образ должен быть записан на USB-накопитель, как показано в crossref:bsdinstall[bsdinstall-usb, Запись образа на USB].

source: After downloading the image file, download at least one _checksum_ file from the same directory. There are two _checksum_ files available, named after the release number and the architecture name. For example: `CHECKSUM.SHA256-FreeBSD-{rel-latest}-RELEASE-amd64` and `CHECKSUM.SHA512-FreeBSD-{rel-latest}-RELEASE-amd64`.
es: Tras descargar el archivo de imagen, descargue al menos un archivo de suma de comprobación (_checksum_) del mismo directorio. Existen dos archivos de _checksum_ disponibles, denominados según el número de versión y el nombre de la arquitectura. Por ejemplo: `CHECKSUM.SHA256-FreeBSD-{rel-latest}-RELEASE-amd64` y `CHECKSUM.SHA512-FreeBSD-{rel-latest}-RELEASE-amd64`.

source: After downloading one of the files (or both), calculate the _checksum_ for the image file and compare it with the one shown in the _checksum_ file. Note that comparing the calculated _checksum_ against the correct file is needed, as they correspond to two different algorithms: SHA256 and SHA512. FreeBSD provides man:sha256[1] and man:sha512[1] that can be used for calculating the _checksum_. Other operating systems have similar programs.
es: Tras descargar uno de los archivos (o ambos), verifique la suma de comprobación (_checksum_) del archivo de imagen y compárela con la que se muestra en el archivo de _checksum_. Tenga en cuenta que es necesario contrastar el _checksum_ obtenido con el archivo correcto, ya que corresponden a dos algoritmos distintos: SHA256 y SHA512. FreeBSD proporciona man:sha256 y man:sha512, que pueden utilizarse para verificar el _checksum_. Otros sistemas operativos disponen de programas similares.

source: Verifying the _checksum_ in FreeBSD can be done automatically using man:sha256sum[1] (and man:sha512sum[1]) by executing:
es: La verificación de la suma de comprobación (_checksum_) en FreeBSD puede realizarse de forma automática mediante man:sha256sum[1] (y man:sha512sum[1]) ejecutando:
ru: Проверка _контрольной суммы_ в FreeBSD может быть выполнена автоматически с помощью man:sha256sum[1] (и man:sha512sum[1]) путем выполнения:

source: The checksums must match exactly. If the checksums do not match, the image file is corrupt and must be downloaded again.
es: Las sumas de comprobación deben coincidir exactamente. Si las sumas de comprobación no coinciden, el archivo de imagen está corrupto y debe descargarse de nuevo.
ru: Хеш-суммы должны полностью совпадать. Если хеш-суммы не совпадают, образ файла повреждён и его необходимо загрузить заново.

source: Writing an Image File to USB
es: Escritura de un archivo de imagen en un dispositivo USB
ru: Запись образа на USB-накопитель

source: The `\*memstick.img` file is an _image_ of the complete contents of a memory stick. It _cannot_ be copied to the target device as a file. Several applications are available for writing the `*.img` to a USB stick. This section describes two of these utilities.
es: El archivo `\*memstick.img` es una _imagen_ del contenido completo de una memoria USB. _No puede_ copiarse al dispositivo de destino como un archivo convencional. Existen diversas aplicaciones disponibles para escribir el `*.img` en una memoria USB. Esta sección describe dos de estas utilidades.
ru: Файл `\*memstick.img` представляет собой _образ_ полного содержимого USB-накопителя. Его _нельзя_ просто скопировать на целевое устройство как файл. Существует несколько программ для записи `*.img` на USB-накопитель. В этом разделе описаны две такие утилиты.

source: Before proceeding, back up any important data on the USB stick. This procedure will erase the existing data on the stick.
es: Antes de proceder, realice una copia de seguridad de cualquier dato importante en la memoria USB. Este procedimiento borrará los datos existentes en el dispositivo.
ru: Прежде чем продолжить, создайте резервную копию всех важных данных на USB-накопителе. Эта процедура удалит все существующие данные на носителе.

source: *Procedure. Using `dd` to write the image* +
es: *Procedimiento. Uso de `dd` para escribir la imagen* +
ru: *Процедура. Использование `dd` для записи образа* +

source: This example uses `/dev/da0` as the target device where the image will be written. Be *very careful* that the correct device is used as this command will destroy the existing data on the specified target device.
es: Este ejemplo utiliza `/dev/da0` como el dispositivo de destino donde se escribirá la imagen. Sea *muy cuidadoso* al asegurarse de utilizar el dispositivo correcto, ya que este comando destruirá los datos existentes en el dispositivo de destino especificado.
ru: Этот пример использует `/dev/da0` в качестве целевого устройства, на которое будет записан образ. Будьте *очень внимательны* при выборе правильного устройства, так как эта команда уничтожит все существующие данные на указанном целевом устройстве.

source: The command-line utility is available on BSD, Linux(R), and Mac OS(R) systems. To burn the image using `dd`, insert the USB stick and determine its device name. Then, specify the name of the downloaded installation file and the device name for the USB stick. This example burns the amd64 installation image to the first USB device on an existing FreeBSD system.
es: Esta utilidad de línea de comandos está disponible en sistemas BSD, Linux(R) y Mac OS(R). Para grabar la imagen mediante `dd`, inserte la memoria USB y determine su nombre de dispositivo. A continuación, especifique el nombre del archivo de instalación descargado y el nombre de dispositivo de la memoria USB. Este ejemplo graba la imagen de instalación para amd64 en el primer dispositivo USB de un sistema FreeBSD existente.
ru: Утилита командной строки доступна в системах BSD, Linux(R) и Mac OS(R). Чтобы записать образ с помощью `dd`, вставьте USB-накопитель и определите его имя устройства. Затем укажите имя загруженного файла установки и имя устройства USB-накопителя. В этом примере записывается образ установки amd64 на первое USB-устройство в существующей системе FreeBSD.

source: If this command fails, verify that the USB stick is not mounted and that the device name is for the disk, not a partition.
es: Si este comando falla, verifique que la memoria USB no esté montada y que el nombre del dispositivo corresponda al disco y no a una partición.
ru: Если команда завершается с ошибкой, убедитесь, что USB-накопитель не смонтирован и что указано имя диска, а не раздела.

source: Some operating systems might require this command to be run with man:sudo[8]. The man:dd[1] syntax varies slightly across different platforms; for example, Mac OS(R) requires a lower-case `bs=1m`. Systems like Linux(R) might buffer writes. To force all writes to complete, use man:sync[8].
es: Algunos sistemas operativos pueden requerir que este comando se ejecute con man:sudo. La sintaxis de man:dd varía ligeramente entre las diferentes plataformas; por ejemplo, Mac OS(R) requiere el uso de minúsculas en `bs=1m`. Los sistemas como Linux(R) pueden almacenar las escrituras en un búfer. Para forzar que se completen todas las operaciones de escritura, utilice man:sync[8].
ru: Некоторые операционные системы могут потребовать выполнения этой команды с man:sudo[8]. Синтаксис man:dd[1] немного различается на разных платформах; например, Mac OS(R) требует указания `bs=1m` в нижнем регистре. Системы, такие как Linux(R), могут буферизировать запись. Чтобы принудительно завершить все операции записи, используйте man:sync[8].

source: *Procedure. Using Windows(R) to Write the Image* +
es: *Procedimiento. Uso de Windows(R) para escribir la imagen* +
ru: *Процедура. Запись образа с использованием Windows(R)* +

source: Be sure to give the correct drive letter as the existing data on the specified drive will be overwritten and destroyed.
es: Asegúrese de proporcionar la letra de unidad correcta, ya que los datos existentes en la unidad especificada se sobrescribirán y se destruirán.
ru: Убедитесь, что указали правильную букву диска, так как все существующие данные на указанном диске будут перезаписаны и уничтожены.

source: *Obtaining Image Writer for Windows(R)*
es: *Obtención de Image Writer para Windows*
ru: *Получение Image Writer для Windows(R)*

source: Image Writer for Windows(R) is a free application that can correctly write an image file to a memory stick. Download it from https://sourceforge.net/projects/win32diskimager/[win32diskimager home page] and extract it into a folder.
es: Image Writer for Windows(R) es una aplicación gratuita que permite escribir correctamente un archivo de imagen en una unidad de memoria. Descárguela desde https://sourceforge.net/projects/win32diskimager/[win32diskimager home page] y extráigala en una carpeta.
ru: `Image Writer for Windows(R)` — это бесплатное приложение, которое позволяет корректно записать файл образа на USB-накопитель. Загрузите его с https://sourceforge.net/projects/win32diskimager/[официальной страницы win32diskimager] и распакуйте в нужную папку.

source: *Writing the Image with Image Writer*
es: *Escribir la imagen con Image Writer*
ru: *Запись образа с помощью Image Writer*

source: Double-click the Win32DiskImager icon to start the program. Verify that the drive letter shown under `Device` is the drive with the memory stick. Click the folder icon and select the image to be written to the memory stick. Click btn:[Save] to accept the image file name. Verify that everything is correct, and that no folders on the memory stick are open in other windows. When everything is ready, click btn:[Write] to write the image file to the memory stick.
es: Haga doble clic en el icono de Win32DiskImager para iniciar el programa. Verifique que la letra de unidad que aparece bajo `Device` sea la unidad con la memoria USB. Haga clic en el icono de la carpeta y seleccione la imagen que desea escribir en la memoria USB. Haga clic en btn:[Save] para aceptar el nombre del archivo de imagen. Verifique que todo sea correcto y que ninguna carpeta de la memoria USB esté abierta en otras ventanas. Cuando todo esté listo, haga clic en btn:[Write] para escribir el archivo de imagen en la memoria USB.
ru: Дважды щелкните по значку Win32DiskImager, чтобы запустить программу. Убедитесь, что буква диска, указанная в разделе `Device`, соответствует диску с флеш-накопителем. Нажмите на значок папки и выберите образ, который нужно записать на флеш-накопитель. Нажмите btn:[Save], чтобы подтвердить имя файла образа. Убедитесь, что все правильно и что никакие папки на флеш-накопителе не открыты в других окнах. Когда все готово, нажмите btn:[Write], чтобы записать файл образа на флеш-накопитель.

source: Starting the Installation
es: Inicio de la instalación
ru: Начало установки

source: By default, the installation will not make any changes to the disk(s) before the following message:
es: De forma predeterminada, la instalación no realizará ningún cambio en el disco o discos antes del siguiente mensaje:
ru: По умолчанию установка не вносит никаких изменений на диск(и) до следующего сообщения:

source: Your changes will now be written to disk. If you have chosen to overwrite existing data, it will be PERMANENTLY ERASED. Are you sure you want to commit your changes?
es: Sus cambios se escribirán ahora en el disco. Si ha optado por sobrescribir los datos existentes, estos se ELIMINARÁN PERMANENTEMENTE. ¿Está seguro de que desea aplicar los cambios?

source: The install can be exited at any time prior to this warning. If there is a concern that something is incorrectly configured, just turn the computer off before this point and no changes will be made to the system's disks.
es: Es posible salir de la instalación en cualquier momento antes de esta advertencia. Si existe alguna preocupación de que algo esté configurado incorrectamente, simplemente apague el equipo antes de este punto y no se realizará ningún cambio en los discos del sistema.
ru: Установку можно прервать в любой момент до этого предупреждения. Если есть опасения, что что-то настроено неправильно, просто выключите компьютер до этого момента, и никакие изменения не будут внесены в диски системы.

source: This section describes how to boot the system from the installation media which was prepared using the instructions in crossref:bsdinstall[bsdinstall-installation-media, Prepare the Installation Media]. When using a bootable USB stick, plug in the USB stick before turning on the computer. When booting from CD or DVD, turn on the computer and insert the media at the first opportunity. How to configure the system to boot from the inserted media depends upon the architecture.
es: Esta sección describe cómo arrancar el sistema desde el medio de instalación que se preparó siguiendo las instrucciones en crossref:bsdinstall[bsdinstall-installation-media, Prepare the Installation Media]. Al utilizar una memoria USB de arranque, conecte la memoria USB antes de encender el equipo. Al arrancar desde un CD o DVD, encienda el equipo e inserte el medio en la primera oportunidad. La forma de configurar el sistema para arrancar desde el medio insertado depende de la arquitectura.
ru: В этом разделе описывается, как загрузить систему с установочного носителя, подготовленного в соответствии с инструкциями в пункте crossref:bsdinstall[bsdinstall-installation-media, Подготовка установочного носителя]. При использовании загрузочной USB-флешки подключите её к компьютеру перед включением. При загрузке с CD или DVD включите компьютер и вставьте носитель при первой возможности. Настройка системы для загрузки с подключённого носителя зависит от архитектуры.

source: FreeBSD Boot Loader Menu
es: Menú del cargador de arranque de FreeBSD
ru: Меню загрузчика FreeBSD

source: Once the system boots from the installation media, a menu similar to the following will be displayed:
es: Una vez que el sistema arranque desde el medio de instalación, aparecerá un menú similar al siguiente:
ru: После загрузки системы с установочного носителя появится меню, подобное следующему:

source: FreeBSD boot loader menu
es: Menú del cargador de arranque de FreeBSD
ru: Меню загрузчика FreeBSD

source: By default, the menu will wait ten seconds for user input before booting into the FreeBSD installer or, if FreeBSD is already installed, before booting into FreeBSD. To pause the boot timer in order to review the selections, press kbd:[Space]. To select an option, press its highlighted number, character, or key. The following options are available.
es: De forma predeterminada, el menú esperará diez segundos una entrada del usuario antes de arrancar el instalador de FreeBSD o, si FreeBSD ya está instalado, antes de arrancar FreeBSD. Para pausar el temporizador de arranque con el fin de revisar las selecciones, presione kbd:[Space]. Para seleccionar una opción, presione su número, carácter o tecla resaltada. Las siguientes opciones están disponibles.
ru: По умолчанию меню будет ждать десять секунд ввода пользователя перед загрузкой установщика FreeBSD или, если FreeBSD уже установлена, перед загрузкой системы. Чтобы приостановить таймер загрузки для просмотра вариантов, нажмите kbd:[Пробел]. Для выбора варианта нажмите соответствующую подсвеченную цифру, символ или клавишу. Доступны следующие варианты.

source: `Boot Multi User`: This will continue the FreeBSD boot process. If the boot timer has been paused, press kbd:[1], upper- or lower-case kbd:[B], or kbd:[Enter].
es: `Boot Multi User`: Esto continuará el proceso de arranque de FreeBSD. Si el temporizador de arranque se ha pausado, presione kbd:[1], kbd:[B] (mayúscula o minúscula) o kbd:[Enter].
ru: `Загрузка в многопользовательском режиме (Boot Multi User)`: Это продолжит процесс загрузки FreeBSD. Если таймер загрузки был приостановлен, нажмите kbd:[1], kbd:[B] (в верхнем или нижнем регистре) или kbd:[Enter].

source: `Boot Single User`: This mode can be used to fix an existing FreeBSD installation as described in crossref:boot[boot-singleuser,“Single-User Mode”]. Press kbd:[2] or the upper- or lower-case kbd:[S] to enter this mode.
es: `Boot Single User`: Este modo se puede utilizar para reparar una instalación existente de FreeBSD, tal como se describe en crossref:boot[boot-singleuser,“Single-User Mode”]. Presione kbd:[2] o la tecla kbd:[S] (mayúscula o minúscula) para acceder a este modo.
ru: `Загрузка в однопользовательском режиме (Boot Single User)`: Этот режим может быть использован для исправления существующей установки FreeBSD, как описано в crossref:boot[boot-singleuser,“Однопользовательский режим”]. Для входа в этот режим нажмите kbd:[2] или kbd:[S] в верхнем или нижнем регистре.

source: `Escape to loader prompt`: This will boot the system into a repair prompt that contains a limited number of low-level commands. This prompt is described in crossref:boot[boot-loader,“Stage Three”]. Press kbd:[3] or kbd:[Esc] to boot into this prompt.
es: `Escape to loader prompt`: Esto arrancará el sistema en una consola de reparación que contiene un número limitado de comandos de bajo nivel. Esta consola se describe en crossref:boot[boot-loader,“Stage Three”]. Presione kbd:[3] o kbd:[Esc] para iniciar en este modo.
ru: `Выход в загрузчик (Escape to loader prompt)`: Это загрузит систему в режим восстановления с ограниченным набором низкоуровневых команд. Данный режим описан в разделе crossref:boot[boot-loader,“Этап три”]. Для загрузки в этом режиме нажмите kbd:[3] или kbd:[Esc].

source: `Reboot`: Reboots the system.
es: `Reboot`: Reinicia el sistema.
ru: `Перезагрузка (Reboot)`: Перезагружает систему.

source: `Cons`: Allow to continue the installation by `video`, `serial`, `Dual (serial primary)` or `Dual (Video primary)`
es: `Cons`: Permite continuar la instalación mediante `video`, `serial`, `Dual (serial primary)` o `Dual (Video primary)`
ru: `Cons`: Позволяет продолжить установку через `видео`, `последовательный порт`, `двухконсольную конфигурацию (основная консоль — последовательный порт)` или `двухконсольную конфигурацию (основная консоль — видео)`

source: `Kernel`: Loads a different kernel.
es: `Kernel`: Carga un kernel diferente.
ru: `Ядро (Kernel)`: Загружает другое ядро.

source: `Boot Options`: Opens the menu shown in, and described under, crossref:bsdinstall[bsdinstall-boot-options-menu,FreeBSD Boot Options Menu].
es: `Boot Options`: Abre el menú mostrado en, y descrito bajo, crossref:bsdinstall[bsdinstall-boot-options-menu,FreeBSD Boot Options Menu].
ru: `Параметры загрузки (Boot Options)`: Открывает меню, показанное на рисунке crossref:bsdinstall[bsdinstall-boot-options-menu,Меню параметров загрузки FreeBSD] и описанное после него.

source: FreeBSD Boot Options Menu
es: Menú de opciones de arranque de FreeBSD
ru: Меню параметров загрузки FreeBSD

source: Menu showing the different boot options supported
es: Menú que muestra las diferentes opciones de arranque disponibles
ru: Меню с различными поддерживаемыми вариантами загрузки

source: The boot options menu is divided into two sections. The first section can be used to either return to the main boot menu or to reset any toggled options back to their defaults.
es: El menú de opciones de arranque se divide en dos secciones. La primera sección permite regresar al menú principal de arranque o restablecer cualquier opción conmutada a sus valores predeterminados.
ru: Меню параметров загрузки разделено на две части. Первая часть позволяет либо вернуться в главное меню загрузки, либо сбросить все изменённые параметры к значениям по умолчанию.
