Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: After the partitioning scheme has been selected and created, select btn:[Create] again to create the partitions. The kbd:[Tab] key is used to give focus to the fields (after cycling through btn:[<OK>], btn:[<Options>], and btn:[<Cancel>]).
es: Una vez seleccionado y creado el esquema de particionado, seleccione btn:[Create] de nuevo para crear las particiones. La tecla kbd:[Tab] se utiliza para dar el foco a los campos (después de pasar por btn:[<OK>], btn:[<Options>] y btn:[<Cancel>]).
ru: После выбора и создания схемы разделов снова выберите btn:[Создать], чтобы создать разделы. Клавиша kbd:[Tab] используется для перехода между полями (после перебора btn:[<OK>], btn:[<Параметры>] и btn:[<Отмена>]).

source: Menu requesting type
es: Menú que solicita el tipo de partición
ru: Тип запрашиваемого меню

source: A standard FreeBSD GPT installation uses at least three partitions, including either UFS or ZFS:
es: Una instalación estándar de FreeBSD con GPT utiliza al menos tres particiones, ya sea con UFS o ZFS:
ru: Стандартная установка FreeBSD с использованием GPT включает как минимум три раздела, включая либо UFS, либо ZFS:

source: `freebsd-boot` or `efi` - Holds the FreeBSD boot code.
es: `freebsd-boot` o `efi` - Contiene el código de arranque de FreeBSD.
ru: `freebsd-boot` или `efi` - Содержит загрузочный код FreeBSD.

source: `freebsd-ufs` - A FreeBSD UFS file system.
es: `freebsd-ufs` - Un sistema de archivos UFS de FreeBSD.
ru: `freebsd-ufs` - Файловая система FreeBSD UFS.

source: `freebsd-zfs` - A FreeBSD ZFS file system. More information about ZFS is available in crossref:zfs[zfs,The Z File System (ZFS)].
es: `freebsd-zfs` - Un sistema de archivos ZFS de FreeBSD. Hay más información disponible sobre ZFS en crossref:zfs[zfs,El sistema de archivos Z (ZFS)].
ru: `freebsd-zfs` - Файловая система ZFS в FreeBSD. Дополнительная информация о ZFS доступна в crossref:zfs[zfs,Файловая система ZFS (ZFS)].

source: `freebsd-swap` - FreeBSD swap space.
es: `freebsd-swap` - Espacio de intercambio de FreeBSD.
ru: `freebsd-swap` - область подкачки FreeBSD.

source: Refer to man:gpart[8] for descriptions of the available GPT partition types.
es: Consulte man:gpart[8] para obtener descripciones de los tipos de particiones GPT disponibles.
ru: Обратитесь к man:gpart[8] для описания доступных типов разделов GPT.

source: Multiple file system partitions can be created. Some people prefer a traditional layout with separate partitions for `/`, `/var`, `/tmp`, and `/usr`.
es: Se pueden crear múltiples particiones de sistemas de archivos. Algunas personas prefieren un diseño tradicional con particiones separadas para `/`, `/var`, `/tmp` y `/usr`.
ru: Можно создать несколько разделов файловой системы. Некоторые предпочитают традиционную схему с отдельными разделами для `/`, `/var`, `/tmp` и `/usr`.

source: Note that `/tmp` can be added later as a memory-based file system (man:tmpfs[5]) on systems with sufficient memory.
es: Tenga en cuenta que `/tmp` se puede añadir más tarde como un sistema de archivos basado en memoria (man:tmpfs[5]) en sistemas con suficiente memoria.
ru: Обратите внимание, что `/tmp` можно добавить позже как файловую систему в памяти (man:tmpfs[5]) на системах с достаточным объемом оперативной памяти.

source: See crossref:bsdinstall[bsdinstall-part-manual-splitfs,Creating Traditional Split File System Partitions] for an example.
es: Consulte crossref:bsdinstall[bsdinstall-part-manual-splitfs,Creación de particiones tradicionales de sistemas de archivos divididos] para ver un ejemplo.
ru: См. crossref:bsdinstall[bsdinstall-part-manual-splitfs,Создание традиционных разделов файловой системы с разделением] для примера.

source: The `Size` may be entered with common abbreviations: _K_ for kilobytes, _M_ for megabytes, or _G_ for gigabytes.
es: El `Size` se puede introducir con abreviaturas comunes: _K_ para kilobytes, _M_ para megabytes o _G_ para gigabytes.
ru: `Размер (Size)` может быть указан с общепринятыми сокращениями: _K_ для килобайт, _M_ для мегабайт или _G_ для гигабайт.

source: Proper sector alignment provides the best performance, and making partition sizes even multiples of 4K bytes helps to ensure alignment on drives with either 512-byte or 4K-byte sectors. Generally, using partition sizes that are even multiples of 1M or 1G is the easiest way to make sure every partition starts at an even multiple of 4K. There is one exception: a _freebsd-boot_ partition for BIOS booting should be no larger than 512K due to legacy boot code limitations. This limitation does not apply to UEFI booting.
es: La alineación adecuada de los sectores proporciona el mejor rendimiento, y hacer que los tamaños de las particiones sean múltiplos pares de 4K bytes ayuda a garantizar la alineación en unidades con sectores de 512 bytes o 4K bytes. Generalmente, el uso de tamaños de partición que son múltiplos pares de 1M o 1G es la forma más fácil de asegurarse de que cada partición comience en un múltiplo par de 4K. Hay una excepción: una partición _freebsd-boot_ para el arranque de la BIOS no debe ser mayor de 512K debido a las limitaciones del código de arranque heredado. Esta limitación no se aplica a UEFI.
ru: Правильное выравнивание секторов обеспечивает наилучшую производительность, а создание разделов с размерами, кратными 4 КБ, помогает гарантировать выравнивание на дисках с секторами размером 512 байт или 4 КБ. Как правило, использование размеров разделов, кратных 1 МБ или 1 ГБ, — это самый простой способ убедиться, что каждый раздел начинается с адреса, кратного 4 КБ. Есть одно исключение: раздел _freebsd-boot_ для загрузки из BIOS не должен превышать 512 КБ из-за ограничений старого загрузочного кода. Для загрузки с поддержкой UEFI такого ограничения нет.

source: A `Mountpoint` is needed if the partition will contain a file system. If only a single UFS partition will be created, the mountpoint should be `/`.
es: Se necesita un `Mountpoint` si la partición contendrá un sistema de archivos. Si solo se creará una única partición UFS, el punto de montaje debe ser `/`.
ru: Для раздела, который будет содержать файловую систему, требуется `точка монтирования (Mountpoint)`. Если создается только один раздел UFS, точкой монтирования должен быть `/`.

source: The `Label` is a name by which the partition will be known. Drive names or numbers can change if the drive is connected to a different controller or port, but the partition label does not change. Referring to labels instead of drive names and partition numbers in files like `/etc/fstab` makes the system more tolerant to hardware changes. GPT labels appear in `/dev/gpt/` when a disk is attached. Other partitioning schemes have different label capabilities and their labels appear in different directories in `/dev/`.
es: El `Label` es un nombre por el cual se conocerá la partición. Los nombres o números de las unidades pueden cambiar si la unidad se conecta a un controlador o puerto diferente, pero la etiqueta de la partición no cambia. Referirse a las etiquetas en lugar de a los nombres de las unidades y números de partición en archivos como `/etc/fstab` hace que el sistema sea más tolerante a los cambios de hardware. Las etiquetas GPT aparecen en `/dev/gpt/` cuando se conecta un disco. Otros esquemas de particionamiento tienen diferentes capacidades de etiquetado y sus etiquetas aparecen en diferentes directorios en `/dev/`.
ru: `Метка (Label)` — это имя, по которому раздел будет известен. Имена или номера дисков могут измениться, если диск подключён к другому контроллеру или порту, но метка раздела остаётся неизменной. Использование меток вместо имён дисков и номеров разделов в файлах, таких как `/etc/fstab`, делает систему более устойчивой к изменениям оборудования. Метки GPT отображаются в `/dev/gpt/` при подключении диска. Другие схемы разделения имеют свои возможности для меток, и их метки отображаются в разных каталогах в `/dev/`.

source: Use a unique label on every partition to avoid conflicts from identical labels. A few letters from the computer's name, use, or location can be added to the label. For instance, use `labroot` or `rootfslab` for the UFS root partition on the computer named `lab`.
es: Use una etiqueta única en cada partición para evitar conflictos por etiquetas idénticas. Se pueden añadir a la etiqueta unas pocas letras del nombre, uso o ubicación de la computadora. Por ejemplo, use `labroot` o `rootfslab` para la partición raíz UFS en la computadora llamada `lab`.
ru: Используйте уникальные метки для каждого раздела, чтобы избежать конфликтов из-за одинаковых меток. Можно добавить несколько букв из имени компьютера, его назначения или местоположения. Например, используйте `labroot` или `rootfslab` для корневого раздела UFS на компьютере с именем `lab`.

source: Creating Traditional Split File System Partitions
es: Creación de particiones tradicionales de sistemas de archivos divididos
ru: Создание традиционных разделов файловой системы с разделением

source: For a traditional partition layout where the `/`, `/var`, `/tmp`, and `/usr` directories are separate file systems on their own partitions, create a GPT partitioning scheme, then create the partitions as shown. Partition sizes shown are typical for a 20G target disk. If more space is available on the target disk, larger swap or `/var` partitions may be useful. Labels shown here are prefixed with `ex` for "example", but readers should use other unique label values as described above.
es: Para un diseño de partición tradicional donde los directorios `/`, `/var`, `/tmp` y `/usr` son sistemas de archivos separados en sus propias particiones, cree un esquema de particionamiento GPT y, a continuación, cree las particiones como se muestra. Los tamaños de partición mostrados son típicos para un disco de destino de 20G. Si hay más espacio disponible en el disco de destino, pueden ser útiles particiones de intercambio o `/var` más grandes. Las etiquetas que se muestran aquí tienen el prefijo `ex` de "ejemplo", pero los lectores deben usar otros valores de etiqueta únicos como se describió anteriormente.
ru: Для традиционной схемы разделов, где `/`, `/var`, `/tmp` и `/usr` являются отдельными файловыми системами на своих разделах, создайте схему разделов GPT, затем создайте разделы, как показано ниже. Указанные размеры разделов типичны для целевого диска размером 20 ГБ. Если на целевом диске доступно больше места, могут быть полезны увеличенные разделы подкачки или `/var`. Метки, указанные здесь, имеют префикс `ex` (от "example"), но читателям следует использовать другие уникальные значения меток, как описано выше.

source: By default, FreeBSD's `gptboot` expects the first UFS partition to be the `/` partition.
es: Por defecto, el `gptboot` de FreeBSD espera que la primera partición UFS sea la partición `/`.
ru: По умолчанию `gptboot` в FreeBSD ожидает, что первый UFS-раздел будет разделом `/`.

source: Partition Type
es: Tipo de partición
ru: Тип раздела

source: Size
es: Tamaño
ru: Размер

source: Mountpoint
es: Punto de montaje
ru: Точка монтирования

source: Label
es: Etiqueta

source: accept the default (remainder of the disk)
es: acepte el valor predeterminado (el resto del disco)
ru: принять значение по умолчанию (оставшаяся часть диска)

source: After the custom partitions have been created, select btn:[Finish] to continue with the installation and go to crossref:bsdinstall[bsdinstall-fetching-distribution, Fetching Distribution Files].
es: Después de que se hayan creado las particiones personalizadas, seleccione btn:[Finish] para continuar con la instalación y vaya a crossref:bsdinstall[bsdinstall-fetching-distribution, Obtención de archivos de distribución].
ru: После создания пользовательских разделов выберите btn:[Завершить (Finish)], чтобы продолжить установку и перейти к разделу crossref:bsdinstall[bsdinstall-fetching-distribution, Загрузка файлов дистрибутива].

source: Guided Partitioning Using Root-on-ZFS
es: Particionamiento guiado mediante Root-on-ZFS
ru: Разметка диска с использованием Root-on-ZFS с помощью мастера

source: This partitioning mode only works with whole disks and will erase the contents of the entire disk. The main ZFS configuration menu offers a number of options to control the creation of the pool.
es: Este modo de particionamiento solo funciona con discos completos y borrará el contenido de todo el disco. El menú principal de configuración de ZFS ofrece una serie de opciones para controlar la creación del pool.
ru: Этот режим разметки работает только с целыми дисками и полностью сотрёт все данные на диске. Основное меню настройки ZFS предоставляет несколько вариантов управления созданием пула.

source: ZFS Partitioning Menu
es: Menú de particionamiento ZFS
ru: Меню разметки ZFS

source: Menu showing the different options to configure the ZFS pool
es: Menú que muestra las diferentes opciones para configurar el pool de ZFS
ru: Меню с различными вариантами настройки пула ZFS

source: Here is a summary of the options in this menu:
es: Aquí hay un resumen de las opciones de este menú:
ru: Вот краткое описание пунктов этого меню:

source: `Install` - Proceed with the installation with the selected options.
es: `Install` - Continuar con la instalación con las opciones seleccionadas.
ru: `Установить (Install)` - Приступить к установке с выбранными параметрами.

source: `Pool Type/Disks` - Configure the `Pool Type` and the disk(s) that will constitute the pool. The automatic ZFS installer currently only supports the creation of a single top level vdev, except in stripe mode. To create more complex pools, use the instructions in crossref:bsdinstall[bsdinstall-part-shell, Shell Mode Partitioning] to create the pool.
es: `Pool Type/Disks` - Configure el `Pool Type` y el disco o los discos que constituirán el pool. El instalador automático de ZFS actualmente solo admite la creación de un único vdev de nivel superior, excepto en el modo "stripe" (franja). Para crear pools más complejos, utilice las instrucciones en crossref:bsdinstall[bsdinstall-part-shell, Particionamiento en modo Shell] para crear el pool.
ru: `Тип пула/диски (Pool Type/Disks)` - Настройте `Тип пула` и диск(и), которые будут составлять пул. Автоматический установщик ZFS в настоящее время поддерживает создание только одного vdev верхнего уровня, за исключением режима stripe. Для создания более сложных пулов воспользуйтесь инструкциями в crossref:bsdinstall[bsdinstall-part-shell, Разметка в режиме оболочки], чтобы создать пул.

source: `Rescan Devices` - Repopulate the list of available disks.
es: `Rescan Devices` - Vuelve a generar la lista de discos disponibles.
ru: `Сканировать диски (Rescan Devices)` - Обновить список доступных дисков.

source: `Disk Info` - This menu can be used to inspect each disk, including its partition table and various other information such as the device model number and serial number, if available.
es: `Disk Info` - Este menú puede utilizarse para inspeccionar cada disco, incluyendo su tabla de particiones y otros datos diversos, como el número de modelo y el número de serie del dispositivo, si están disponibles.
ru: `Информация о диске (Disk Info)` - Это меню позволяет просматривать информацию о каждом диске, включая таблицу разделов и другие данные, такие как модель устройства и серийный номер, если они доступны.

source: `Pool Name` - Establish the name of the pool. The default name is _zroot_.
es: `Pool Name` - Establece el nombre del pool. El nombre predeterminado es _zroot_.
ru: `Имя пула (Pool Name)` - Укажите имя пула. По умолчанию используется имя _zroot_.

source: `Force 4K Sectors?` - Force the use of 4K sectors. By default, the installer will automatically create partitions aligned to 4K boundaries and force ZFS to use 4K sectors. This is safe even with 512 byte sector disks, and has the added benefit of ensuring that pools created on 512 byte disks will be able to have 4K sector disks added in the future, either as additional storage space or as replacements for failed disks. Press the kbd:[Enter] key to chose to activate it or not.
es: `Force 4K Sectors?` - Fuerza el uso de sectores de 4K. Por defecto, el instalador creará automáticamente particiones alineadas a límites de 4K y forzará a ZFS a usar sectores de 4K. Esto es seguro incluso con discos de sectores de 512 bytes, y tiene el beneficio adicional de garantizar que los pools creados en discos de 512 bytes podrán tener discos de sectores de 4K añadidos en el futuro, ya sea como espacio de almacenamiento adicional o como reemplazo de discos fallidos. Presione la tecla kbd:[Enter] para elegir activarlo o no.
ru: `Принудительно использовать секторы 4K? (Force 4K Sectors?)` — Принудительное использование секторов размером 4K. По умолчанию установщик автоматически создает разделы, выровненные по границам 4K, и принудительно устанавливает использование секторов 4K в ZFS. Это безопасно даже для дисков с секторами размером 512 байт и имеет дополнительное преимущество: пулы, созданные на дисках с 512-байтными секторами, смогут в будущем работать с дисками, имеющими секторы 4K, — как для расширения хранилища, так и для замены вышедших из строя дисков. Нажмите kbd:[Enter], чтобы выбрать активацию или отказ от нее.

source: `Encrypt Disks?` - Encrypting the disks allows the user to encrypt the disks using GELI. More information about disk encryption is available in crossref:disks[disks-encrypting-geli,“Disk Encryption with geli”]. Press the kbd:[Enter] key to choose whether to activate it or not.
es: `Encrypt Disks?` - El cifrado de los discos permite al usuario cifrarlos utilizando GELI. Encontrará más información sobre el cifrado de discos en crossref:disks[disks-encrypting-geli,“Cifrado de discos con geli”]. Presione la tecla kbd:[Enter] para elegir si activarlo o no.
ru: `Шифровать диски (Encrypt Disks)?` - Шифрование дисков позволяет пользователю зашифровать диски с помощью GELI. Дополнительная информация о шифровании дисков доступна в crossref:disks[disks-encrypting-geli,“Шифрование дисков с помощью geli”]. Нажмите клавишу kbd:[Enter], чтобы выбрать, активировать его или нет.

source: `Partition Scheme` - Choose the partition scheme. GPT is the recommended option in most cases. Press the kbd:[Enter] key to chose between the different options.
es: `Partition Scheme` - Elija el esquema de partición. GPT es la opción recomendada en la mayoría de los casos. Presione la tecla kbd:[Enter] para elegir entre las diferentes opciones.
ru: `Схема разделов (Partition Scheme)` - Выберите схему разделов. GPT рекомендуется в большинстве случаев. Нажмите клавишу kbd:[Enter] для выбора между различными вариантами.

source: `Swap Size` - Establish the amount of swap space.
es: `Swap Size` - Establece la cantidad de espacio de intercambio.
ru: `Размер подкачки (Swap Size)` - Установите объем области подкачки.

source: `Mirror Swap?` - Whether to mirror the swap between the disks. Be aware that enabling mirror swap will break crash dumps. Press the kbd:[Enter] key to activate it or not.
es: `Mirror Swap?` - Define si se debe realizar un espejo del espacio de intercambio entre los discos. Tenga en cuenta que activar el intercambio en espejo (mirror swap) romperá los volcados de memoria tras fallos (crash dumps). Presione la tecla kbd:[Enter] para activarlo o no.
ru: `Зеркалировать подкачку (Mirror Swap)?` - Определяет, нужно ли зеркалировать раздел подкачки между дисками. Учтите, что включение зеркалирования swap может нарушить работу дампов аварийных завершений. Нажмите kbd:[Enter], чтобы активировать или отклонить этот параметр.

source: `Encrypt Swap?` - Whether to encrypt the swap. This will encrypt the swap with a temporary key each time the system boots, and discards it on reboot. Press the kbd:[Enter] key to choose to activate it or not. More information about swap encryption in crossref:disks[swap-encrypting,“Encrypting Swap”].
es: `Encrypt Swap?` - Define si se debe cifrar el espacio de intercambio. Esto cifrará el intercambio con una clave temporal cada vez que el sistema arranque, y la descartará al reiniciar. Presione la tecla kbd:[Enter] para elegir si activarlo o no. Encontrará más información sobre el cifrado del espacio de intercambio en crossref:disks[swap-encrypting,“Cifrado del espacio de intercambio”].
ru: `Шифровать раздел подкачки (Encrypt Swap)?` - Определяет, следует ли шифровать раздел подкачки. При каждом запуске системы раздел подкачки будет зашифрован временным ключом, который удаляется после перезагрузки. Нажмите kbd:[Enter], чтобы выбрать, активировать эту функцию или нет. Дополнительная информация о шифровании раздела подкачки приведена в crossref:disks[swap-encrypting,"Шифрование раздела подкачки"].

source: Select kbd:[T] to configure the `Pool Type` and the disk(s) that will constitute the pool.
es: Seleccione kbd:[T] para configurar el `Pool Type` y el disco o los discos que constituirán el pool.
ru: Выберите kbd:[T], чтобы настроить `Тип пула (Pool Type)` и диски, которые будут входить в пул.

source: ZFS Pool Type
es: Tipo de pool de ZFS
ru: Тип пула ZFS

source: Menu requesting the Virtual Device type. Ex: stripe
es: Menú que solicita el tipo de dispositivo virtual (Virtual Device). Ej.: stripe
ru: Меню выбора типа виртуального устройства. Например: stripe

source: Here is a summary of the `Pool Type` that can be selected in this menu:
es: Aquí hay un resumen del `Pool Type` que se puede seleccionar en este menú:
ru: Вот сводка по `Типу пула`, который можно выбрать в этом меню:

source: `stripe` - Striping provides maximum storage of all connected devices, but no redundancy. If just one disk fails the data on the pool is lost irrevocably.
es: `stripe` - El seccionado (striping) proporciona el almacenamiento máximo de todos los dispositivos conectados, pero sin redundancia. Si falla un solo disco, los datos del pool se pierden de forma irrevocable.
ru: `stripe` - Чередование (striping) обеспечивает максимальный объем хранилища из всех подключенных устройств, но не предоставляет избыточности. Если выйдет из строя хотя бы один диск, данные в пуле будут потеряны безвозвратно.

source: `mirror` - Mirroring stores a complete copy of all data on every disk. Mirroring provides good read performance because data is read from all disks in parallel. Write performance is slower as the data must be written to all disks in the pool. Allows all but one disk to fail. This option requires at least two disks.
es: `mirror` - El espejado (mirroring) almacena una copia completa de todos los datos en cada disco. El espejado proporciona un buen rendimiento de lectura porque los datos se leen de todos los discos en paralelo. El rendimiento de escritura es más lento, ya que los datos deben escribirse en todos los discos del pool. Permite que fallen todos los discos excepto uno. Esta opción requiere al menos dos discos.
ru: `mirror` - Зеркалирование сохраняет полную копию всех данных на каждом диске. Зеркалирование обеспечивает высокую производительность чтения, поскольку данные считываются со всех дисков параллельно. Производительность записи ниже, так как данные должны быть записаны на все диски в пуле. Допускает отказ всех дисков, кроме одного. Для этого варианта требуется как минимум два диска.

source: `raid10` - Striped mirrors. Provides the best performance, but the least storage. This option needs at least an even number of disks and a minimum of four disks.
es: `raid10` - Espejos seccionados. Proporciona el mejor rendimiento, pero el menor almacenamiento. Esta opción necesita al menos un número par de discos y un mínimo de cuatro discos.
ru: `raid10` - Чередующиеся зеркала. Обеспечивает наилучшую производительность, но наименьший объем хранилища. Для этого варианта требуется четное количество дисков, минимум четыре.
