Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: If sshd was enabled in crossref:bsdinstall[bsdinstall-config-serv,Selecting Additional Services to Enable], the first boot might be a bit slower as the system generates SSH host keys. Subsequent boots will be faster. The fingerprints of the keys are then displayed as in the following example:
es: Si se habilitó sshd en crossref:bsdinstall[bsdinstall-config-serv,Selecting Additional Services to Enable], el primer arranque podría ser un poco más lento mientras el sistema genera las claves de host SSH. Los arranques posteriores serán más rápidos. Las huellas digitales de las claves se muestran entonces como en el siguiente ejemplo:
ru: Если в crossref:bsdinstall[bsdinstall-config-serv,Выбор дополнительных служб для включения] была включена служба sshd, первая загрузка может быть немного медленнее, так как система генерирует SSH-ключи хоста. Последующие загрузки будут быстрее. Отпечатки ключей отображаются, как в следующем примере:

source: Refer to crossref:security[openssh,"OpenSSH"] for more information about fingerprints and SSH.
es: Consulte crossref:security[openssh,"OpenSSH"] para obtener más información sobre las huellas digitales y SSH.
ru: Обратитесь к crossref:security[openssh,"OpenSSH"] для получения дополнительной информации об отпечатках и SSH.

source: FreeBSD does not install a graphical environment by default. Refer to crossref:x11[x11,The X Window System] for more information about installing and configuring a graphical window manager.
es: FreeBSD no instala un entorno gráfico por defecto. Consulte crossref:x11[x11,The X Window System] para obtener más información sobre la instalación y configuración de un gestor de ventanas gráfico.
ru: FreeBSD не устанавливает графическое окружение по умолчанию. Дополнительную информацию об установке и настройке графического оконного менеджера можно найти в crossref:x11[x11,The X Window System].

source: Proper shutdown of a FreeBSD computer helps protect data and hardware from damage. _Do not turn off the power before the system has been properly shut down!_ If the user is a member of the `wheel` group, become the superuser by typing `su` at the command line and entering the `root` password. Then, type `shutdown -p now` and the system will shut down cleanly, and, if the hardware supports it, turn itself off.
es: El apagado correcto de un ordenador FreeBSD ayuda a proteger los datos y el hardware de posibles daños. _¡No desconecte la alimentación antes de que el sistema se haya apagado correctamente!_ Si el usuario es miembro del grupo `wheel`, conviértase en superusuario escribiendo `su` en la línea de comandos e introduciendo la contraseña de `root`. Luego, escriba `shutdown -p now` y el sistema se apagará de forma limpia y, si el hardware lo permite, se apagará solo.
ru: Правильное завершение работы компьютера под управлением FreeBSD помогает защитить данные и оборудование от повреждений. _Не отключайте питание до того, как система будет правильно остановлена!_ Если пользователь является членом группы `wheel`, необходимо стать суперпользователем, введя `su` в командной строке и указав пароль `root`. Затем введите `shutdown -p now`, и система корректно завершит работу, а если оборудование поддерживает такую возможность, выключится автоматически.

source: Troubleshooting
es: Solución de problemas
ru: Устранение неполадок

source: This section covers basic installation troubleshooting, such as common problems people have reported.
es: Esta sección cubre la resolución de problemas básicos de instalación, como los problemas comunes que los usuarios han reportado.
ru: Этот раздел посвящён устранению основных проблем при установке, включая распространённые ошибки, о которых сообщали пользователи.

source: Check the Hardware Notes listed on the link:https://www.FreeBSD.org/releases/[FreeBSD Release Information] page for the version of FreeBSD to make sure the hardware is supported.
es: Consulte las Notas de hardware enumeradas en la página link:https://www.freebsd.org[FreeBSD Release Information] para la versión de FreeBSD para asegurarse de que el hardware es compatible.
ru: Проверьте заметки о совместимости оборудования на странице link:https://www.FreeBSD.org/releases/[информации о выпусках FreeBSD] для соответствующей версии FreeBSD, чтобы убедиться, что оборудование поддерживается.

source: Some installation problems can be avoided or alleviated by updating the firmware on various hardware components, most notably the motherboard. Motherboard firmware is usually referred to as the BIOS. Most motherboard and computer manufacturers have a website for upgrades and upgrade information.
es: Algunos problemas de instalación pueden evitarse o aliviarse actualizando el firmware de varios componentes de hardware, especialmente el de la placa base. El firmware de la placa base suele denominarse BIOS. La mayoría de los fabricantes de placas base y ordenadores tienen un sitio web para actualizaciones e información sobre estas.
ru: Некоторые проблемы при установке можно избежать или уменьшить, обновив микропрограмму различных компонентов оборудования, в первую очередь материнской платы. Микропрограмма материнской платы обычно называется BIOS. У большинства производителей материнских плат и компьютеров есть веб-сайты с обновлениями и информацией о них.

source: Manufacturers generally advise against upgrading the motherboard BIOS unless there is a good reason for doing so, like a critical update. The upgrade process _can_ go wrong, leaving the BIOS incomplete and the computer inoperative.
es: Los fabricantes generalmente desaconsejan actualizar la BIOS de la placa base a menos que haya una buena razón para hacerlo, como una actualización crítica. El proceso de actualización _puede_ fallar, dejando la BIOS incompleta y el ordenador inoperativo.
ru: Производители, как правило, не рекомендуют обновлять BIOS материнской платы без веской причины, такой как критическое обновление. Процесс обновления _может_ пройти неудачно, что приведёт к повреждению BIOS и неработоспособности компьютера.

source: If the system hangs while probing hardware during boot or behaves strangely during the installation process, ACPI may be the culprit. FreeBSD makes extensive use of the system ACPI service on the i386 and amd64 platforms to aid in system configuration if it is detected during boot. Unfortunately, some bugs still exist in both the ACPI driver and within system motherboards and BIOS firmware. ACPI can be disabled by setting the `hint.acpi.0.disabled` hint in the third stage boot loader:
es: Si el sistema se cuelga mientras sondea el hardware durante el arranque o se comporta de forma extraña durante el proceso de instalación, el ACPI puede ser el culpable. FreeBSD hace un uso extensivo del servicio ACPI del sistema en las plataformas i386 y amd64 para ayudar en la configuración del sistema si se detecta durante el arranque. Desafortunadamente, todavía existen algunos errores tanto en el controlador ACPI como en las placas base del sistema y en el firmware de la BIOS. El ACPI se puede desactivar estableciendo la pista `hint.acpi.0.disabled` en el cargador de arranque de tercera etapa:
ru: Если система зависает при проверке оборудования во время загрузки или ведет себя странно в процессе установки, причиной может быть ACPI. FreeBSD активно использует системную службу ACPI на платформах i386 и amd64 для помощи в настройке системы, если она обнаружена во время загрузки. К сожалению, в драйвере ACPI, а также в материнских платах и BIOS до сих пор существуют ошибки. ACPI можно отключить, установив подсказку `hint.acpi.0.disabled` в загрузчике третьей стадии:

source: This is reset each time the system is booted, so it is necessary to add `hint.acpi.0.disabled="1"` to the file `/boot/loader.conf`. More information about the boot loader can be found in crossref:boot[boot-synopsis,“Synopsis”].
es: Esto se restablece cada vez que se arranca el sistema, por lo que es necesario añadir `hint.acpi.0.disabled="1"` al archivo `/boot/loader.conf`. Se puede encontrar más información sobre el cargador de arranque en crossref:boot[boot-synopsis,“Synopsis”].
ru: Этот параметр сбрасывается при каждой загрузке системы, поэтому необходимо добавить `hint.acpi.0.disabled="1"` в файл `/boot/loader.conf`. Дополнительную информацию о загрузчике можно найти в crossref:boot[boot-synopsis,"Synopsis"].

source: Using the Live CD
es: Uso del Live CD
ru: Использование Live CD

source: The welcome menu of bsdinstall, shown in crossref:bsdinstall[bsdinstall-choose-mode,Welcome Menu], provides a btn:[Live CD] option. This is useful for those who are still wondering whether FreeBSD is the right operating system for them and want to test some of the features before installing.
es: El menú de bienvenida de bsdinstall, mostrado en crossref:bsdinstall[bsdinstall-choose-mode,Welcome Menu], ofrece una opción btn:[Live CD]. Esto es útil para aquellos que todavía se preguntan si FreeBSD es el sistema operativo adecuado para ellos y quieren probar algunas de las características antes de instalarlo.
ru: Меню приветствия `bsdinstall`, показанное в crossref:bsdinstall[bsdinstall-choose-mode,Меню приветствия], предоставляет опцию btn:[Live CD]. Это полезно для тех, кто ещё сомневается, подходит ли FreeBSD в качестве операционной системы, и хочет протестировать некоторые функции перед установкой.

source: The following points should be noted before using the btn:[Live CD]:
es: Deben tenerse en cuenta los siguientes puntos antes de utilizar el btn:[Live CD]:
ru: Следует отметить следующие моменты перед использованием btn:[Live CD]:

source: To gain access to the system, authentication is required. The username is `root` and the password is blank.
es: Para acceder al sistema, se requiere autenticación. El nombre de usuario es `root` y la contraseña está en blanco.
ru: Для доступа к системе требуется аутентификация. Имя пользователя — `root`, пароль пустой.

source: As the system runs directly from the installation media, performance will be significantly slower than that of a system installed on a hard disk.
es: Dado que el sistema se ejecuta directamente desde el medio de instalación, el rendimiento será significativamente más lento que el de un sistema instalado en un disco duro.
ru: Поскольку система работает непосредственно с установочного носителя, производительность будет значительно ниже, чем у системы, установленной на жёсткий диск.

source: This option only provides a command prompt and not a graphical interface.
es: Esta opción solo proporciona un símbolo del sistema y no una interfaz gráfica.
ru: Эта опция предоставляет только командную строку, а не графический интерфейс.

source: After reading this chapter, you will know:
ru: Прочитав эту главу, вы будете знать:

source: Consider using crossref:virtualization[virtualization,virtualization] if you want to use FreeBSD on a system that already has another operating system installed.
ru: Рассмотрите возможность использования crossref:virtualization[virtualization,Виртуализации], если вы хотите использовать FreeBSD на системе, где уже установлена другая операционная система.

source: After downloading the image file, download at least one _checksum_ file from the same directory. There are two _checksum_ files available, named after the release number and the architecture name. For example: `CHECKSUM.SHA256-FreeBSD-13.1-RELEASE-amd64` and `CHECKSUM.SHA512-FreeBSD-13.1-RELEASE-amd64`.
ru: После загрузки файла образа загрузите как минимум один файл _контрольной суммы_ из того же каталога. Доступны два файла _контрольной суммы_, названные в соответствии с номером выпуска и архитектурой. Например: `CHECKSUM.SHA256-FreeBSD-13.1-RELEASE-amd64` и `CHECKSUM.SHA512-FreeBSD-13.1-RELEASE-amd64`.

source: After downloading one of the files (or both), calculate the _checksum_ for the image file and compare it with the one shown in the _checksum_ file. Note that you need to compare the calculated _checksum_ against the correct file, as they correspond to two different algorithms: SHA256 and SHA512. FreeBSD provides man:sha256[1] and man:sha512[1] that can be used for calculating the _checksum_. Other operating systems have similar programs.
ru: После загрузки одного из файлов (или обоих) вычислите _контрольную сумму_ для файла образа и сравните её с указанной в файле _контрольной суммы_. Обратите внимание, что необходимо сравнивать вычисленную _контрольную сумму_ с правильным файлом, так как они соответствуют разным алгоритмам: SHA256 и SHA512. FreeBSD предоставляет утилиты man:sha256[1] и man:sha512[1], которые можно использовать для вычисления _контрольной суммы_. В других операционных системах существуют аналогичные программы.

source: The default partition layout for file systems includes one file system for the entire system. When using `UFS` it may be worth considering the use of multiple file systems if you have sufficient disk space or multiple disks. When laying out file systems, remember that hard drives transfer data faster from the outer tracks to the inner. Thus, smaller and heavier-accessed file systems should be closer to the outside of the drive, while larger partitions like `/usr` should be placed toward the inner parts of the disk. It is a good idea to create partitions in an order similar to: `/`, swap, `/var`, and `/usr`.
ru: По умолчанию схема разметки разделов для файловых систем включает одну файловую систему для всей системы. При использовании `UFS` может быть целесообразно рассмотреть использование нескольких файловых систем, если у вас достаточно места на диске или несколько дисков. При разметке файловых систем учитывайте, что жёсткие диски передают данные быстрее с внешних дорожек по сравнению с внутренними. Таким образом, небольшие и часто используемые файловые системы должны располагаться ближе к внешней части диска, а крупные разделы, такие как `/usr`, следует размещать ближе к внутренней части диска. Рекомендуется создавать разделы в следующем порядке: `/`, раздел подкачки, `/var` и `/usr`.

source: `ntpd` - The Network Time Protocol (NTP) daemon for automatic clock synchronization. Enable this service if you wish to synchronise your system clock with a remote time server or pool.
ru: `ntpd` — демон протокола сетевого времени (NTP) для автоматической синхронизации часов. Включите эту службу, если хотите синхронизировать системные часы с удалённым сервером времени или пулом серверов.

source: Menu showing that the installation has finished. And asking if you want to open a shell to make manual changes.
ru: Меню, показывающее, что установка завершена. И спрашивающее, хотите ли вы открыть оболочку для внесения изменений вручную.
