Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: If a DHCP server is not available, select btn:[No] and input the following addressing information in this menu:
es: Si no hay un servidor DHCP disponible, seleccione btn:[No] e introduzca la siguiente información de direccionamiento en este menú:
ru: Если DHCP-сервер недоступен, выберите btn:[Нет] и введите следующую информацию об адресации в этом меню:

source: IPv4 Static Configuration
es: Configuración estática de IPv4
ru: Статическая настройка IPv4

source: Menu requesting data to configure IPv4 network.
es: Menú que solicita los datos para configurar IPv4.
ru: Меню запроса данных для настройки сети IPv4.

source: `IP Address` - The IPv4 address assigned to this computer. The address must be unique and not already in use by another device on the local network.
es: `IP Address` - La dirección IPv4 asignada a este ordenador. La dirección debe ser única y no estar ya en uso por otro dispositivo en la red local.
ru: `IP-адрес` - IPv4-адрес, назначенный этому компьютеру. Адрес должен быть уникальным и не должен уже использоваться другим устройством в локальной сети.

source: `Subnet Mask` - The subnet mask for the network.
es: `Subnet Mask` - La máscara de subred para la red.
ru: `Маска подсети (Subnet Mask)` - Маска подсети для сети.

source: `Default Router` - The IP address of the network's default gateway.
es: `Default Router` - La dirección IP de la puerta de enlace predeterminada de la red.
ru: `Шлюз по умолчанию (Default Router)` - IP-адрес сетевого шлюза по умолчанию.

source: The next screen will ask if the interface should be configured for IPv6. If IPv6 is available and desired, choose btn:[Yes] to select it.
es: La siguiente pantalla preguntará si la interfaz debe ser configurada para IPv6. Si IPv6 está disponible y se desea, elija btn:[Yes] para seleccionarlo.
ru: Следующий экран спросит, нужно ли настраивать интерфейс для IPv6. Если IPv6 доступен и нужен, выберите btn:[Да], чтобы включить его.

source: Choose IPv6 Networking
es: Elegir red IPv6
ru: Выберите сеть IPv6

source: Menu indicating if IPv6 wants to be configured for the selected interface.
es: Menú que indica si se desea configurar IPv6 para la interfaz seleccionada.
ru: Меню, указывающее, требуется ли настройка IPv6 для выбранного интерфейса.

source: IPv6 also has two methods of configuration. StateLess Address AutoConfiguration (SLAAC) will automatically request the correct configuration information from a local router. Refer to http://tools.ietf.org/html/rfc4862[rfc4862] for more information. Static configuration requires manual entry of network information.
es: IPv6 también tiene dos métodos de configuración. La autoconfiguración de direcciones sin estado (SLAAC) solicitará automáticamente la información de configuración correcta de un router local. Consulte http://tools.ietf.org/html/rfc4862[rfc4862] para obtener más información. La configuración estática requiere la entrada manual de la información de red.
ru: В IPv6 также есть два метода настройки. Stateless Address Autoconfiguration (SLAAC) автоматически запрашивает правильную конфигурационную информацию у локального маршрутизатора. Подробнее см. http://tools.ietf.org/html/rfc4862[rfc4862]. Статическая настройка требует ручного ввода сетевой информации.

source: If an IPv6 router is available, select btn:[Yes] in the next menu to automatically configure the network interface. The installer will appear to pause for a minute or so as it finds the router and obtains the addressing information for the system.
es: Si hay un router IPv6 disponible, seleccione btn:[Yes] en el siguiente menú para configurar automáticamente la interfaz de red. Parecerá que el instalador se pausa durante un minuto aproximadamente mientras encuentra el router y obtiene la información de direccionamiento para el sistema.
ru: Если доступен маршрутизатор IPv6, выберите btn:[Да] в следующем меню для автоматической настройки сетевого интерфейса. Установщик может на минуту или около того показаться зависшим, пока он ищет маршрутизатор и получает адресную информацию для системы.

source: Choose IPv6 SLAAC Configuration
es: Elegir configuración IPv6 mediante SLAAC
ru: Выберите конфигурацию IPv6 SLAAC

source: Menu indicating if SLAAC wants to be configured for the selected interface.
es: Menú que indica si se desea configurar SLAAC para la interfaz seleccionada.
ru: Меню, указывающее, нужно ли настраивать SLAAC для выбранного интерфейса.

source: If an IPv6 router is not available, select btn:[No] and input the following addressing information in this menu:
es: Si no hay un router IPv6 disponible, seleccione btn:[No] e introduzca la siguiente información de direccionamiento en este menú:
ru: Если маршрутизатор IPv6 недоступен, выберите btn:[Нет] и введите следующую информацию о настройке адресации в этом меню:

source: IPv6 Static Configuration
es: Configuración estática de IPv6
ru: Статическая настройка IPv6

source: Menu requesting data to configure IPv6 network.
es: Menú que solicita los datos para configurar la red IPv6.
ru: Меню запрашивает данные для настройки сети IPv6.

source: `IPv6 Address` - The IPv6 address assigned to this computer. The address must be unique and not already in use by another device on the local network.
es: `IPv6 Address` - La dirección IPv6 asignada a este ordenador. La dirección debe ser única y no estar ya en uso por otro dispositivo en la red local.
ru: `IPv6-адрес` - IPv6-адрес, назначенный этому компьютеру. Адрес должен быть уникальным и не использоваться другим устройством в локальной сети.

source: `Default Router` - The IPv6 address of the network's default gateway.
es: `Default Router` - La dirección IPv6 de la puerta de enlace predeterminada de la red.
ru: `Шлюз по умолчанию (Default Router)` - IPv6-адрес шлюза по умолчанию в сети.

source: The last network configuration menu is used to configure the Domain Name System (DNS) resolver, which converts hostnames to and from network addresses. If DHCP or SLAAC was used to autoconfigure the network interface, the `Resolver Configuration` values may already be filled in. Otherwise, enter the local network's domain name in the `Search` field. `DNS #1` and `DNS #2` are the IPv4 and/or IPv6 addresses of the DNS servers. At least one DNS server is required.
es: El último menú de configuración de red se utiliza para configurar el resolutor del Sistema de Nombres de Dominio (DNS), el cual traduce nombres de host a direcciones de red y viceversa. Si se utilizó DHCP o SLAAC para autoconfigurar la interfaz de red, es posible que los valores de `Resolver Configuration` ya estén rellenos. De lo contrario, introduzca el nombre de dominio de la red local en el campo `Search`. `DNS #1` y `DNS #2` son las direcciones IPv4 y/o IPv6 de los servidores DNS. Se requiere al menos un servidor DNS.
ru: Последнее меню настройки сети используется для конфигурации резолвера Domain Name System (DNS), который преобразует имена хостов в сетевые адреса и обратно. Если для автоматической настройки сетевого интерфейса использовались DHCP или SLAAC, значения в `Resolver Configuration` могут быть уже заполнены. В противном случае введите имя домена локальной сети в поле `Search`. `DNS #1` и `DNS #2` — это IPv4 и/или IPv6-адреса DNS-серверов. Требуется указать хотя бы один DNS-сервер.

source: DNS Configuration
es: Configuración de DNS
ru: Конфигурация DNS

source: Menu requesting data to configure DNS for the network.
es: Menú que solicita los datos para configurar el DNS de la red.
ru: Меню запрашивает данные для настройки DNS в сети.

source: Once the interface is configured, select a mirror site that is located in the same region of the world as the computer on which FreeBSD is being installed. Files can be retrieved more quickly when the mirror is close to the target computer, reducing installation time.
es: Una vez configurada la interfaz, seleccione un sitio espejo (mirror) que esté ubicado en la misma región del mundo que el ordenador en el que se está instalando FreeBSD. Los archivos se pueden obtener más rápidamente cuando el espejo está cerca del ordenador de destino, lo que reduce el tiempo de instalación.
ru: После настройки интерфейса выберите зеркальный сайт, расположенный в том же регионе мира, что и компьютер, на который устанавливается FreeBSD. Файлы можно загрузить быстрее, если зеркало находится ближе к целевому компьютеру, что сокращает время установки.

source: Selecting `ftp://download.freebsd.org (Main Site)` will automatically route to the nearest mirror.
es: Seleccionar `ftp://download.freebsd.org (Main Site)` enrutará automáticamente al sitio espejo más cercano.
ru: Выбор `ftp://download.freebsd.org (Основной сайт)` автоматически перенаправит на ближайший зеркальный сервер.

source: Choosing a Mirror
es: Eligiendo un servidor espejo
ru: Выбор зеркала

source: Menu requesting a network mirror.
es: Menú que solicita un servidor espejo de red.
ru: Меню выбора сетевого зеркала.

source: Setting the Time Zone
es: Configuración de la zona horaria
ru: Установка часового пояса

source: The next series of menus are used to determine the correct local time by selecting the geographic region, country, and time zone. Setting the time zone allows the system to automatically correct for regional time changes, such as daylight savings time, and perform other time zone related functions properly.
es: La siguiente serie de menús se utiliza para determinar la hora local correcta mediante la selección de la región geográfica, el país y la zona horaria. Configurar la zona horaria permite al sistema corregir automáticamente los cambios horarios regionales, como el horario de verano, y realizar correctamente otras funciones relacionadas con la zona horaria.
ru: Следующая серия меню используется для определения правильного местного времени путем выбора географического региона, страны и часовой зоны. Установка часовой зоны позволяет системе автоматически корректировать региональные изменения времени, такие как переход на летнее время, и правильно выполнять другие функции, связанные с часовыми зонами.

source: The example shown here is for a machine located in the mainland time zone of Spain, Europe. The selections will vary according to the geographical location.
es: El ejemplo que se muestra aquí es para una máquina ubicada en la zona horaria peninsular de España, Europa. Las selecciones variarán de acuerdo con la ubicación geográfica.
ru: Пример, приведенный здесь, предназначен для машины, находящейся в материковой часовой зоне Испании, Европа. Выбор будет варьироваться в зависимости от географического местоположения.

source: Select a Region
es: Seleccionar una región
ru: Выберите регион

source: Menu requesting the timezone region.
es: Menú que solicita la región de la zona horaria.
ru: Меню выбора региона часовой зоны.

source: The appropriate region is selected using the arrow keys and then pressing kbd:[Enter].
es: La región apropiada se selecciona usando las teclas de dirección y presionando luego kbd:[Enter].
ru: Соответствующий регион выбирается с помощью клавиш со стрелками, а затем нажатием kbd:[Enter].

source: Select a Country
es: Seleccionar un país
ru: Выберите страну

source: Menu requesting the timezone country.
es: Menú que solicita el país de la zona horaria.
ru: Меню выбора страны для часовой зоны.

source: Select the appropriate country using the arrow keys and press kbd:[Enter].
es: Seleccione el país apropiado usando las teclas de dirección y presione kbd:[Enter].
ru: Выберите соответствующую страну с помощью клавиш со стрелками и нажмите kbd:[Enter].

source: Select a Time Zone
es: Seleccionar una zona horaria
ru: Выбор часовой зоны

source: Menu requesting the timezone zone.
es: Menú que solicita la zona horaria.
ru: Меню запроса часовой зоны.

source: The appropriate time zone is selected using the arrow keys and pressing kbd:[Enter].
es: La zona horaria apropiada se selecciona usando las teclas de dirección y presionando kbd:[Enter].
ru: Используя клавиши со стрелками, выберите подходящую часовую зону и нажмите kbd:[Enter].

source: Confirm Time Zone
es: Confirmar la zona horaria
ru: Подтверждение часовой зоны

source: Menu requesting confirmation of the selected timezone.
es: Menú que solicita la confirmación de la zona horaria seleccionada.
ru: Меню с запросом подтверждения выбранной часовой зоны.

source: Confirm the abbreviation for the time zone is correct.
es: Confirme que la abreviatura de la zona horaria sea correcta.
ru: Убедитесь, что аббревиатура часовой зоны верна.

source: Select Date
es: Seleccionar fecha
ru: Выбор даты

source: Menu requesting the system date.
es: Menú que solicita la fecha del sistema.
ru: Меню запроса системной даты.

source: The appropriate date is selected using the arrow keys and then pressing btn:[Set Date]. Otherwise, the date selection can be skipped by pressing btn:[Skip].
es: La fecha apropiada se selecciona usando las teclas de dirección y presionando luego btn:[Set Date]. De lo contrario, la selección de fecha se puede omitir presionando btn:[Skip].
ru: Выбор нужной даты осуществляется с помощью клавиш со стрелками, после чего нажимается btn:[Установить дату]. В противном случае можно пропустить выбор даты, нажав btn:[Пропустить].

source: Select Time
es: Seleccionar hora
ru: Выбор времени

source: Menu requesting the system time.
es: Menú que solicita la hora del sistema.
ru: Меню запроса системного времени.

source: The appropriate time is selected using the arrow keys and then pressing btn:[Set Time]. Otherwise, the time selection can be skipped by pressing btn:[Skip].
es: La hora apropiada se selecciona usando las teclas de dirección y presionando luego btn:[Set Time]. De lo contrario, la selección de la hora se puede omitir presionando btn:[Skip].
ru: Подходящее время выбирается с помощью клавиш со стрелками, а затем нажатием btn:[Установить время]. В противном случае можно пропустить выбор времени, нажав btn:[Пропустить].

source: Enabling Services
es: Habilitando servicios
ru: Включение сервисов

source: The next menu is used to configure which system services will be started whenever the system boots. All of these services are optional. Only start the services that are needed for the system to function.
es: El siguiente menú se utiliza para configurar qué servicios del sistema se iniciarán cada vez que el sistema arranque. Todos estos servicios son opcionales. Inicie solo los servicios que sean necesarios para que el sistema funcione.
ru: Следующее меню используется для настройки системных служб, которые будут запускаться при загрузке системы. Все эти службы являются опциональными. Запускайте только те службы, которые необходимы для функционирования системы.

source: Selecting Additional Services to Enable
es: Selección de servicios adicionales para habilitar
ru: Выбор дополнительных служб для включения

source: Menu showing the different services available.
es: Menú que muestra los diferentes servicios disponibles.
ru: Меню с доступными сервисами.

source: Here is a summary of the services that can be enabled in this menu:
es: Aquí hay un resumen de los servicios que se pueden habilitar en este menú:
ru: Вот перечень служб, которые можно включить в этом меню:

source: `local_unbound` - Enable the DNS local unbound. It is necessary to keep in mind that this is a configuration only meant for use as a local caching forwarding resolver. If the objective is to set up a resolver for the entire network, install package:dns/unbound[].
es: `local_unbound` - Habilita el DNS local unbound. Es necesario tener en cuenta que esta configuración está destinada únicamente para su uso como un resolutor de reenvío con caché local. Si el objetivo es configurar un resolutor para toda la red, instale package:dns/unbound[].
ru: `local_unbound` — Включить локальный DNS-резолвер unbound. Необходимо учитывать, что данная конфигурация предназначена только для использования в качестве локального кэширующего пересылающего резолвера. Если цель - настроить резолвер для всей сети, установите пакет package:dns/unbound[].

source: `sshd` - The Secure Shell (SSH) daemon is used to remotely access a system over an encrypted connection. Only enable this service if the system should be available for remote logins.
es: `sshd` - El demonio de Secure Shell (SSH) se utiliza para acceder de forma remota a un sistema a través de una conexión cifrada. Solo habilite este servicio si el sistema debe estar disponible para inicios de sesión remotos.
ru: `sshd` — демон Secure Shell (SSH), используемый для удалённого доступа к системе через зашифрованное соединение. Включайте эту службу только если системе необходимо быть доступной для удалённых входов.

source: `moused` - Enable this service if the mouse will be used from the command-line system console.
es: `moused` - Habilite este servicio si se va a utilizar el ratón desde la consola del sistema en línea de comandos.
ru: `moused` — Включите эту службу, если мышь будет использоваться в командной строке системной консоли.

source: `ntpdate` - Enable automatic clock synchronization at boot time. Note that the functionality of this program is now available in the man:ntpd[8] daemon and the man:ntpdate[8] utility will soon be retired.
es: `ntpdate` - Habilita la sincronización automática del reloj en el momento del arranque. Tenga en cuenta que la funcionalidad de este programa ahora está disponible en el demonio man:ntpd[8] y la utilidad man:ntpdate[8] pronto será retirada.
ru: `ntpdate` — Включить автоматическую синхронизацию времени при загрузке. Обратите внимание, что функциональность этой программы теперь доступна в демоне man:ntpd[8], а утилита man:ntpdate[8] вскоре будет исключена.

source: `ntpd` - The Network Time Protocol (NTP) daemon for automatic clock synchronization. Enable this service when wanting to synchronise the system clock with a remote time server or pool.
es: `ntpd` - El demonio de Network Time Protocol (NTP) para la sincronización automática del reloj. Habilite este servicio si desea sincronizar el reloj del sistema con un servidor o grupo de servidores de tiempo remoto.

source: `powerd` - System power control utility for power control and energy saving.
es: `powerd` - Utilidad de control de energía del sistema para el control de potencia y ahorro energético.
ru: `powerd` — Утилита управления питанием системы для контроля питания и энергосбережения.

source: `dumpdev` - Crash dumps are useful when debugging issues with the system, so users are encouraged to enable them.
es: `dumpdev` - Los volcados de memoria (crash dumps) son útiles al depurar problemas con el sistema, por lo que se recomienda a los usuarios que habiliten esta opción.
ru: `dumpdev` — Дампы памяти полезны при отладке проблем с системой, поэтому пользователям рекомендуется их включить.

source: Enabling Hardening Security Options
es: Habilitación de las opciones de fortalecimiento de seguridad
ru: Включение параметров усиленной безопасности

source: The next menu is used to configure which security options will be enabled. All of these options are optional. But their use is encouraged.
es: El siguiente menú se utiliza para configurar qué opciones de seguridad se habilitarán. Todas estas opciones son opcionales, pero se recomienda encarecidamente su uso.
ru: Следующее меню используется для настройки параметров безопасности, которые будут включены. Все эти параметры необязательны, но их использование рекомендуется.

source: Selecting Hardening Security Options
es: Selección de opciones de seguridad reforzada
ru: Выбор параметров усиленной безопасности

source: Menu shoring the different hardening security options.
es: Menú que muestra las diferentes opciones de reforzamiento de seguridad (hardening).
ru: Меню, показывающее различные варианты усиления безопасности.

source: Here is a summary of the options that can be enabled in this menu:
es: Aquí hay un resumen de las opciones que pueden habilitarse en este menú:
ru: Вот сводка опций, которые можно включить в этом меню:

source: `hide_uids` - Hide processes running as other users (UID). This prevents unprivileged users from seeing running processes from other users.
es: `hide_uids` - Oculta los procesos que se ejecutan como otros usuarios (UID). Esto evita que los usuarios sin privilegios vean los procesos en ejecución de otros usuarios.
ru: `hide_uids` — Скрывать процессы, выполняемые от имени других пользователей (UID). Это предотвращает возможность непривилегированным пользователям видеть запущенные процессы других пользователей.

source: `hide_gids` - Hide processes running as other groups (GID). This prevents unprivileged users from seeing running processes from other groups.
es: `hide_gids` - Oculta los procesos que se ejecutan como otros grupos (GID). Esto evita que los usuarios sin privilegios vean los procesos en ejecución de otros grupos.
ru: `hide_gids` — Скрывать процессы, выполняемые от имени других групп (GID). Это предотвращает возможность непривилегированных пользователей видеть выполняемые процессы других групп.

source: `hide_jail` - Hide processes running in jails. This prevents unprivileged users from seeing processes running inside jails.
es: `hide_jail` - Oculta los procesos que se ejecutan en jaulas (jails). Esto evita que los usuarios sin privilegios vean los procesos que se ejecutan dentro de las jaulas.
ru: `hide_jail` — Скрывать процессы, выполняющиеся в клетке. Это предотвращает возможность непривилегированным пользователям видеть процессы, выполняющиеся внутри клетки.

source: `read_msgbuf` - Disable reading kernel message buffer for unprivileged users. Prevent unprivileged users from using man:dmesg[8] to view messages from the kernel's log buffer.
es: `read_msgbuf` - Deshabilita la lectura del búfer de mensajes del kernel para usuarios sin privilegios. Evita que los usuarios sin privilegios utilicen man:dmesg[8] para ver los mensajes del búfer de registro del kernel.
ru: `read_msgbuf` — Запретить чтение буфера сообщений ядра непривилегированным пользователям. Предотвращает возможность использования непривилегированными пользователями man:dmesg[8] для просмотра сообщений из буфера журнала ядра.

source: `proc_debug` - Disable process debugging facilities for unprivileged users. Disables a variety of unprivileged inter-process debugging services, including some procfs functionality, `ptrace()`, and `ktrace()`. Please note that this will also prevent debugging tools such as man:lldb[1], man:truss[1] and man:procstat[1], as well as some built-in debugging facilities in certain scripting languages like PHP.
es: `proc_debug` - Deshabilita las funciones de depuración de procesos para usuarios sin privilegios. Deshabilita una variedad de servicios de depuración entre procesos no privilegiados, incluyendo algunas funcionalidades de procfs, `ptrace()` y `ktrace()`. Tenga en cuenta que esto también impedirá el uso de herramientas de depuración como man:lldb[1], man:truss[1] y man:procstat[1], así como algunas funciones de depuración integradas en ciertos lenguajes de script como PHP.
ru: `proc_debug` — Отключает средства отладки процессов для непривилегированных пользователей. Отключает различные сервисы отладки межпроцессного взаимодействия для непривилегированных пользователей, включая некоторую функциональность procfs, `ptrace()` и `ktrace()`. Обратите внимание, что это также заблокирует работу инструментов отладки, таких как man:lldb[1], man:truss[1] и man:procstat[1], а также некоторых встроенных средств отладки в определённых скриптовых языках, например PHP.

source: `random_pid` - Randomize the PID of processes.
es: `random_pid` - Aleatoriza el PID de los procesos.
ru: `random_pid` — Рандомизировать PID процессов.

source: `clear_tmp` - Clean `/tmp` when the system starts up.
es: `clear_tmp` - Limpia `/tmp` cuando el sistema se inicia.
ru: `clear_tmp` — очистка `/tmp` при запуске системы.
