Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: `raidz1` - Single Redundant RAID. Allow one disk to fail concurrently. This option needs at least three disks.
es: `raidz1` - RAID de redundancia simple. Permite que falle un disco de forma simultánea. Esta opción necesita al menos tres discos.
ru: `raidz1` - RAID с одинарной избыточностью. Позволяет одновременный отказ одного диска. Для этого варианта требуется как минимум три диска.

source: `raidz2` - Double Redundant RAID. Allows two disks to fail concurrently. This option needs at least four disks.
es: `raidz2` - RAID de redundancia doble. Permite que fallen dos discos de forma simultánea. Esta opción necesita al menos cuatro discos.
ru: `raidz2` - Двухдисковая избыточная RAID. Позволяет одновременно отказать двум дискам. Для этой конфигурации требуется как минимум четыре диска.

source: `raidz3` - Triple Redundant RAID. Allows three disks to fail concurrently. This option needs at least five disks.
es: `raidz3` - RAID de redundancia triple. Permite que fallen tres discos de forma simultánea. Esta opción necesita al menos cinco discos.
ru: `raidz3` - Трехкратно избыточный RAID. Позволяет одновременно отказать трем дискам. Для этого варианта требуется как минимум пять дисков.

source: Once a `Pool Type` has been selected, a list of available disks is displayed, and the user is prompted to select one or more disks to make up the pool. The configuration is then validated to ensure that enough disks are selected. If validation fails, select btn:[<Change Selection>] to return to the list of disks or btn:[<Back>] to change the `Pool Type`.
es: Una vez que se ha seleccionado un `Pool Type`, se muestra una lista de discos disponibles y se le pide al usuario que seleccione uno o más discos para conformar el pool. Luego se valida la configuración para asegurar que se hayan seleccionado suficientes discos. Si la validación falla, seleccione btn:[<Change Selection>] para volver a la lista de discos o btn:[<Back>] para cambiar el `Pool Type`.
ru: После выбора `Типа пула` отображается список доступных дисков, и пользователю предлагается выбрать один или несколько дисков для создания пула. Затем конфигурация проверяется, чтобы убедиться, что выбрано достаточное количество дисков. Если проверка не пройдена, выберите btn:[<Изменить выбор>], чтобы вернуться к списку дисков, или btn:[<Назад>], чтобы изменить `Тип пула`.

source: Disk Selection
es: Selección de discos
ru: Выбор диска

source: Menu requesting how many disks will be added to the pool
es: Menú que solicita cuántos discos se añadirán al pool
ru: Меню с запросом количества дисков, добавляемых в пул

source: Invalid Selection
es: Selección no válida
ru: Неверный выбор

source: Menu indicating that not enough disks have been selected.
es: Menú que indica que no se han seleccionado suficientes discos.
ru: Меню, указывающее, что выбрано недостаточно дисков.

source: If one or more disks are missing from the list, or if disks were attached after the installer was started, select btn:[- Rescan Devices] to repopulate the list of available disks.
es: Si faltan uno o más discos en la lista, o si los discos se conectaron después de que se iniciara el instalador, seleccione btn:[- Rescan Devices] para volver a generar la lista de discos disponibles.
ru: Если один или несколько дисков отсутствуют в списке или если диски были подключены после запуска установщика, выберите btn:[- Повторное сканирование устройств (Rescan Devices)], чтобы обновить список доступных дисков.

source: Rescan Devices
es: Reescanear dispositivos
ru: Пересканировать Устройства

source: Device rescan
es: Reescaneo de dispositivos
ru: Пересканирование устройств

source: To avoid accidentally erasing the wrong disk, the btn:[- Disk Info] menu can be used to inspect each disk, including its partition table and various other information such as the device model number and serial number, if available.
es: Para evitar borrar accidentalmente el disco equivocado, se puede utilizar el menú btn:[- Disk Info] para inspeccionar cada disco, incluyendo su tabla de particiones y diversa información adicional, como el número de modelo del dispositivo y el número de serie, si están disponibles.
ru: Чтобы случайно не стереть не тот диск, можно использовать меню btn:[- Disk Info] для просмотра информации о каждом диске, включая таблицу разделов и другие данные, такие как модель устройства и серийный номер, если они доступны.

source: Analyzing a Disk
es: Analizando un disco
ru: Анализ диска

source: Menu showing the information of the partitions.
es: Menú que muestra la información de las particiones.
ru: Меню с информацией о разделах.

source: Select kbd:[N] to configure the `Pool Name`. Enter the desired name, then select btn:[<OK>] to establish it or btn:[<Cancel>] to return to the main menu and leave the default name.
es: Seleccione kbd:[N] para configurar el `Pool Name`. Introduzca el nombre deseado, luego seleccione btn:[<OK>] para establecerlo o btn:[<Cancel>] para volver al menú principal y dejar el nombre por defecto.
ru: Выберите kbd:[N] для настройки `Имени пула (Pool Name)`. Введите желаемое имя, затем выберите btn:[<OK>], чтобы установить его, или btn:[<Отмена>], чтобы вернуться в главное меню и оставить имя по умолчанию.

source: Pool Name
es: Nombre del pool
ru: Имя пула

source: Menu requesting the name of the pool.
es: Menú que solicita el nombre del pool.
ru: Меню с запросом имени пула.

source: Select kbd:[S] to set the amount of swap. Enter the desired amount of swap, then select btn:[<OK>] to establish it or btn:[<Cancel>] to return to the main menu and let the default amount.
es: Seleccione kbd:[S] para configurar la cantidad de swap. Introduzca la cantidad de swap deseada, luego seleccione btn:[<OK>] para establecerla o btn:[<Cancel>] para volver al menú principal y dejar la cantidad por defecto.
ru: Выберите kbd:[S], чтобы установить размер раздела подкачки. Введите желаемый размер раздела подкачки, затем выберите btn:[<OK>] для подтверждения или btn:[<Cancel>], чтобы вернуться в главное меню и оставить значение по умолчанию.

source: Swap Amount
es: Cantidad de swap
ru: Размер раздела подкачки

source: Menu requesting the amount of swap memory
es: Menú que solicita la cantidad de swap
ru: Меню с запросом объема области подкачки

source: Once all options have been set to the desired values, select the btn:[>>> Install] option at the top of the menu. The installer then offers a last chance to cancel before the contents of the selected drives are destroyed to create the ZFS pool.
es: Una vez que todas las opciones hayan sido configuradas con los valores deseados, seleccione la opción btn:[>>> Install] en la parte superior del menú. El instalador ofrecerá entonces una última oportunidad para cancelar antes de que el contenido de las unidades seleccionadas sea destruido para crear el pool de ZFS.
ru: После установки всех необходимых значений выберите в верхней части меню опцию btn:[>>> Установить]. Установщик предоставит последнюю возможность отменить процесс перед уничтожением содержимого выбранных дисков для создания пула ZFS.

source: Last Chance
es: Última oportunidad
ru: Последний шанс

source: Menu indicating to the user that the data will be lost
es: Menú que indica al usuario que los datos se perderán
ru: Меню, предупреждающее пользователя о потере данных

source: If GELI disk encryption was enabled, the installer will prompt twice for the passphrase to be used to encrypt the disks. Initialization of the encryption then begins.
es: Si se habilitó el cifrado de disco GELI, el instalador solicitará dos veces la frase de contraseña que se utilizará para cifrar los discos. A continuación, comenzará la inicialización del cifrado.
ru: Если включено шифрование дисков GELI, установщик дважды запросит парольную фразу, используемую для шифрования дисков. Затем начнётся инициализация шифрования.

source: Disk Encryption Password
es: Cifrado de disco
ru: Пароль для шифрования диска

source: Menu requesting the password to encrypt the devices.
es: Menú que solicita la contraseña para cifrar los dispositivos.
ru: Меню с запросом пароля для шифрования устройств.

source: Initializing Encryption
es: Inicializando el cifrado
ru: Инициализация шифрования

source: Menu showing that the encryption is initializing.
es: Menú que muestra que el cifrado se está inicializando.
ru: Меню, показывающее, что шифрование инициализируется.

source: The installation then proceeds normally. To continue with the installation, go to crossref:bsdinstall[bsdinstall-fetching-distribution, Fetching Distribution Files].
es: La instalación procede entonces con normalidad. Para continuar con la instalación, vaya a crossref:bsdinstall[bsdinstall-fetching-distribution, Fetching Distribution Files].
ru: Установка затем продолжается в обычном режиме. Для продолжения установки перейдите к разделу crossref:bsdinstall[bsdinstall-fetching-distribution, Получение файлов дистрибутива].

source: Shell Mode Partitioning
es: Particionamiento en modo Shell
ru: Режим разметки разделов в оболочке

source: When creating advanced installations, the bsdinstall partitioning menus may not provide the level of flexibility required. Advanced users can select the btn:[Shell] option from the partitioning menu in order to manually partition the drives, create the file system(s), populate `/tmp/bsdinstall_etc/fstab`, and mount the file systems under `/mnt`. Once this is done, type `exit` to return to bsdinstall and continue the installation.
es: Al crear instalaciones avanzadas, los menús de particionamiento de bsdinstall pueden no proporcionar el nivel de flexibilidad requerido. Los usuarios avanzados pueden seleccionar la opción btn:[Shell] del menú de particionamiento para particionar manualmente las unidades, crear el sistema o sistemas de archivos, poblar `/tmp/bsdinstall_etc/fstab` y montar los sistemas de archivos bajo `/mnt`. Una vez hecho esto, escriba `exit` para volver a bsdinstall y continuar la instalación.
ru: При создании сложных установок меню разметки `bsdinstall` может не предоставлять необходимого уровня гибкости. Опытные пользователи могут выбрать опцию btn:[Shell] в меню разметки, чтобы вручную разметить диски, создать файловую систему(ы), заполнить `/tmp/bsdinstall_etc/fstab` и смонтировать файловые системы в `/mnt`. После выполнения этих действий введите `exit`, чтобы вернуться в `bsdinstall` и продолжить установку.

source: Fetching Distribution Files
es: Obtención de los archivos de distribución
ru: Загрузка файлов дистрибутива

source: Installation time will vary depending on the distributions chosen, installation media, and speed of the computer. A series of messages will indicate the progress.
es: El tiempo de instalación variará dependiendo de las distribuciones elegidas, el medio de instalación y la velocidad del ordenador. Una serie de mensajes indicará el progreso.
ru: Время установки может варьироваться в зависимости от выбранных дистрибутивов, носителя установки и скорости компьютера. Серия сообщений будет показывать ход выполнения.

source: First, the installer formats the selected disk(s) and initializes the partitions. Next, in the case of a `bootonly media` or `mini memstick`, it downloads the selected components:
es: Primero, el instalador formatea el disco o discos seleccionados e inicializa las particiones. A continuación, en el caso de un `bootonly media` o `mini memstick`, descarga los componentes seleccionados:
ru: Сначала установщик форматирует выбранный диск(и) и инициализирует разделы. Затем, в случае `bootonly media` или `mini memstick`, он загружает выбранные компоненты:

source: Menu showing the download of the different components.
es: Menú que muestra la descarga de los diferentes componentes.
ru: Меню загрузки различных компонентов.

source: Next, the integrity of the distribution files is verified to ensure they have not been corrupted during download or misread from the installation media:
es: A continuación, se verifica la integridad de los archivos de distribución para asegurar que no se hayan corrompido durante la descarga o se hayan leído incorrectamente desde el medio de instalación:
ru: Затем проверяется целостность файлов дистрибутива, чтобы убедиться, что они не были повреждены при загрузке или неправильно прочитаны с установочного носителя:

source: Verifying Distribution Files
es: Verificando los archivos de distribución
ru: Проверка файлов дистрибутива

source: Menu showing the verification of the different components.
es: Menú que muestra la verificación de los diferentes componentes.
ru: Меню с проверкой различных компонентов.

source: Finally, the verified distribution files are extracted to the disk:
es: Finalmente, los archivos de distribución verificados se extraen al disco:
ru: Наконец, проверенные файлы дистрибутива извлекаются на диск:

source: Extracting Distribution Files
es: Extrayendo los archivos de distribución
ru: Извлечение файлов дистрибутива

source: Menu showing the extraction of the different components.
es: Menú que muestra la extracción de los diferentes componentes.
ru: Меню с извлечением различных компонентов.

source: Once all requested distribution files have been extracted, bsdinstall displays the first post-installation configuration screen. The available post-configuration options are described in the next section.
es: Una vez que todos los archivos de distribución solicitados han sido extraídos, bsdinstall muestra la primera pantalla de configuración post-instalación. Las opciones de post-configuración disponibles se describen en la siguiente sección.
ru: После извлечения всех запрошенных файлов дистрибутива `bsdinstall` отображает первый экран настройки после установки. Доступные параметры пост-конфигурации описаны в следующем разделе.

source: Network Interfaces, Accounts, Time Zone, Services and Hardening
es: Interfaces de red, cuentas, zona horaria, servicios y reforzamiento de seguridad (hardening)
ru: Сетевые интерфейсы, учетные записи, часовой пояс, службы и защита

source: Setting the `root` Password
es: Configuración de la contraseña de `root`
ru: Установка пароля `root`

source: First, the `root` password must be set. While entering the password, the characters being typed are not displayed on the screen. The password must be entered twice to prevent typing errors.
es: Primero, se debe configurar la contraseña de `root`. Mientras se introduce la contraseña, los caracteres que se escriben no se muestran en la pantalla. La contraseña debe introducirse dos veces para evitar errores de escritura.
ru: Сначала необходимо установить пароль `root`. При вводе пароля символы не отображаются на экране. Пароль нужно ввести дважды, чтобы избежать ошибок при наборе.

source: Menu showing requesting the password for the root user.
es: Menú que solicita la contraseña para el usuario root.
ru: Меню с запросом пароля пользователя root.

source: Configuring Network Interfaces
es: Configurando las interfaces de red
ru: Настройка сетевых интерфейсов

source: Next, a list of the network interfaces found on the computer is shown. Select the interface to configure.
es: A continuación, se muestra una lista de las interfaces de red encontradas en el ordenador. Seleccione la interfaz a configurar.
ru: Далее приведён список сетевых интерфейсов, обнаруженных на компьютере. Выберите интерфейс для настройки.

source: Choose a Network Interface
es: Elija una interfaz de red
ru: Выберите сетевой интерфейс

source: Menu showing the different network interfaces to configure.
es: Menú que muestra las diferentes interfaces de red para configurar.
ru: Меню с различными сетевыми интерфейсами для настройки.

source: If an Ethernet interface is selected, the installer will skip ahead to the menu shown in crossref:bsdinstall[bsdinstall-configure-net-ipv4,Choose IPv4 Networking]. If a wireless network interface is chosen, the system will instead scan for wireless access points:
es: Si se selecciona una interfaz Ethernet, el instalador saltará directamente al menú que se muestra en crossref:bsdinstall[bsdinstall-configure-net-ipv4,Choose IPv4 Networking]. Si se elige una interfaz de red inalámbrica, el sistema buscará en su lugar puntos de acceso inalámbricos:
ru: Если выбран интерфейс Ethernet, установщик перейдет сразу к меню, показанному в crossref:bsdinstall[bsdinstall-configure-net-ipv4,Выбор IPv4-сети]. Если выбран беспроводной сетевой интерфейс, система выполнит поиск точек доступа:

source: Scanning for Wireless Access Points
es: Escaneando puntos de acceso inalámbricos
ru: Сканирование беспроводных точек доступа

source: Menu showing wireless network scanning.
es: Menú que muestra el escaneo de redes inalámbricas.
ru: Меню сканирования беспроводных сетей.

source: Wireless networks are identified by a Service Set Identifier (SSID); a short, unique name given to each network. SSIDs found during the scan are listed, followed by a description of the encryption types available for that network. If the desired SSID does not appear in the list, select btn:[Rescan] to scan again. If the desired network still does not appear, check for problems with antenna connections or try moving the computer closer to the access point. Rescan after each change is made.
es: Las redes inalámbricas se identifican mediante un Identificador de Conjunto de Servicios (SSID); un nombre corto y único asignado a cada red. Se enumeran los SSID encontrados durante el escaneo, seguidos de una descripción de los tipos de cifrado disponibles para esa red. Si el SSID deseado no aparece en la lista, seleccione btn:[Rescan] para escanear de nuevo. Si la red deseada sigue sin aparecer, compruebe si hay problemas con las conexiones de la antena o intente acercar el ordenador al punto de acceso. Vuelva a escanear después de cada cambio realizado.
ru: Беспроводные сети идентифицируются по имени Service Set Identifier (SSID) — короткому уникальному названию каждой сети. Обнаруженные при сканировании SSID перечислены ниже, вместе с описанием доступных типов шифрования для каждой сети. Если нужный SSID не отображается в списке, выберите btn:[Повторить сканирование (Rescan)], чтобы выполнить сканирование снова. Если нужная сеть по-прежнему не отображается, проверьте подключение антенны или попробуйте переместить компьютер ближе к точке доступа. После каждого изменения выполняйте повторное сканирование.

source: Choosing a Wireless Network
es: Eligiendo una red inalámbrica
ru: Выбор беспроводной сети

source: Menu showing the different wireless networks to connect to.
es: Menú que muestra las diferentes redes inalámbricas para conectar.
ru: Меню с различными беспроводными сетями для подключения.

source: Next, enter the encryption information for connecting to the selected wireless network. WPA2 encryption is strongly recommended over older encryption types such as WEP, which offer little security. If the network uses WPA2, input the password, also known as the Pre-Shared Key (PSK). For security reasons, the characters typed into the input box are displayed as asterisks.
es: A continuación, introduzca la información de cifrado para conectarse a la red inalámbrica seleccionada. Se recomienda encarecidamente el cifrado WPA2 en lugar de tipos de cifrado más antiguos como WEP, que ofrecen poca seguridad. Si la red utiliza WPA2, introduzca la contraseña, también conocida como Clave Precompartida (PSK). Por razones de seguridad, los caracteres introducidos en el cuadro de entrada se muestran como asteriscos.
ru: Далее введите информацию для шифрования, чтобы подключиться к выбранной беспроводной сети. Настоятельно рекомендуется использовать шифрование WPA2 вместо устаревших типов, таких как WEP, которые обеспечивают низкий уровень безопасности. Если сеть использует WPA2, введите пароль, также известный как Pre-Shared Key (PSK). В целях безопасности вводимые символы отображаются звездочками.

source: WPA2 Setup
es: Configuración de WPA2
ru: Настройка WPA2

source: Menu requesting the wireless network password.
es: Menú que solicita la contraseña de la red inalámbrica.
ru: Меню с запросом пароля для беспроводной сети.

source: Next, choose whether or not an IPv4 address should be configured on the Ethernet or wireless interface:
es: A continuación, elija si se debe configurar o no una dirección IPv4 en la interfaz Ethernet o inalámbrica:
ru: Затем выберите, нужно ли настраивать IPv4-адрес на Ethernet или беспроводном интерфейсе:

source: Choose IPv4 Networking
es: Elegir red IPv4
ru: Выберите сеть IPv4

source: Menu indicating if IPv4 wants to be configured for the selected interface.
es: Menú que indica si se desea configurar IPv4 para la interfaz seleccionada.
ru: Меню, указывающее, нужно ли настраивать IPv4 для выбранного интерфейса.

source: There are two methods of IPv4 configuration. DHCP will automatically configure the network interface correctly and should be used if the network provides a DHCP server. Otherwise, the addressing information needs to be input manually as a static configuration.
es: Hay dos métodos de configuración IPv4. DHCP configurará automáticamente la interfaz de red de forma correcta y debe utilizarse si la red proporciona un servidor DHCP. De lo contrario, la información de direccionamiento debe introducirse manualmente como una configuración estática.
ru: Существует два способа настройки IPv4. DHCP автоматически правильно настроит сетевой интерфейс и должен использоваться, если в сети есть DHCP-сервер. В противном случае, информацию об адресации необходимо ввести вручную как статическую конфигурацию.

source: Do not enter random network information as it will not work. If a DHCP server is not available, obtain the information listed in crossref:bsdinstall[bsdinstall-collect-network-information, Required Network Information] from the network administrator or Internet service provider.
es: No introduzca información de red aleatoria, ya que no funcionará. Si no hay un servidor DHCP disponible, obtenga la información detallada en crossref:bsdinstall[bsdinstall-collect-network-information, Required Network Information] a través del administrador de red o del proveedor de servicios de Internet.
ru: Не вводите произвольные сетевые настройки, так как это не сработает. Если DHCP-сервер недоступен, получите информацию, указанную в crossref:bsdinstall[bsdinstall-collect-network-information, Необходимая информация о сети], у администратора сети или интернет-провайдера.

source: If a DHCP server is available, select btn:[Yes] in the next menu to automatically configure the network interface. The installer will appear to pause for a minute or so as it finds the DHCP server and obtains the addressing information for the system.
es: Si hay un servidor DHCP disponible, seleccione btn:[Yes] en el siguiente menú para configurar automáticamente la interfaz de red. Parecerá que el instalador se pausa durante un minuto aproximadamente mientras encuentra el servidor DHCP y obtiene la información de direccionamiento para el sistema.
ru: Если доступен DHCP-сервер, выберите btn:[Да] в следующем меню для автоматической настройки сетевого интерфейса. Установщик может показаться зависшим на минуту или около того, пока он находит DHCP-сервер и получает адресную информацию для системы.

source: Choose IPv4 DHCP Configuration
es: Elección de la configuración IPv4 DHCP
ru: Выберите конфигурацию IPv4 DHCP

source: Menu indicating if DHCP wants to be configured for the selected interface.
es: Menú que indica si se desea configurar DHCP para la interfaz seleccionada.
ru: Меню, указывающее, нужно ли настраивать DHCP для выбранного интерфейса.
