Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/bsdinstall/_index.po
Languages: es, ru

source: Guide about how to install FreeBSD, the minimum hardware requirements and supported architectures, how to create the installation media, etc
es: Guía acerca de cómo instalar FreeBSD, los requisitos mínimos de hardware y las arquitecturas soportadas, cómo crear medios de instalación, etc
ru: Руководство по установке FreeBSD, минимальным требованиям к оборудованию и поддерживаемым архитектурам, созданию установочного диска и так далее

source: Part I. Getting Started
es: Parte I. Comenzando
ru: В начале

source: Chapter 2. Installing FreeBSD
es: Capítulo 2. Instalando FreeBSD
ru: Глава 2. Установка FreeBSD

source: Installing FreeBSD
es: Instalando FreeBSD
ru: Установка FreeBSD

source: Synopsis
es: Sinopsis
ru: Обзор

source: FreeBSD supports different architectures including amd64, ARM(R), RISC-V(R), and PowerPC(R). Depending on the architecture and platform, different images can be link:https://www.freebsd.org/where/[downloaded] to install or directly run FreeBSD.
es: FreeBSD es compatible con diversas arquitecturas, incluyendo amd64, ARM(R), RISC-V(R) y PowerPC(R). Dependiendo de la arquitectura y la plataforma, se pueden link:https://www.freebsd.org/where/[descargar] diferentes imágenes para instalar o ejecutar FreeBSD directamente.
ru: FreeBSD поддерживает различные архитектуры, включая amd64, ARM(R), RISC-V(R) и PowerPC(R). В зависимости от архитектуры и платформы, различные образы могут быть link:https://www.freebsd.org/where/[скачены] для установки или непосредственного запуска FreeBSD.

source: The image types are:
es: Los tipos de imágenes son:
ru: Типы образов:

source: Virtual Machine disk images, such as `qcow2`, `vmdk`, `vhd`, and raw device images. These are not installation images, but images that have FreeBSD preinstalled and ready for post-installation tasks. Virtual machine images are also commonly used in cloud environments.
es: Imágenes de disco de máquina virtual, tales como `qcow2`, `vmdk`, `vhd`, e imágenes de dispositivo raw. Estas no son imágenes de instalación, sino imágenes que tienen FreeBSD preinstalado y listo para tareas de postinstalación. Las imágenes de máquina virtual también se utilizan comúnmente en entornos de nube.
ru: Диски образов виртуальных машин, такие как `qcow2`, `vmdk`, `vhd`, и образы raw-устройств. Это не установочные образы, а образы с предустановленной FreeBSD, готовые к выполнению задач после установки. Образы виртуальных машин также часто используются в облачных средах.

source: SD card images, for embedded systems such as Raspberry Pi. These files must be uncompressed and written as a raw image to an SD card, from which the board will boot.
es: Imágenes de tarjeta SD, para sistemas embebidos como Raspberry Pi. Estos archivos deben estar sin comprimir y escribirse como una imagen raw (en bruto) en una tarjeta SD, desde la cual arrancará la placa.
ru: Образы SD-карт для встраиваемых систем, таких как Raspberry Pi. Эти файлы необходимо распаковать и записать как сырой образ на SD-карту, с которой будет загружаться плата.

source: Installation images to boot from an ISO or USB device to install FreeBSD on a drive for the usual desktop, laptop, or server system.
es: Imágenes de instalación para arrancar desde un dispositivo ISO o USB e instalar FreeBSD en una unidad para el sistema habitual de escritorio, portátil o servidor.
ru: Установочные образы для загрузки с ISO или USB-устройства, чтобы установить FreeBSD на диск для обычной настольной, портативной или серверной системы.

source: The rest of this chapter describes the third case, explaining how to install FreeBSD using the text-based installation program named bsdinstall. There may be minor differences between the installer and what is shown here, so use this chapter as a general guide rather than as a set of literal instructions.
es: El resto de este capítulo describe el tercer caso, explicando cómo instalar FreeBSD utilizando el programa de instalación basado en texto llamado bsdinstall. Puede haber pequeñas diferencias entre el instalador y lo que se muestra aquí, por lo tanto utilice este capítulo como una guía general en lugar de usarla como un conjunto de instrucciones literales.
ru: Остальная часть этой главы описывает третий случай, объясняя, как установить FreeBSD с использованием текстовой программы установки под названием `bsdinstall`. Между установщиком и тем, что показано здесь, могут быть незначительные различия, поэтому используйте эту главу как общее руководство, а не как точную инструкцию.

source: Read this chapter to learn:
es: Lea este capítulo para aprender:

source: How to obtain FreeBSD images and create FreeBSD installation media.
es: Cómo obtener imágenes de FreeBSD y crear medios de instalación de FreeBSD.
ru: Как получить образы FreeBSD и создать установочные носители FreeBSD.

source: How to start bsdinstall.
es: Cómo iniciar bsdinstall.
ru: Как запустить bsdinstall.

source: The questions bsdinstall will ask, what they mean, and how to answer them.
es: Las preguntas que hará bsdinstall, qué significan y cómo responderlas.
ru: Вопросы, которые задаст bsdinstall, их значение и как на них отвечать.

source: How to troubleshoot a failed installation.
es: Cómo solucionar problemas de una instalación fallida.
ru: Как решить проблемы неудачной установки.

source: How to access a live version of FreeBSD before committing to an installation.
es: Cómo acceder a una versión en vivo de FreeBSD antes de realizar la instalación.
ru: Как получить доступ к свежей версии FreeBSD перед установкой системы.

source: Minimum Hardware Requirements
es: Requisitos Mínimos de Hardware
ru: Минимальные требования к оборудованию

source: The hardware requirements to install FreeBSD vary by architecture and version. Hardware architectures and devices supported by a FreeBSD release are listed on the link:https://www.FreeBSD.org/releases/[FreeBSD Release Information] page. The link:https://www.FreeBSD.org/where/[FreeBSD download page] also has recommendations for choosing the correct image for different architectures.
es: Los requisitos de hardware para instalar FreeBSD varían según la arquitectura y la versión. Las arquitecturas de hardware y los dispositivos compatibles con una versión de FreeBSD se enumeran en la página link:https://www.FreeBSD.org/releases/[Información de la versión de FreeBSD]. La página de link:https://www.FreeBSD.org/where/[descarga de FreeBSD] también tiene recomendaciones para elegir la imagen correcta para diferentes arquitecturas.
ru: Требования к оборудованию для установки FreeBSD зависят от архитектуры и версии. Поддерживаемые аппаратные архитектуры и устройства для выпуска FreeBSD перечислены на странице link:https://www.FreeBSD.org/releases/[FreeBSD Release Information]. На странице link:https://www.FreeBSD.org/where/[FreeBSD download page] также приведены рекомендации по выбору правильного образа для различных архитектур.

source: Pre-Installation Tasks
es: Tareas previas a la instalación
ru: Задачи перед установкой

source: Once it has been determined that the system meets the minimum hardware requirements for installing FreeBSD, the installation file should be downloaded and the installation media prepared.
es: Una vez que se haya determinado que el sistema cumple con los requisitos mínimos de hardware para instalar FreeBSD, se debe descargar el archivo de instalación y preparar el medio de instalación.
ru: После того как будет подтверждено, что система соответствует минимальным требованиям для установки FreeBSD, необходимо загрузить установочный файл и подготовить установочный носитель.

source: Consider using crossref:virtualization[virtualization,virtualization] when wanting to use FreeBSD on a system that already has another operating system installed.
es: Considere el uso de crossref:virtualization[virtualización,virtualization] cuando desee utilizar FreeBSD en un sistema que ya tiene instalado otro sistema operativo.

source: Before moving on to the installation, check that the system is ready by verifying the items in this checklist:
es: Antes de pasar a la instalación, compruebe que el sistema esté listo verificando los elementos de esta lista de control:
ru: Прежде чем перейти к установке, убедитесь, что система готова, проверив пункты из этого контрольного списка:

source: *Back Up Important Data*
es: *Haga una copia de seguridad de los datos importantes*
ru: *Резервное копирование важных данных*

source: Before installing any operating system, *always* backup all important data first. Do not store the backup on the system being installed. Instead, save the data to a removable disk such as a USB drive, another system on the network, or an online backup service. Test the backup before starting the installation to make sure it contains all of the needed files. Once the installer formats the system's disk, all data stored on that disk will be lost.
es: Antes de instalar cualquier sistema operativo, *siempre* haga primero una copia de seguridad de todos los datos importantes. No guarde la copia de seguridad en el sistema que se está instalando. En su lugar, guarde los datos en un disco extraíble como una unidad USB, otro sistema en la red o un servicio de copia de seguridad en línea. Pruebe la copia de seguridad antes de comenzar la instalación para asegurarse de que contiene todos los archivos necesarios. Una vez que el instalador formatee el disco del sistema, todos los datos almacenados en ese disco se perderán.
ru: Перед установкой любой операционной системы *всегда* создавайте резервную копию всех важных данных. Не храните резервную копию на системе, на которую производится установка. Вместо этого сохраните данные на съемный диск, такой как USB-накопитель, другую систему в сети или в онлайн-сервис резервного копирования. Проверьте резервную копию перед началом установки, чтобы убедиться, что она содержит все необходимые файлы. После того как установщик отформатирует диск системы, все данные, хранящиеся на этом диске, будут потеряны.

source: *Decide Where to Install FreeBSD*
es: *Decida dónde instalar FreeBSD*
ru: *Выберите место для установки FreeBSD*

source: If FreeBSD will be the only operating system installed, this step can be skipped. But if FreeBSD will share the disk with another operating system, decide which disk or partition will be used for FreeBSD.
es: Si FreeBSD será el único sistema operativo instalado, este paso se puede omitir. Pero si FreeBSD compartirá el disco con otro sistema operativo, decida qué disco o partición se utilizará para FreeBSD.
ru: Если FreeBSD будет единственной операционной системой, этот шаг можно пропустить. Но если FreeBSD будет находиться на диске вместе с другой операционной системой, определите, какой диск или раздел будет использоваться для FreeBSD.

source: In the i386 and amd64 architectures, disks can be divided into multiple partitions using one of two partitioning schemes. A traditional _Master Boot Record_ (MBR) holds a partition table defining up to four _primary partitions_. For historical reasons, FreeBSD calls these primary partition _slices_. One of these primary partitions can be made into an _extended partition_ containing multiple _logical partitions_. The _GUID Partition Table_ (GPT) is a newer and simpler method of partitioning a disk. Common GPT implementations allow up to 128 partitions per disk, eliminating the need for logical partitions.
es: En las arquitecturas i386 y amd64, los discos pueden dividirse en múltiples particiones utilizando uno de dos esquemas de particionamiento. 1) Un _Registro de Arranque Maestro_ (MBR) tradicional que contiene una tabla de particiones que define hasta cuatro _particiones primarias_. Por razones históricas, FreeBSD denomina a estas particiones primarias _slices_. Una de estas particiones primarias puede convertirse en una _partición extendida_ que contenga múltiples _particiones lógicas_. 2) La _Tabla de Particiones GUID_ (GPT), el cual es un método de particionamiento de disco más reciente y simplificado. Las implementaciones comunes de GPT permiten hasta 128 particiones por disco, eliminando la necesidad de particiones lógicas.
ru: В архитектурах i386 и amd64 диски могут быть разделены на несколько разделов с использованием одной из двух схем разделения. Традиционная _Главная загрузочная запись_ (MBR) содержит таблицу разделов, определяющую до четырёх _основных разделов_. По историческим причинам FreeBSD называет эти основные разделы _слайсами_. Один из этих основных разделов может быть преобразован в _расширенный раздел_, содержащий несколько _логических разделов_. _Таблица разделов GUID_ (GPT) — это более новый и простой метод разделения диска. Стандартные реализации GPT позволяют создавать до 128 разделов на диске, что устраняет необходимость в логических разделах.

source: The FreeBSD boot loader requires either a primary or GPT partition. If all of the primary or GPT partitions are already in use, one must be freed for FreeBSD. To create a partition without deleting existing data, use a partition resizing tool to shrink an existing partition and create a new partition using the freed space.
es: El cargador de arranque de FreeBSD requiere una partición primaria o GPT. Si todas las particiones primarias o GPT ya están en uso, se debe liberar una para FreeBSD. Para crear una partición sin eliminar los datos existentes, utilice una herramienta de redimensionamiento de particiones para reducir una partición existente y crear una nueva partición utilizando el espacio liberado.
ru: Загрузчик FreeBSD требует наличия либо первичного, либо GPT-раздела. Если все первичные или GPT-разделы уже заняты, необходимо освободить один для FreeBSD. Чтобы создать раздел без удаления существующих данных, используйте инструмент для изменения размера разделов, чтобы уменьшить существующий раздел и создать новый раздел, используя освободившееся пространство.

source: An alternative to modifying the system's existing disk partitions is to use crossref:virtualization[virtualization,virtualization], which allows multiple operating systems to run at the same time without having to alter partitions.
es: Una alternativa a la modificación de las particiones de disco existentes en el sistema consiste en emplear crossref:virtualization[virtualization,virtualization], lo cual permite la ejecución simultánea de múltiples sistemas operativos sin necesidad de alterar las particiones.
ru: Альтернативой изменению существующих разделов диска системы является использование crossref:virtualization[virtualization, Виртуализации], которая позволяет одновременно запускать несколько операционных систем без необходимости изменения разделов.

source: A variety of free and commercial partition resizing tools are listed at link:https://en.wikipedia.org/wiki/List_of_disk_partitioning_software[List of disk partitioning software wikipedia entry]. link:https://gparted.org/livecd.php[GParted Live] is a free live CD which includes the GParted partition editor.
es: Diversas herramientas de redimensionamiento de particiones, tanto gratuitas como comerciales, se encuentran listadas en link:https://en.wikipedia.org/wiki/List_of_disk_partitioning_software[List of disk partitioning software wikipedia entry]. link:https://gparted.org/livecd.php[GParted Live] es un CD autónomo gratuito que incluye el editor de particiones GParted.
ru: Различные бесплатные и коммерческие инструменты для изменения размера разделов перечислены в статье link:https://en.wikipedia.org/wiki/List_of_disk_partitioning_software[Список программ для работы с разделами диска на Википедии]. link:https://gparted.org/livecd.php[GParted Live] — это бесплатный Live CD, включающий редактор разделов GParted.

source: When used properly, disk shrinking utilities can safely create space for creating a new partition. Since the possibility of selecting the wrong partition exists, always backup any important data and verify the integrity of the backup before modifying disk partitions.
es: Cuando se utilizan adecuadamente, las utilidades de reducción de disco pueden crear espacio de forma segura para la creación de una nueva partición. Debido a que existe la posibilidad de seleccionar la partición incorrecta, realice siempre una copia de seguridad de cualquier dato importante y verifique la integridad de dicha copia antes de modificar las particiones del disco.
ru: При правильном использовании утилиты для сжатия дисков могут безопасно освободить место для создания нового раздела. Поскольку существует вероятность выбора неправильного раздела, всегда создавайте резервные копии важных данных и проверяйте их целостность перед изменением разделов диска.

source: Disk partitions containing different operating systems make it possible to install multiple operating systems on one computer.
es: Las particiones de disco con distintos sistemas operativos permiten la coexistencia de varios de ellos en una sola computadora.
ru: Разделы диска с разными операционными системами позволяют установить несколько операционных систем на один компьютер.

source: *Collect Network Information*
es: *Recopilar información de red*
ru: *Соберите информацию о сети*

source: Some FreeBSD installation methods require a network connection in order to download the installation files. After any installation, the installer will offer to setup the system's network interfaces.
es: Algunos métodos de instalación de FreeBSD requieren una conexión de red para descargar los archivos de instalación. Tras cualquier proceso de instalación, el instalador ofrecerá configurar las interfaces de red del sistema.
ru: Некоторые методы установки FreeBSD требуют наличия сетевого подключения для загрузки файлов установки. После одного из этапов установки программа-установщик предложит настроить сетевые интерфейсы системы.

source: If the network has a DHCP server, it can be used to provide automatic network configuration. If DHCP is not available, the following network information for the system must be obtained from the local network administrator or Internet service provider:
es: Si la red dispone de un servidor DHCP, este puede utilizarse para proporcionar una configuración de red automática. En caso de que el protocolo DHCP no esté disponible, se deberá obtener la siguiente información de red del sistema a través del administrador de la red local o del proveedor de servicios de Internet:
ru: Если в сети есть DHCP-сервер, его можно использовать для автоматической настройки сети. Если DHCP недоступен, следующую информацию о сети для системы необходимо получить у локального сетевого администратора или интернет-провайдера:

source: Required Network Information
es: Información de red necesaria
ru: Необходимая сетевая информация

source: IP address
es: Dirección IP
ru: IP-адрес

source: Subnet mask
es: Máscara de subred
ru: Маска подсети

source: IP address of default gateway
es: Dirección IP de la puerta de enlace predeterminada
ru: IP-адрес шлюза по умолчанию

source: Domain name of the network
es: Nombre de dominio de la red
ru: Доменное имя сети

source: IP addresses of the network's DNS servers
es: Direcciones IP de los servidores DNS de la red
ru: IP-адреса DNS-серверов сети

source: *Check for FreeBSD Errata*
es: *Consultar las Errata de FreeBSD*
ru: *Проверьте наличие исправлений в FreeBSD*

source: Although the FreeBSD Project strives to ensure that each release of FreeBSD is as stable as possible, bugs occasionally creep into the process. On very rare occasions those bugs affect the installation process. As these problems are discovered and fixed, they are noted in the FreeBSD Errata page of each version. Check the errata before installing to make sure that there are no problems that might affect the installation.
es: Aunque el Proyecto FreeBSD se esfuerza por garantizar que cada versión sea lo más estable posible, ocasionalmente surgen errores en el proceso. En raras ocasiones, dichos errores pueden afectar el proceso de instalación. A medida que estos problemas se descubren y corrigen, se registran en la página de _Errata_ de FreeBSD de cada versión. Consulte la _errata_ antes de la instalación para asegurarse de que no existan problemas que puedan afectar el proceso.
ru: Хотя проект FreeBSD стремится к тому, чтобы каждая версия FreeBSD была максимально стабильной, иногда в процессе могут возникать ошибки. В очень редких случаях эти ошибки влияют на процесс установки. Когда такие проблемы обнаруживаются и исправляются, они отмечаются на странице FreeBSD Errata для каждой версии. Перед установкой проверьте список errata, чтобы убедиться в отсутствии проблем, которые могут повлиять на установку.

source: Information and errata for all the releases can be found on the link:https://www.FreeBSD.org/releases/[FreeBSD Release Information] page.
es: La información y las erratas de todas las versiones pueden encontrarse en la página de link:https://www.FreeBSD.org/releases/[Información de versiones de FreeBSD].
ru: Информация и список ошибок для всех выпусков доступны на странице link:https://www.FreeBSD.org/releases/[Информация о релизе FreeBSD].

source: Prepare the Installation Media
es: Preparación de los medios de instalación
ru: Подготовьте установочный носитель

source: The FreeBSD installer is not an application that can be run from within another operating system. Instead, download a FreeBSD installation file, burn it to the media associated with its file type and size (CD, DVD, or USB), and boot the system to install from the inserted media.
es: El instalador de FreeBSD no es una aplicación que pueda ejecutarse desde otro sistema operativo. En su lugar, descargue un archivo de instalación de FreeBSD, grábelo en el soporte correspondiente a su tipo y tamaño de archivo (CD, DVD o USB) e inicie el sistema para realizar la instalación desde el medio insertado.
ru: Установщик FreeBSD — это не приложение, которое можно запустить из другой операционной системы. Вместо этого скачайте файл установки FreeBSD, запишите его на носитель, соответствующий его типу и размеру (CD, DVD или USB), и загрузите систему для установки с этого носителя.

source: FreeBSD installation files are available at the link:https://www.FreeBSD.org/where/[FreeBSD download page]. Each installation file's name includes the release version of FreeBSD, the architecture, and the type of file.
es: Los archivos de instalación de FreeBSD están disponibles en la link:https://www.FreeBSD.org/where/[página de descargas de FreeBSD]. El nombre de cada archivo de instalación incluye la versión de FreeBSD, la arquitectura y el tipo de archivo.
ru: Файлы для установки FreeBSD доступны на link:https://www.FreeBSD.org/where/[странице скачивания FreeBSD]. Имя каждого файла установки включает версию выпуска FreeBSD, архитектуру и тип файла.

source: Installation files are available in several formats, compressed with man:xz[1] or uncompressed. The formats vary depending on computer architecture and media type.
es: Los archivos de instalación están disponibles en diversos formatos, ya sea comprimidos con man:xz[1] o sin comprimir. Los formatos varían en función de la arquitectura de la computadora y del tipo de soporte.
ru: Файлы для установки доступны в нескольких форматах, сжатые с помощью man:xz[1] или несжатые. Форматы различаются в зависимости от архитектуры компьютера и типа носителя.

source: Installation file types:
es: Tipos de archivos de instalación:
ru: Типы файлов установки:
