Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/partiv.po
Languages: es, fr_fr

source: Part IV. Network Communication
es: Parte IV. Comunicación en red
fr_fr: Partie IV. Communication de réseau

source: Network Communication
es: Red de comunicacion
fr_fr: Communication de réseau

source: FreeBSD is one of the most widely deployed operating systems for high performance network servers. The chapters in this part cover:
es: FreeBSD es uno de los sistemas operativos más extendidos para servidores de red de alto rendimiento. Los capítulos de esta parte cubren:
fr_fr: FreeBSD est un des systèmes d'exploitation les plus largement déployés pour les serveurs de réseau hautes performances. Les chapitres dans cette partie couvre:

source: Serial communication
es: Comunicación en serie
fr_fr: Communication série

source: `PPP` and `PPP` over Ethernet
es: `PPP` y `PPP` sobre Ethernet
fr_fr: `PPP` et `PPP` sur Ethernet

source: Electronic Mail
es: Correo electrónico
fr_fr: Courriel

source: Running Network Servers
es: Ejecución de servidores de red
fr_fr: Exécuter des serveurs réseau

source: Firewalls
es: Cortafuegos
fr_fr: Pare-feu

source: Other Advanced Networking Topics
es: Otros temas avanzados de redes
fr_fr: Autres sujets de réseautage avancés

source: These chapters are designed to be read when the information is needed. They do not need to be read in any particular order, nor is it necessary to read all of them before using FreeBSD in a network environment.
es: Estos capítulos están diseñados para ser leídos cuando la información sea necesaria. No es necesario leerlos en ningún orden en particular, ni es necesario leerlos todos antes de usar FreeBSD en un entorno de red.
fr_fr: Ces chapitres sont conçus pour être lus lorsque l'information est nécessaire. Ils n'ont pas besoin d'être lus dans un ordre particulier, ni de les lire tous avant d'utiliser FreeBSD dans un environnement réseau.
