Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/handbook/parti.po
Languages: es

source: Part I. Getting Started
es: Parte I. Comenzando

source: Getting Started
es: Primeros pasos

source: This part of the handbook is for users and administrators who are new to FreeBSD. These chapters:
es: Esta parte del manual es para usuarios y administradores que son nuevos en FreeBSD. Estos capítulos:

source: Introduce FreeBSD.
es: introducir FreeBSD.

source: Guide readers through the installation process.
es: Guíe a los lectores a través del proceso de instalación.

source: Teach UNIX(R) basics and fundamentals.
es: Enseñar las bases y los fundamentos de UNIX(R).

source: Show how to install the wealth of third party applications available for FreeBSD.
es: Muestre cómo instalar la gran cantidad de aplicaciones de terceros disponibles para FreeBSD.

source: Introduce X, the UNIX(R) windowing system, and detail how to configure a desktop environment that makes users more productive.
es: Presentamos X, el sistema de ventanas de UNIX(R), y detallamos cómo configurar un entorno de escritorio que haga a los usuarios más productivos.

source: Introduce Wayland, a new display server for UNIX(R).
es: Presentamos Wayland, un nuevo servidor de pantalla para UNIX(R).

source: The number of forward references in the text have been kept to a minimum so that this section can be read from front to back with minimal page flipping.
es: El número de referencias hacia adelante en el texto se ha mantenido al mínimo para que esta sección se pueda leer de adelante hacia atrás con un mínimo de cambio de página.
