Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/working-copy/_index.po
Languages: it_it

source: How to get a working copy of the FreeBSD Documentation Project
it_it: Come ottenere una workig copy del FreeBSD Documentation Project

source: Chapter 3. The Working Copy
it_it: Capitolo 3. La copia di lavoro

source: The Working Copy
it_it: La Copia di Lavoro

source: The _working copy_ is a copy of the FreeBSD repository documentation tree downloaded onto the local computer. Changes are made to the local working copy, tested, and then submitted as patches to be committed to the main repository.
it_it: La _copia di lavoro_ è una copia del repository della documentazione di FreeBSD scaricata sul computer locale. Le modifiche vengono effettuate e testate sulla copia di lavoro locale, dunque proposte come patch per il commit sul repository principale.

source: A full copy of the documentation tree can occupy 550 megabytes of disk space. Allow for a full gigabyte of space to have room for temporary files and test versions of various output formats.
it_it: Un'intera copia del repository della documentazione può occupare 550 megabyte di spazio su disco. Si preveda un intero gygabyte per avere lo spazio per file temporanei e testare versioni in vari formati di output.

source: Documentation and Manual Pages
it_it: Documentazione e Pagine di Manuale

source: FreeBSD documentation is not just books and articles. Manual pages for all the commands and configuration files are also part of the documentation, and part of the FDP's territory. Two repositories are involved: `doc` for the books and articles, and `src` for the operating system and manual pages. To edit manual pages, the `src` repository must be checked out separately.
it_it: La documentazione di FreeBSD non è fatta solo di libri e articoli. Anche le pagine di manuale di tutti i comandi e di tutti i file di configurazione fanno parte della documentazione, e parte del territorio del FDP. Sono rilevanti due repository: `doc` per i libri e gli articoli e `src` per il sistema operativo e le pagine di manuale. Per modificare le pagine di manuale, il repository `src` deve essere reperito separatamente.

source: Repositories may contain multiple versions of documentation and source code. New modifications are almost always made only to the latest version, called `main`.
it_it: I repository possono contenere molteplici versioni della documentazione e del codice sorgente. Le nuove modifiche sono quasi sempre apportate solo alla versione più recente, denominata `main`.

source: Choosing a Directory
it_it: Scegliere una Directory

source: FreeBSD documentation is traditionally stored in [.filename]#/usr/doc/#, and system source code with manual pages in [.filename]#/usr/src/#. These directory trees are relocatable, and users may want to put the working copies in other locations to avoid interfering with existing information in the main directories. The examples that follow use [.filename]#~/doc# and [.filename]#~/src#, both subdirectories of the user's home directory.
it_it: La documentazione di FreeBSD si trova tradizionalmente in [.filename]#/usr/doc/# e il codice sorgente con le pagine di manuale sono in [.filename]#/usr/src/#. Queste gerarchie di directory sono trasferibili e gli utenti potrebbero voler porre le loro copie di lavoro in altri percorsi per evitare di interferire con informazioni esistenti nelle directory principali. Gli esempi che seguono usano [.filename]#~/doc# e [.filename]#~/src#, entrambe sottodirectory della home dell'utente.

source: Checking Out a Copy
it_it: Reperire una Copia

source: A download of a working copy from the repository is called a _clone_, and done with `git clone`. This example clones a copy of the latest version (`main`) of the main documentation tree:
it_it: Si chiama _clone_ un download di una copia di lavoro a partire dal repository ed è effettuato con `git clone`. Questo esempio clona una copia dell'ultime versione (`main`) del repository principale della documentazione:

source: A checkout of the source code to work on manual pages is very similar:
it_it: Reperire il codice sorgente per lavorare sulle pagine di manuale funziona in maniera molto simile:

source: Updating a Working Copy
it_it: Aggiornare una Copia di Lavoro

source: The documents and files in the FreeBSD repository change daily. People modify files and commit changes frequently. Even a short time after an initial checkout, there will already be differences between the local working copy and the main FreeBSD repository. To update the local version with the changes that have been made to the main repository, use `git pull` on the directory containing the local working copy:
it_it: I documenti e i file nel repository di FreeBSD cambiano tutti i giorni. Le persone modificano file e effettuano i commit delle modifiche spesso. Anche poco tempo dopo un checkout iniziale, ci saranno già differenze tra la copia di lavoro locale e il repository principale di FreeBSD. Per aggiornare la versione locale con le modifiche che sono state apportate al repository principale, si usi `git pull` sulla directory che contiene la copia di lavoro locale:

source: Get in the protective habit of using `git pull` before editing document files. Someone else may have edited that file very recently, and the local working copy will not include the latest changes until it has been updated. Editing the newest version of a file is much easier than trying to combine an older, edited local file with the newer version from the repository.
it_it: Si raccomanda di assumere la prudente abitudine di eseguire `git pull` prima di modificare i file dei documenti. Qualcun altro potrebbe aver modificato lo stesso file di recente, e la copia di lavoro non conterrà le ultime modifiche finché non sarà aggiornata. Modificare la versione più recente di un file è molto più facile che cercare di combinare un vecchio file locale modificato con la versione più recente del repository.

source: Reverting Changes
it_it: Cancellare Modifiche

source: Sometimes it turns out that changes were not necessary after all, or the writer just wants to start over. Files can be "reset" to their unchanged form with `git restore`. For example, to erase the edits made to [.filename]#_index.adoc# and reset it to unmodified form:
it_it: A volte capita che le modifiche non fossero necessarie dopo tutto, o che l'autore voglia semplicemente ricominciare da capo. I file possono essere ripristinati nella loro forma originale con `git restore`. Per esempio, per cancellare le modifiche effettuate su [.filename]#_index.adoc# e riportarlo alla sua forma originale:

source: Making a Diff
it_it: Generare una Patch in Formato Diff

source: After edits to a file or group of files are completed, the differences between the local working copy and the version on the FreeBSD repository must be collected into a single file for submission. These _diff_ files are produced by redirecting the output of `git diff` into a file:
it_it: Dopo che le modifiche ad un file o ad un gruppo di file sono state completate, bisogna raccogliere le differenze tra la copia di lavoro locale e la versione sul repository di FreeBSD in un solo file per essere proposte al progetto FreeBSD. Questi file _diff_ sono generati ridirigendo l'output di `git diff` in un file:

source: Give the file a meaningful name that identifies the contents. The example above is for spelling fixes to the whole documentation tree.
it_it: Si assegni al file un nome significativo che ne identifichi il contenuto. L'esempio sopra è per correzioni ortografiche sull'intera gerarchia di directory della documentazione.

source: If the diff file is to be submitted with the web "link:https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi[Submit a FreeBSD problem report]" interface, add a [.filename]#.txt# extension to give the earnest and simple-minded web form a clue that the contents are plain text.
it_it: Se il file diff deve essere proposto sull'interfaccia web "link:https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi[Submit a FreeBSD problem report]", si aggiunga un'estensione [.filename]#.txt# per suggerire al form web un indizio riguardo al fatto che il contenuto sia testo semplice.

source: Be careful: `git diff` includes all changes made in the current directory and any subdirectories. If there are files in the working copy with edits that are not ready to be submitted yet, provide a list of only the files that are to be included:
it_it: Attenzione: `git diff` include tutti le modifiche effettuate nella directory corrente e in tutte le sottodirectory. Se ci sono file nella copia di lavoro con modifiche che non sono ancora pronte per essere inviate, si fornisca un elenco con tutti i file che devono essere inclusi:

source: Git References
it_it: Riferimenti su Git

source: These examples show very basic usage of Git. More detail is available in the https://git-scm.com/book/en/v2[Git Book] and the https://git-scm.com/doc[Git documentation].
it_it: Questi esempi mostrano un utilizzo molto basilare di Git. Maggiori dettagli sono disponibili nel https://git-scm.com/book/en/v2[Git Book] e nella https://git-scm.com/doc[Documentazione di Git].
