Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/keeping-up/_index.po
Languages: es

source: How to keep up the FreeBSD Ports Collection
es: Cómo mantener actualizada la colección de Ports de FreeBSD

source: Chapter 16. Keeping Up
es: Capítulo 16. Manteniéndose al día

source: Keeping Up
es: Mantenerse al día

source: The FreeBSD Ports Collection is constantly changing. Here is some information on how to keep up.
es: La colección de Ports de FreeBSD está en constante cambio. Aquí tienes información sobre cómo mantenerse al día.

source: One of the easiest ways to learn about updates that have already been committed is by subscribing to https://www.FreshPorts.org/[FreshPorts]. Multiple ports can be monitored. Maintainers are strongly encouraged to subscribe, because they will receive notification of not only their own changes, but also any changes that any other FreeBSD committer has made. (These are often necessary to keep up with changes in the underlying ports framework-although it would be most polite to receive an advance heads-up from those committing such changes, sometimes this is overlooked or impractical. Also, in some cases, the changes are very minor in nature. We expect everyone to use their best judgement in these cases.)
es: Una de las formas más fáciles de aprender sobre las actualizaciones que ya se han comprometido es suscribiéndose a https://www.FreshPorts.org/[FreshPorts]. Se pueden monitorear múltiples puertos. Se alienta encarecidamente a los mantenedores a suscribirse, porque recibirán notificaciones no solo de sus propios cambios, sino también de cualquier cambio que haya realizado cualquier otro comprometedor de FreeBSD. (A menudo, estos son necesarios para mantenerse al día con los cambios en el marco de puertos subyacente; aunque sería muy cortés recibir un aviso anticipado de aquellos que realizan tales cambios, a veces esto se pasa por alto o es poco práctico. Además, en algunos casos, los cambios son de naturaleza muy menor. Esperamos que todos usen su mejor juicio en estos casos.)

source: To use FreshPorts, an account is required. Those with registered email addresses at `@FreeBSD.org` will see the opt-in link on the right-hand side of the web pages. Those who already have a FreshPorts account but are not using a `@FreeBSD.org` email address can change the email to `@FreeBSD.org`, subscribe, then change it back again.
es: Para usar FreshPorts, se requiere una cuenta. Aquellos con direcciones de correo electrónico registradas en `@FreeBSD.org` verán el enlace de suscripción en el lado derecho de las páginas web. Aquellos que ya tienen una cuenta de FreshPorts pero no están usando un correo electrónico de `@FreeBSD.org` pueden cambiar el correo electrónico a `@FreeBSD.org`, suscribirse y luego cambiarlo de nuevo.

source: FreshPorts also has a sanity test feature which automatically tests each commit to the FreeBSD ports tree. If subscribed to this service, a committer will receive notifications of any errors which FreshPorts detects during sanity testing of their commits.
es: FreshPorts también tiene una función de prueba de coherencia que prueba automáticamente cada commit en el árbol de ports de FreeBSD. Si está suscrito a este servicio, un committer recibirá notificaciones de cualquier error que FreshPorts detecte durante las pruebas de coherencia de sus commits.

source: The Web Interface to the Source Repository
es: La interfaz web al repositorio de origen

source: It is possible to browse the files in the source repository by using a web interface. Changes that affect the entire port system are now documented in the https://cgit.FreeBSD.org/ports/tree/CHANGES[CHANGES] file. Changes that affect individual ports are now documented in the https://cgit.FreeBSD.org/ports/tree/UPDATING[UPDATING] file. However, the definitive answer to any question is undoubtedly to read the source code of https://cgit.FreeBSD.org/ports/tree/Mk/bsd.port.mk[bsd.port.mk], and associated files.
es: Es posible navegar por los archivos en el repositorio fuente utilizando una interfaz web. Los cambios que afectan a todo el sistema de puertos ahora están documentados en el archivo https://cgit.FreeBSD.org/ports/tree/CHANGES[CHANGES]. Los cambios que afectan a puertos individuales ahora están documentados en el archivo https://cgit.FreeBSD.org/ports/tree/UPDATING[UPDATING]. Sin embargo, la respuesta definitiva a cualquier pregunta es, sin duda, leer el código fuente de https://cgit.FreeBSD.org/ports/tree/Mk/bsd.port.mk[bsd.port.mk] y archivos asociados.

source: The FreeBSD Ports Mailing List
es: La lista de correo de puertos de FreeBSD

source: As a ports maintainer, consider subscribing to {freebsd-ports}. Important changes to the way ports work will be announced there, and then committed to [.filename]#CHANGES#.
es: Como mantenedor de puertos, considere suscribirse a {freebsd-ports}. Los cambios importantes en la forma en que funcionan los puertos se anunciarán allí y luego se comprometerán a [.filename]#CHANGES#.

source: If the volume of messages on this mailing list is too high, consider following {freebsd-ports-announce} which contains only announcements.
es: Si el volumen de mensajes en esta lista de correo es demasiado alto, considera seguir {freebsd-ports-announce}, que solo contiene anuncios.

source: The FreeBSD Port Building Cluster
es: El Clúster de Construcción Portuaria de FreeBSD

source: One of the least-publicized strengths of FreeBSD is that an entire cluster of machines is dedicated to continually building the Ports Collection, for each of the major OS releases and for each Tier-1 architecture.
es: Una de las fortalezas menos publicitadas de FreeBSD es que un grupo completo de máquinas está dedicado a construir continuamente la Colección de Ports, para cada una de las principales versiones de SO y para cada arquitectura de Nivel 1.

source: Individual ports are built unless they are specifically marked with `IGNORE`. Ports that are marked with `BROKEN` will still be attempted, to see if the underlying problem has been resolved. (This is done by passing `TRYBROKEN` to the port's [.filename]#Makefile#.)
es: Se construyen puertos individuales a menos que estén específicamente marcados con `IGNORE`. Los puertos marcados con `BROKEN` aún se intentarán, para verificar si el problema subyacente ha sido resuelto. (Esto se hace pasando `TRYBROKEN` al [.filename]#Makefile# del puerto.)

source: Portscout: the FreeBSD Ports Distfile Scanner
es: Portscout: el escáner de archivos Distfile de puertos de FreeBSD

source: The build cluster is dedicated to building the latest release of each port with distfiles that have already been fetched. However, as the Internet continually changes, distfiles can quickly go missing. https://portscout.FreeBSD.org/[Portscout], the FreeBSD Ports distfile scanner, attempts to query every download site for every port to find out if each distfile is still available. Portscout can generate HTML reports and send emails about newly available ports to those who request them. Unless not otherwise subscribed, maintainers are asked to check periodically for changes, either by hand or using the RSS feed.
es: El clúster de construcción está dedicado a construir la última versión de cada puerto con archivos de distribución que ya han sido descargados. Sin embargo, dado que Internet cambia continuamente, los archivos de distribución pueden desaparecer rápidamente. https://portscout.FreeBSD.org/[Portscout], el escáner de archivos de distribución de FreeBSD Ports, intenta consultar cada sitio de descarga para cada puerto para averiguar si cada archivo de distribución sigue disponible. Portscout puede generar informes en HTML y enviar correos electrónicos sobre puertos nuevos disponibles a quienes los soliciten. A menos que no estén suscritos de otra manera, se les pide a los mantenedores que verifiquen periódicamente si hay cambios, ya sea manualmente o utilizando el feed RSS.

source: Portscout's first page gives the email address of the port maintainer, the number of ports the maintainer is responsible for, the number of those ports with new distfiles, and the percentage of those ports that are out-of-date. The search function allows for searching by email address for a specific maintainer, and for selecting whether only out-of-date ports are shown.
es: La primera página de Portscout proporciona la dirección de correo electrónico del mantenedor del puerto, el número de puertos de los que es responsable, el número de esos puertos con nuevos distfiles y el porcentaje de esos puertos que están desactualizados. La función de búsqueda permite buscar por dirección de correo electrónico a un mantenedor específico y seleccionar si solo se muestran los puertos desactualizados.

source: Upon clicking on a maintainer's email address, a list of all of their ports is displayed, along with port category, current version number, whether or not there is a new version, when the port was last updated, and finally when it was last checked. A search function on this page allows the user to search for a specific port.
es: Al hacer clic en la dirección de correo electrónico de un mantenedor, se muestra una lista de todos sus puertos, junto con la categoría del puerto, el número de la versión actual, si hay o no una nueva versión, cuándo se actualizó el puerto por última vez y, finalmente, cuándo se verificó por última vez. Una función de búsqueda en esta página permite al usuario buscar un puerto específico.

source: Clicking on a port name in the list displays the https://freshports.org/[FreshPorts] port information.
es: Hacer clic en un nombre de puerto en la lista muestra la información del puerto en https://freshports.org/[FreshPorts].

source: Additional documentation is available in the https://github.com/freebsd/portscout/[Portscout repository].
es: Documentación adicional está disponible en el https://github.com/freebsd/portscout/[repositorio de Portscout].
