Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/mailing-list-faq/_index.po
Languages: pl

source: Literally, a `bikeshed` is a small outdoor shelter into which one may store one's two-wheeled form of transportation. However, in FreeBSD parlance, the term refers to topics that are simple enough that (nearly) anyone can offer an opinion about, and often (nearly) everyone does. The genesis of this term is explained in more detail extref:{faq}[in this document, bikeshed-painting]. You simply must have a working knowledge of this concept before posting to any FreeBSD mailing list.
pl: Dosłownie, `bikeshed` jest małym schronieniem na zewnątrz, w którym można przechowywać swój dwukołowy środek transportu. Jednakże, w języku FreeBSD, termin ten odnosi się do tematów, które są na tyle proste, że (prawie) każdy może wyrazić swoją opinię na ich temat, i często (prawie) każdy to robi. Geneza tego terminu jest wyjaśniona bardziej szczegółowo extref:{faq}[w tym dokumencie, bikeshed-painting]. Po prostu musisz mieć wiedzę na temat tego pojęcia zanim zaczniesz pisać na jakiejkolwiek liście dyskusyjnej FreeBSD.

source: Please help us to keep the mailing lists as useful for as many people as possible by avoiding bikesheds whenever you can. Thanks.
pl: Proszę, pomóż nam utrzymać listy dyskusyjne tak użyteczne dla jak największej liczby osób, unikając bikeshedów, kiedy tylko możesz. Dzięki.

source: Acknowledgments
pl: Podziękowania

source: Original author of most of the material on mailing list etiquette, taken from the article on extref:{freebsd-questions-article}[How to get best results from the FreeBSD-questions mailing list].
pl: Autor większości materiałów dotyczących etykiety list dyskusyjnych, zaczerpniętych z artykułu na extref:{freebsd-questions-article}[Jak uzyskać najlepsze rezultaty z listy dyskusyjnej FreeBSD-questions].

source: Creation of the rough draft of this FAQ.
pl: Stworzenie wstępnej wersji tego FAQ.
