Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/articles/mailing-list-faq/_index.po
Languages: pl

source: How to best use the mailing lists, such as how to help avoid frequently-repeated discussions
pl: Jak najlepiej korzystać z list dyskusyjnych, np. jak uniknąć często powtarzających się dyskusji

source: Frequently Asked Questions About The FreeBSD Mailing Lists
pl: Najczęściej zadawane pytania dotyczące list dyskusyjnych FreeBSD

source: Abstract
pl: Streszczenie

source: This is the FAQ for the FreeBSD mailing lists. If you are interested in helping with this project, send email to the {freebsd-doc}. The latest version of this document is always available from the link:.[FreeBSD World Wide Web server]. It may also be downloaded as one large link:.[HTML] file with HTTP or as plain text, PostScript, PDF, etc. from the https://download.freebsd.org/doc/[FreeBSD FTP server]. You may also want to link:https://www.FreeBSD.org/search/[Search the FAQ].
pl: To jest FAQ dla list dyskusyjnych FreeBSD. Jeśli jesteś zainteresowany pomocą w tym projekcie, wyślij e-mail na adres {freebsd-doc}. Najnowsza wersja tego dokumentu jest zawsze dostępna z linku:.[serwer FreeBSD WWW]. Można go również pobrać jako jeden duży plik link:.[HTML] za pomocą HTTP lub jako zwykły tekst, PostScript, PDF, itp. z https://download.freebsd.org/doc/[serwer FTP FreeBSD]. Możesz również skorzystać z linku:https://www.FreeBSD.org/search/[Wyszukaj w FAQ].

source: Introduction
pl: Wprowadzenie

source: As is usual with FAQs, this document aims to cover the most frequently asked questions concerning the FreeBSD mailing lists (and of course answer them!). Although originally intended to reduce bandwidth and avoid the same old questions being asked over and over again, FAQs have become recognized as valuable information resources.
pl: Jak to zwykle bywa z FAQ, ten dokument ma na celu odpowiedzieć na najczęściej zadawane pytania dotyczące list dyskusyjnych FreeBSD. Chociaż pierwotnie miały na celu zredukowanie ilości zapytań i uniknięcie zadawania w kółko tych samych starych pytań, FAQ stały się uznawane za cenne źródło informacji.

source: This document attempts to represent a community consensus, and as such it can never really be __authoritative__. However, if you find technical errors within this document, or have suggestions about items that should be added, please either submit a PR, or email the {freebsd-doc}. Thanks.
pl: Ten dokument próbuje reprezentować konsensus społeczności i jako taki nigdy nie może być naprawdę __autorytatywny__. Jeśli jednak znajdziesz błędy techniczne w tym dokumencie lub masz sugestie dotyczące elementów, które powinny zostać dodane, prosimy o przesłanie PR lub wysłanie e-maila do {freebsd-doc}. Dzięki.

source: What is the purpose of the FreeBSD mailing lists?
pl: Jaki jest cel list dyskusyjnych FreeBSD?

source: The FreeBSD mailing lists serve as the primary communication channels for the FreeBSD community, covering many different topic areas and communities of interest.
pl: Listy dyskusyjne FreeBSD służą jako podstawowe kanały komunikacyjne dla społeczności FreeBSD, obejmując wiele różnych obszarów tematycznych i wspólnot interesów.

source: Who is the audience for the FreeBSD mailing lists?
pl: Kto jest odbiorcą list dyskusyjnych FreeBSD?

source: This depends on charter of each individual list. Some lists are more oriented to developers; some are more oriented towards the FreeBSD community as a whole. Please see link:https://lists.FreeBSD.org/[this list] for the current summary.
pl: To zależy od charteru każdej z list. Niektóre listy są bardziej zorientowane na deweloperów; niektóre są bardziej zorientowane na społeczność FreeBSD jako całość. Proszę zobaczyć link:https://lists.FreeBSD.org/[ta lista] aby zobaczyć aktualne podsumowanie.

source: Are the FreeBSD mailing lists open for anyone to participate?
pl: Czy listy dyskusyjne FreeBSD są otwarte dla każdego?

source: Again, this depends on charter of each individual list. Please read the charter of a mailing list before you post to it, and respect it when you post. This will help everyone to have a better experience with the lists.
pl: Ponownie, zależy to od statutu każdej z list. Prosimy o przeczytanie statutu listy dyskusyjnej przed wysłaniem na nią wiadomości i respektowanie go podczas wysyłania wiadomości. To pomoże wszystkim mieć lepsze doświadczenia z listami.

source: If after reading the above lists, you still do not know which mailing list to post a question to, you will probably want to post to freebsd-questions (but see below, first).
pl: Jeśli po przeczytaniu powyższych list nadal nie wiesz, do której listy mailingowej wysłać pytanie, prawdopodobnie będziesz chciał wysłać je do freebsd-questions (ale najpierw zobacz poniżej).

source: How can I subscribe?
pl: Jak mogę się zapisać na listę?

source: You can use link:https://lists.FreeBSD.org/[the Mlmmj web interface] to subscribe to any of the public lists.
pl: Możesz użyć link:https://lists.FreeBSD.org/[interfejs internetowy Mlmmj] aby zapisać się na którąkolwiek z publicznych list.

source: How can I unsubscribe?
pl: Jak mogę zrezygnować z subskrypcji?

source: You can use the same interface as above; or, you can follow the instructions that are at the bottom of every mailing list message that is sent.
pl: Możesz użyć tego samego interfejsu co powyżej; lub, możesz postępować zgodnie z instrukcjami, które znajdują się na dole każdej wysłanej wiadomości z listy dyskusyjnej.

source: Please do not send unsubscribe messages directly to the public lists themselves. First, this will not accomplish your goal, and second, it will irritate the existing subscribers, and you will probably get flamed. This is a classical mistake when using mailing lists; please try to avoid it.
pl: Proszę nie wysyłać wiadomości o rezygnacji z subskrypcji bezpośrednio na listy publiczne. Po pierwsze, nie osiągniesz w ten sposób swojego celu, a po drugie, zirytujesz istniejących subskrybentów i prawdopodobnie zostaniesz zrugany. Jest to klasyczny błąd przy używaniu list dyskusyjnych; postaraj się go unikać.

source: Are archives available?
pl: Czy są dostępne archiwa?

source: Are mailing lists available in a digest format?
pl: Czy listy mailingowe są dostępne w formacie digest?

source: Yes. See link:https://lists.FreeBSD.org/[the Mlmmj web interface].
pl: Tak. Zobacz link:https://lists.FreeBSD.org/[interfejs internetowy Mlmmj].

source: Mailing List Etiquette
pl: Etykieta listy dyskusyjnej

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Please make only appropriate postings, and follow common rules of etiquette.
pl: Uczestnictwo w listach dyskusyjnych, podobnie jak uczestnictwo w każdej społeczności, wymaga wspólnej podstawy komunikacji. Prosimy o umieszczanie tylko odpowiednich postów i przestrzeganie powszechnie obowiązujących zasad etykiety.

source: What should I do before I post?
pl: Co powinienem zrobić przed wysłaniem posta?

source: You have already taken the most important step by reading this document. However, if you are new to FreeBSD, you may first need to familiarize yourself with the software, and all the social history around it, by reading the numerous link:https://www.FreeBSD.org/docs/books/[books and articles] that are available. Items of particular interest include the extref:{faq}[FreeBSD Frequently Asked Questions (FAQ)] document, the extref:{handbook}[FreeBSD Handbook], and the articles extref:{freebsd-questions-article}[How to get best results from the FreeBSD-questions mailing list], extref:{explaining-bsd}[Explaining BSD], and extref:{new-users}[FreeBSD First Steps].
pl: Czytając ten dokument wykonałeś już najważniejszy krok. Jednakże, jeśli jesteś nowym użytkownikiem FreeBSD, możesz najpierw zapoznać się z oprogramowaniem i całą historią społeczną wokół niego, czytając liczne link:https://www.FreeBSD.org/docs/books/[książki i artykuły], które są dostępne. Szczególnie interesujące pozycje to extref:{faq}[FreeBSD najczęściej zadawane pytania (FAQ)], extref:{handbook}[Podręcznik FreeBSD], oraz artykuły extref:{freebsd-questions-article}[Jak uzyskać najlepsze rezultaty z listy dyskusyjnej FreeBSD-questions], extref:{explaining-bsd}[Explaining BSD], oraz extref:{new-users}[Pierwsze kroki w FreeBSD].

source: It is always considered bad form to ask a question that is already answered in the above documents. This is not because the volunteers who work on this project are particularly mean people, but after a certain number of times answering the same questions over and over again, frustration begins to set in. This is particularly true if there is an existing answer to the question that is already available. Always keep in mind that almost all of the work done on FreeBSD is done by volunteers, and that we are only human.
pl: Zadawanie pytań, na które już udzielono odpowiedzi w powyższych dokumentach, jest zawsze uważane za złą formę. Nie jest to spowodowane tym, że wolontariusze pracujący nad tym projektem są szczególnie złośliwi, ale po pewnym czasie odpowiadania na te same pytania w kółko, pojawia się frustracja. Jest to szczególnie prawdziwe, jeśli istnieje już istniejąca odpowiedź na to pytanie, która jest już dostępna. Zawsze pamiętaj, że prawie cała praca nad FreeBSD jest wykonywana przez wolontariuszy i że jesteśmy tylko ludźmi.

source: What constitutes an inappropriate posting?
pl: Jakie są cechy nieodpowiedniego postu?

source: Postings must be in accordance with the charter of the mailing list.
pl: Posty muszą być zgodne ze statutem listy dyskusyjnej.

source: Personal attacks are discouraged. As good net-citizens, we should try to hold ourselves to high standards of behavior.
pl: Ataki osobiste są odradzane. Jako dobrzy obywatele sieci, powinniśmy starać się trzymać wysokich standardów zachowania.

source: Spam is not allowed, ever. The mailing lists are actively processed to ban offenders to this rule.
pl: Spam nie jest dozwolony, nigdy. Listy dyskusyjne są aktywnie przetwarzane, aby zakazać naruszania tej zasady.

source: What is considered proper etiquette when posting to the mailing lists?
pl: Co jest uważane za właściwą etykietę podczas wysyłania postów na listy dyskusyjne?

source: Please wrap lines at 75 characters, since not everyone uses fancy GUI mail reading programs.
pl: Proszę zawijać linie do 75 znaków, ponieważ nie każdy używa wymyślnych programów do czytania poczty z GUI.

source: Please respect the fact that bandwidth is not infinite. Not everyone reads email through high-speed connections, so if your posting involves something like the content of [.filename]#config.log# or an extensive stack trace, please consider putting that information up on a website somewhere and just provide a URL to it. Remember, too, that these postings will be archived indefinitely, so huge postings will simply inflate the size of the archives long after their purpose has expired.
pl: Proszę uszanować fakt, że przepustowość nie jest nieskończona. Nie każdy czyta pocztę przez szybkie łącza, więc jeśli twój post zawiera coś takiego jak zawartość [.filename]#config.log# lub obszerny ślad stosu, rozważ umieszczenie tych informacji gdzieś na stronie internetowej i po prostu podaj adres URL do nich. Pamiętaj też, że te posty będą archiwizowane w nieskończoność, więc wielkie posty po prostu nadmuchają rozmiar archiwów długo po tym, jak ich cel został osiągnięty.

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. Do not underestimate the effect that a poorly formatted mail message has, and not just on the FreeBSD mailing lists. Your mail message is all that people see of you, and if it is poorly formatted, badly spelled, full of errors, and/or has lots of exclamation points, it will give people a poor impression of you.
pl: Sformatuj swoją wiadomość tak, aby była ona czytelna i PROSZĘ NIE WYKRZYKIWAĆ!!!!!. Nie lekceważ efektu, jaki wywołuje źle sformatowana wiadomość i to nie tylko na listach dyskusyjnych FreeBSD. Twoja wiadomość jest wszystkim, co ludzie widzą o Tobie i jeśli jest źle sformatowana, źle napisana, pełna błędów, i/lub ma dużo wykrzykników da ludziom złe wrażenie o Tobie.

source: Please use an appropriate human language for a particular mailing list. Many non-English mailing lists are link:https://www.FreeBSD.org/community/mailinglists/[available].
pl: Proszę używać odpowiedniego języka ludzkiego dla danej listy dyskusyjnej. Wiele nieangielskich list dyskusyjnych są link:https://www.FreeBSD.org/community/mailinglists/[tu dostępe].

source: For the ones that are not, we do appreciate that many people do not speak English as their first language, and we try to make allowances for that. It is considered particularly poor form to criticize non-native speakers for spelling or grammatical errors. FreeBSD has an excellent track record in this regard; please, help us to uphold that tradition.
pl: Dla tych, którzy nie są, doceniamy to, że wiele osób nie mówi po angielsku jako swoim pierwszym języku i staramy się to uwzględnić. Krytykowanie osób, dla których angielski nie jest językiem ojczystym, za błędy ortograficzne lub gramatyczne jest uważane za szczególnie złą formę. FreeBSD ma doskonałe osiągnięcia w tym zakresie; prosimy, pomóżcie nam podtrzymać tę tradycję.

source: Please use a standards-compliant Mail User Agent (MUA). A lot of badly formatted messages come from http://www.lemis.com/grog/email/email.php[bad mailers or badly configured mailers]. The following mailers are known to send out badly formatted messages without you finding out about them:
pl: Proszę używać zgodnego ze standardami Mail User Agent (MUA). Wiele źle sformatowanych wiadomości pochodzi z http://www.lemis.com/grog/email/email.php[złych mailerów lub źle skonfigurowanych mailerów]. Następujące programy pocztowe są znane z tego, że wysyłają źle sformatowane wiadomości, a Ty możesz o nich nie wiedzieć:

source: Try not to use MIME: a lot of people use mailers which do not get on very well with MIME.
pl: Spróbuj nie używać MIME: wiele osób używa mailerów, które nie radzą sobie zbyt dobrze z MIME.

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people on these mailing lists get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume that they missed it and not bother to look.
pl: Upewnij się, że twój czas i strefa czasowa są ustawione poprawnie. Może się to wydawać trochę głupie, ponieważ twoja wiadomość i tak tam dotrze, ale wiele osób z tych list dostaje kilkaset wiadomości dziennie. Często sortują przychodzące wiadomości według tematu i daty, a jeśli twoja wiadomość nie pojawi się przed pierwszą odpowiedzią, mogą założyć, że ją przegapili i nie zawracać sobie głowy szukaniem.

source: A lot of the information you need to supply is the output of programs, such as man:dmesg[8], or console messages, which usually appear in [.filename]#/var/log/messages#. Do not try to copy this information by typing it in again; not only it is a real pain, but you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like `dmesg`, redirect the output to a file and include that. For example,
pl: Wiele informacji, które musisz dostarczyć, to wyjście programów, takich jak man:dmesg[8], lub komunikaty konsoli, które zwykle pojawiają się w [.filename]#/var/log/messages#. Nie próbuj kopiować tych informacji, wpisując je ponownie; nie tylko jest to naprawdę bolesne, ale na pewno popełnisz błąd. Aby wysłać zawartość pliku logu, albo zrób kopię pliku i użyj edytora do przycięcia informacji do tego, co jest istotne, albo wytnij i wklej do swojej wiadomości. Dla wyjścia programów takich jak `dmesg`, przekieruj wyjście do pliku i dołącz go. Na przykład,

source: This redirects the information to the file [.filename]#/tmp/dmesg.out#.
pl: To przekierowuje informacje do pliku [.filename]#/tmp/dmesg.out#.

source: When using cut-and-paste, please be aware that some such operations badly mangle their messages. This is of particular concern when posting contents of [.filename]#Makefiles#, where `tab` is a significant character. This is a very common, and very annoying, problem with submissions to the link:https://www.FreeBSD.org/support/[Problem Reports database]. [.filename]#Makefiles# with tabs changed to either spaces, or the annoying `=3B` escape sequence, create a great deal of aggravation for committers.
pl: Używając wytnij-wklej, należy pamiętać, że niektóre takie operacje źle maglują swoje wiadomości. Jest to szczególnie ważne przy wysyłaniu zawartości [.filename]#Makefiles#, gdzie `tab` jest znaczącym znakiem. Jest to bardzo częsty, i bardzo irytujący, problem ze zgłoszeniami na link:https://www.FreeBSD.org/support/[Baza Zgłoszeń Problemów]. [.filename]#Makefiles# z tabulatorami zamienionymi na spacje, lub irytującą sekwencję ucieczki `=3B`, stwarzają wiele problemów dla commiterów.

source: What are the special etiquette consideration when replying to an existing posting on the mailing lists?
pl: Jakie są szczególne zasady etykiety przy odpowiadaniu na istniejące posty na listach dyskusyjnych?

source: Please include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
pl: Proszę zamieścić odpowiedni tekst z oryginalnej wiadomości. Ogranicz go do minimum, ale nie przesadzaj. Ktoś, kto nie czytał oryginalnej wiadomości, powinien być w stanie zrozumieć, o czym mówisz.

source: This is especially important for postings of the type "yes, I see this too", where the initial posting was dozens or hundreds of lines.
pl: Jest to szczególnie ważne w przypadku postów typu "tak, ja też to widzę", gdzie początkowy post miał dziesiątki lub setki linijek.

source: Use some technique to identify which text came from the original message, and which text you add. A common convention is to prepend "`>`" to the original message. Leaving white space after the "`>`" and leaving empty lines between your text and the original text both make the result more readable.
pl: Użyj jakiejś techniki, aby zidentyfikować, który tekst pochodzi z oryginalnej wiadomości, a który dodajesz. Powszechną konwencją jest dodawanie "`>`" przed oryginalną wiadomością. Pozostawienie białych znaków po "`>`" i pozostawienie pustych linii pomiędzy twoim tekstem a oryginalnym tekstem sprawia, że wynik jest bardziej czytelny.

source: Please ensure that the attributions of the text you are quoting is correct. People can become offended if you attribute words to them that they themselves did not write.
pl: Upewnij się, że atrybuty tekstu, który cytujesz są poprawne. Ludzie mogą się obrazić, jeśli przypisujesz im słowa, których sami nie napisali.

source: Please do not `top post`. By this, we mean that if you are replying to a message, please put your replies after the text that you copy in your reply.
pl: Prosimy o nie umieszczanie `top post`. Rozumiemy przez to, że jeśli odpowiadasz na wiadomość, proszę umieść swoje odpowiedzi po tekście, który kopiujesz w swojej odpowiedzi.

source: A: Because it reverses the logical flow of conversation.
pl: O: Ponieważ odwraca logiczny tok rozmowy.

source: Q: Why is top posting frowned upon?
pl: P: Dlaczego top posting jest niemile widziany?

source: (Thanks to Randy Bush for the joke.)
pl: (Dzięki Randy Bush za żart).

source: Recurring Topics On The Mailing Lists
pl: Powtarzające się tematy na listach dyskusyjnych

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Many of the mailing lists presuppose a knowledge of the Project's history. In particular, there are certain topics that seem to regularly occur to newcomers to the community. It is the responsibility of each poster to ensure that their postings do not fall into one of these categories. By doing so, you will help the mailing lists to stay on-topic, and probably save yourself being flamed in the process.
pl: Uczestnictwo w listach dyskusyjnych, podobnie jak uczestnictwo w każdej społeczności, wymaga podstawowej wiedzy o komunikacji. Wiele z list dyskusyjnych zakłada znajomość historii projektu. W szczególności, istnieją pewne tematy, które wydają się regularnie pojawiać u nowych członków społeczności. Obowiązkiem każdego piszącego jest upewnienie się, że jego posty nie należą do jednej z tych kategorii. W ten sposób pomożesz listom dyskusyjnym pozostać przy temacie i prawdopodobnie uchronisz się przed obelgami.

source: The best method to avoid this is to familiarize yourself with the http://docs.FreeBSD.org/mail/[mailing list archives], to help yourself understand the background of what has gone before. In this, the https://www.FreeBSD.org/search/#mailinglists[mailing list search interface] is invaluable. (If that method does not yield useful results, please supplement it with a search with your favorite major search engine).
pl: Najlepszą metodą uniknięcia tego jest zapoznanie się z http://docs.FreeBSD.org/mail/[archiwami list dyskusyjnych], aby pomóc sobie zrozumieć tło tego, co było wcześniej. W tym celu nieoceniony jest https://www.FreeBSD.org/search/#mailinglists[interfejs wyszukiwania list dyskusyjnych]. (Jeśli ta metoda nie przyniesie użytecznych rezultatów, proszę uzupełnić ją o wyszukiwanie w swojej ulubionej, głównej wyszukiwarce).

source: By familiarizing yourself with the archives, not only will you learn what topics have been discussed before, but also how discussion tends to proceed on that list, who the participants are, and who the target audience is. These are always good things to know before you post to any mailing list, not just a FreeBSD mailing list.
pl: Zapoznając się z archiwami, nie tylko dowiesz się, jakie tematy były już wcześniej omawiane, ale także jak przebiega dyskusja na tej liście, kim są uczestnicy i kim jest docelowa grupa odbiorców. To są zawsze dobre informacje, które warto znać przed wysłaniem wiadomości na jakąkolwiek listę dyskusyjną, nie tylko na listę FreeBSD.

source: There is no doubt that the archives are quite extensive, and some questions recur more often than others, sometimes as followups where the subject line no longer accurately reflects the new content. Nevertheless, the burden is on you, the poster, to do your homework to help avoid these recurring topics.
pl: Nie ma wątpliwości, że archiwa są dość obszerne, a niektóre pytania powtarzają się częściej niż inne, czasami jako kontynuacje, gdzie temat nie odzwierciedla już dokładnie nowej treści. Niemniej jednak, ciężar spoczywa na Tobie, użytkowniku, abyś odrobił swoją pracę domową i pomógł uniknąć tych powracających tematów.

source: What Is A "Bikeshed"?
pl: Co to jest "Bikeshed"?
