Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/translations/_index.po
Languages: es

source: FAQ about the translation process in the FreeBSD Documentation Project
es: Preguntas frecuentes sobre el proceso de traducción en el Proyecto de Documentación de FreeBSD

source: Chapter 8. Translations
es: Capítulo 8. Traducciones

source: Translations
es: Traducciones

source: This is the FAQ for people translating the FreeBSD documentation (FAQ, Handbook, tutorials, manual pages, and others) to different languages.
es: Este es el apartado de preguntas frecuentes para la gente que traduce la documentación de FreeBSD (FAQ, Manual, tutoriales, páginas de manual y otros) a diferentes idiomas.

source: It is _very_ heavily based on the translation FAQ from the FreeBSD German Documentation Project, originally written by Frank Gründer mailto:elwood@mc5sys.in-berlin.de[elwood@mc5sys.in-berlin.de] and translated back to English by Bernd Warken mailto:bwarken@mayn.de[bwarken@mayn.de].
es: Está _muy_ basado en la traducción de Preguntas Frecuentes del Proyecto de Documentación Alemán de FreeBSD, escrito originalmente por Frank Gründer mailto:elwood@mc5sys.in-berlin.de[elwood@mc5sys.in-berlin.de] y traducido al inglés por Bernd Warken mailto:bwarken@mayn.de[bwarken@mayn.de].

source: What do i18n and l10n mean?
es: ¿Qué significan i18n y l10n?

source: i18n means internationalization and l10n means localization. They are just a convenient shorthand.
es: i18n significa internacionalización y l10n significa localización. Son sólo una abreviatura conveniente.

source: i18n can be read as "i" followed by 18 letters, followed by "n". Similarly, l10n is "l" followed by 10 letters, followed by "n".
es: i18n puede leerse como "i" seguida de 18 letras, seguida de "n". Del mismo modo, l10n es "l" seguida de 10 letras, seguida de "n".

source: Is there a mailing list for translators?
es: ¿Existe una lista de correo para traductores?

source: Yes. Different translation groups have their own mailing lists. The https://www.freebsd.org/docproj/translations[list of translation projects] has more information about the mailing lists and web sites run by each translation project. In addition there is mailto:freebsd-translators@freebsd.org[freebsd-translators@freebsd.org] for general translation discussion.
es: Sí. Los distintos grupos de traducción tienen sus propias listas de correo. En https://www.freebsd.org/docproj/translations[lista de proyectos de traducción] hay más información sobre las listas de correo y los sitios web gestionados por cada proyecto de traducción. Además, existe mailto:freebsd-translators@freebsd.org[freebsd-translators@freebsd.org] para discusiones generales sobre traducción.

source: Are more translators needed?
es: ¿Se necesitan más traductores?

source: Yes. The more people that work on translation the faster it gets done, and the faster changes to the English documentation are mirrored in the translated documents.
es: Sí. Cuantas más personas trabajen en la traducción, más rápido se hará y más rápido se reflejarán los cambios en la documentación en inglés en los documentos traducidos.

source: You do not have to be a professional translator to be able to help.
es: No hace falta ser traductor profesional para poder ayudar.

source: What languages do I need to know?
es: ¿Qué idiomas necesito saber?

source: Ideally, you will have a good knowledge of written English, and obviously you will need to be fluent in the language you are translating to.
es: Lo ideal es tener buenos conocimientos de inglés escrito y, obviamente, dominar el idioma al que se traduce.

source: English is not strictly necessary. For example, you could do a Hungarian translation of the FAQ from the Spanish translation.
es: El inglés no es estrictamente necesario. Por ejemplo, podría hacer una traducción al húngaro de las Preguntas frecuentes a partir de la traducción al español.

source: What software do I need to know?
es: ¿Qué programas necesito saber?

source: It is strongly recommended that you maintain a local copy of the FreeBSD Git repository (at least the documentation part). This can be done by running:
es: Se recomienda encarecidamente que mantenga una copia local del repositorio Git de FreeBSD (al menos de la parte de documentación). Esto puede hacerse ejecutando:

source: https://git.FreeBSD.org/[git.FreeBSD.org] is a public `git` server.
es: https://git.FreeBSD.org/[git.FreeBSD.org] es un servidor `git` público.

source: This will require the package:git-lite[] package to be installed.
es: Esto requerirá que el paquete package:git-lite[] esté instalado.

source: You should be comfortable using git. This will allow you to see what has changed between different versions of the files that make up the documentation.
es: Deberías sentirte cómodo utilizando git. Esto le permitirá ver lo que ha cambiado entre las diferentes versiones de los archivos que componen la documentación.

source: For example, to view the differences between revisions `abff932fe8` and `2191c44469` of [.filename]#documentation/content/en/articles/committers-guide/_index.adoc#, run:
es: Por ejemplo, para ver las diferencias entre las revisiones `abff932fe8` y `2191c44469` de [.filename]#documentation/content/en/articles/committers-guide/_index.adoc#, ejecute:

source: % git diff abff932fe8 2191c44469 documentation/content/en/articles/committers-guide/_index.adoc
es: % git diff abff932fe8 2191c44469 documentation/content/es/articles/committers-guide/_index.adoc

source: Please see the complete explanation of using Git in FreeBSD in the extref:{handbook}mirrors[FreeBSD Handbook, git].
es: Consulte la explicación completa del uso de Git en FreeBSD en el extref:{handbook}mirrors[FreeBSD Handbook, git].

source: How do I find out who else might be translating to the same language?
es: ¿Cómo puedo saber quién más traduce al mismo idioma?

source: The https://www.FreeBSD.org/docproj/translations/[Documentation Project translations page] lists the translation efforts that are currently known about. If others are already working on translating documentation to your language, please do not duplicate their efforts. Instead, contact them to see how you can help.
es: En https://www.FreeBSD.org/docproj/translations/[Página de traducciones del Proyecto de Documentación] se enumeran los esfuerzos de traducción que se conocen actualmente. Si ya hay otras personas trabajando en la traducción de la documentación a su idioma, no duplique sus esfuerzos. Póngase en contacto con ellos para ver cómo puede ayudar.

source: If no one is listed on that page as translating for your language, then send a message to the {freebsd-doc} in case someone else is thinking of doing a translation, but has not announced it yet.
es: Si nadie aparece en esa página como traductor para su idioma, envíe un mensaje al {freebsd-doc} por si alguien está pensando en hacer una traducción, pero aún no lo ha anunciado.

source: No one else is translating to my language. What do I do?
es: Nadie traduce a mi idioma. ¿Qué puedo hacer?

source: Congratulations, you have just started the "FreeBSD _your-language-here_ Documentation Translation Project". Welcome aboard.
es: Enhorabuena, acaba de iniciar el "Proyecto de traducción de documentación de FreeBSD _su-idioma-aquí_". Bienvenido a bordo.

source: First, decide whether or not you have got the time to spare. Since you are the only person working on your language at the moment it is going to be your responsibility to publicize your work and coordinate any volunteers that might want to help you.
es: En primer lugar, decide si tienes tiempo o no. Puesto que usted es la única persona que trabaja en su lengua por el momento, será su responsabilidad dar a conocer su trabajo y coordinar a los voluntarios que quieran ayudarle.

source: Write an email to the Documentation Project mailing list, announcing that you are going to translate the documentation, so the Documentation Project translations page can be maintained.
es: Escriba un correo electrónico a la lista de correo del Proyecto de Documentación, anunciando que va a traducir la documentación, para que se pueda mantener la página de traducciones del Proyecto de Documentación.

source: If there is already someone in your country providing FreeBSD mirroring services you should contact them and ask if you can have some webspace for your project, and possibly an email address or mailing list services.
es: Si ya hay alguien en su país que proporcione servicios de mirroring de FreeBSD debería ponerse en contacto con ellos y preguntarles si puede tener algo de espacio web para su proyecto, y posiblemente una dirección de correo electrónico o servicios de listas de correo.

source: Then pick a document and start translating. It is best to start with something fairly small - either the FAQ, or one of the tutorials.
es: A continuación, elija un documento y empiece a traducirlo. Lo mejor es empezar con algo bastante pequeño: las Preguntas frecuentes o uno de los tutoriales.

source: I have translated some documentation, where do I send it?
es: He traducido documentación, ¿dónde la envío?

source: That depends. If you are already working with a translation team (such as the Japanese team, or the German team) then they will have their own procedures for handling submitted documentation, and these will be outlined on their web pages.
es: Depende. Si ya está trabajando con un equipo de traducción (como el equipo japonés o el alemán), ellos tendrán sus propios procedimientos para gestionar la documentación enviada, y estarán descritos en sus páginas web.

source: If you are the only person working on a particular language (or you are responsible for a translation project and want to submit your changes back to the FreeBSD project) then you should send your translation to the FreeBSD project (see the next question).
es: Si usted es la única persona que trabaja en un idioma en particular (o es responsable de un proyecto de traducción y quiere enviar sus cambios al proyecto FreeBSD) entonces debería enviar su traducción al proyecto FreeBSD (vea la siguiente pregunta).

source: I am the only person working on translating to this language, how do I submit my translation?
es: Soy la única persona que trabaja en la traducción a este idioma, ¿cómo presento mi traducción?

source: First, make sure your translation is organized properly. This means that it should drop into the existing documentation tree and build straight away.
es: En primer lugar, asegúrese de que su traducción está organizada correctamente. Esto significa que debe integrarse en el árbol de documentación existente y construirse de inmediato.

source: Directories below this are named according to the language code they are written in, as defined in ISO639 ([.filename]#/usr/share/misc/iso639# on a version of FreeBSD newer than 20th January 1999).
es: Los directorios por debajo de éste se nombran según el código de idioma en el que están escritos, tal y como se define en ISO639 ([.filename]#/usr/share/misc/iso639# en una versión de FreeBSD anterior al 20 de enero de 1999).

source: Hugo needs the language codes in lowercase. For example, instead of `pt_BR` Hugo uses `pt-br`.
es: Hugo necesita los códigos de idioma en minúsculas. Por ejemplo, en lugar de `pt_BR` Hugo utiliza `pt-br`.

source: Currently, the FreeBSD documentation is stored in a top level directory called [.filename]#documentation/#. Directories below this are named according to the language code they are written in, as defined in ISO639 ([.filename]#/usr/share/misc/iso639# on a version of FreeBSD newer than 20th January 1999).
es: Actualmente, la documentación de FreeBSD se almacena en un directorio de nivel superior llamado [.filename]#documentation/#. Los directorios por debajo de éste se nombran según el código de lenguaje en el que están escritos, tal y como se define en ISO639 ([.filename]#/usr/share/misc/iso639# en una versión de FreeBSD anterior al 20 de enero de 1999).

source: If your language can be encoded in different ways (for example, Chinese) then there should be directories below this, one for each encoding format you have provided.
es: Si su idioma puede codificarse de diferentes maneras (por ejemplo, chino), entonces debería haber directorios debajo de este, uno para cada formato de codificación que haya proporcionado.

source: Finally, you should have directories for each document.
es: Por último, debe tener directorios para cada documento.

source: For example, a hypothetical Swedish translation might look like:
es: Por ejemplo, una hipotética traducción al sueco podría ser así:

source: `sv` is the name of the translation, in [.filename]#lang# form. Note the two Makefiles, which will be used to build the documentation.
es: `sv` es el nombre de la traducción, en forma [.nombrearchivo]#lang#. Tenga en cuenta los dos Makefiles, que se utilizarán para construir la documentación.

source: You should use Bugzilla to link:https://bugs.freebsd.org/bugzilla/enter_bug.cgi[submit a report] indicating that you have submitted the documentation. It would be very helpful if you could get other people to look over your translation and double check it first, since it is unlikely that the person committing it will be fluent in the language.
es: Deberías usar Bugzilla para enlazar:https://bugs.freebsd.org/bugzilla/enter_bug.cgi[submit a report] indicando que has enviado la documentación. Sería muy útil que otras personas revisaran tu traducción y la comprobaran primero, ya que es poco probable que la persona que la envíe domine el idioma.

source: Someone (probably the Documentation Project Manager, currently {doceng}) will then take your translation and confirm that it builds. In particular, the following things will be looked at:
es: Alguien (probablemente el Gestor de Proyectos de Documentación, actualmente {doceng}) tomará entonces su traducción y confirmará que se construye. En particular, se comprobarán las siguientes cosas:

source: If there are any problems then whoever is looking at the submission will get back to you to work them out.
es: Si hay algún problema, la persona encargada de examinar la solicitud se pondrá en contacto con usted para resolverlo.

source: If there are no problems your translation will be committed as soon as possible.
es: Si no hay problemas, su traducción se entregará lo antes posible.

source: Can I include language or country specific text in my translation?
es: ¿Puedo incluir texto específico de un idioma o país en mi traducción?

source: We would prefer that you did not.
es: Preferiríamos que no lo hiciera.

source: For example, suppose that you are translating the Handbook to Korean, and want to include a section about retailers in Korea in your Handbook.
es: Por ejemplo, supongamos que está traduciendo el Manual al coreano y quiere incluir en él una sección sobre los minoristas de Corea.

source: There is no real reason why that information should not be in the English (or German, or Spanish, or Japanese, or ...) versions as well. It is feasible that an English speaker in Korea might try to pick up a copy of FreeBSD whilst over there. It also helps increase FreeBSD's perceived presence around the globe, which is not a bad thing.
es: No hay ninguna razón real por la que esa información no deba estar también en las versiones inglesa (o alemana, o española, o japonesa, o...). Es posible que un angloparlante en Corea intente hacerse con una copia de FreeBSD mientras está allí. También ayuda a aumentar la presencia percibida de FreeBSD en todo el mundo, lo cual no es malo.

source: If you have country specific information, please submit it as a change to the English Handbook (using Bugzilla) and then translate the change back to your language in the translated Handbook.
es: Si tiene información específica de un país, envíela como cambio al Manual en inglés (utilizando Bugzilla) y luego traduzca el cambio a su idioma en el Manual traducido.

source: Thanks.
es: Gracias.

source: Addressing the reader
es: Dirigirse al lector

source: In the English documents, the reader is addressed as "you", there is no formal/informal distinction as there is in some languages.
es: En los documentos en inglés, el lector se dirige a él como "you", no hay distinción formal/informal como en algunos idiomas.

source: If you are translating to a language which does distinguish, use whichever form is typically used in other technical documentation in your language. If in doubt, use a mildly polite form.
es: Si está traduciendo a un idioma que sí distingue, utilice la forma que se emplee habitualmente en otra documentación técnica en su idioma. En caso de duda, utilice una forma ligeramente cortés.

source: Do I need to include any additional information in my translations?
es: ¿Debo incluir información adicional en mis traducciones?

source: Yes.
es: Si.

source: The header of the English version of each document will look something like this:
es: El encabezamiento de la versión inglesa de cada documento tendrá el siguiente aspecto:

source: = Why you should use a BSD style license for your Open Source Project
es: = Por qué debería utilizar una licencia de estilo BSD para su proyecto de código abierto

source: The exact boilerplate may change, but it will always include a $FreeBSD$ line and the phrase `The FreeBSD Documentation Project`. Note that the $FreeBSD$ part is expanded automatically by Git, so it should be empty (just `$FreeBSD$`) for new files.
es: El boilerplate exacto puede cambiar, pero siempre incluirá una línea $FreeBSD$ y la frase `The FreeBSD Documentation Project`. Tenga en cuenta que la parte $FreeBSD$ es expandida automáticamente por Git, por lo que debería estar vacía (sólo `$FreeBSD$`) para los archivos nuevos.

source: Your translated documents should include their own FreeBSD line, and change the `FreeBSD Documentation Project` line to `The FreeBSD _language_ Documentation Project`.
es: Sus documentos traducidos deben incluir su propia línea FreeBSD, y cambiar la línea `FreeBSD Documentation Project` por `The FreeBSD _language_ Documentation Project`.

source: In addition, you should add a third line which indicates which revision of the English text this is based on.
es: Además, debe añadir una tercera línea que indique en qué revisión del texto inglés se basa.

source: So, the Spanish version of this file might start:
es: Por lo tanto, la versión española de este archivo podría comenzar:
