Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/porters-handbook/upgrading/_index.po
Languages: es

source: Upgrading a FreeBSD Port
es: Actualización de un port de FreeBSD

source: Chapter 11. Upgrading a Port
es: Capítulo 11. Actualización de un Port

source: Upgrading a Port
es: Actualización de un Port

source: When a port is not the most recent version available from the authors, update the local working copy of [.filename]#/usr/ports#. The port might have already been updated to the new version.
es: Cuando un port no es la versión más reciente disponible de los autores, actualice la copia de trabajo local de [..filename]#/usr/ports#. Puede que el port ya haya sido actualizado a la nueva versión.

source: When working with more than a few ports, it will probably be easier to use Git to keep the whole ports collection up-to-date, as described in extref:{handbook}ports[Using the Ports Collection, ports-using]. This will have the added benefit of tracking all the port's dependencies.
es: Cuando trabaje con más de unos pocos ports, probablemente será más fácil usar Git para mantener actualizada toda la colección de ports, como se describe en extref:{handbook}ports[Usando la colección de ports, ports-using]. Esto tendrá el beneficio añadido de rastrear todas las dependencias del port.

source: The next step is to see if there is an update already pending. To do this, there are two options. There is a searchable interface to the https://bugs.freebsd.org/search/[FreeBSD Problem Report (PR) or bug database]. Select `Ports & Packages` in the `Product` multiple select menu, and enter the name of the port in the `Summary` field.
es: El siguiente paso es comprobar si ya hay una actualización pendiente. Para ello hay dos opciones. Hay una interfaz de búsqueda en https://bugs.freebsd.org/search/[FreeBSD Problem Report (PR) o base de datos de fallos]. Seleccione `Ports & Packages` en el menú de selección múltiple `Product` e introduzca el nombre del port en el campo `Summary`.

source: If there is no pending PR, the next step is to send an email to the port's maintainer, as shown by `make maintainer`. That person may already be working on an upgrade, or have a reason to not upgrade the port right now (because of, for example, stability problems of the new version), and there is no need to duplicate their work. Note that unmaintained ports are listed with a maintainer of `ports@FreeBSD.org`, which is just the general ports mailing list, so sending mail there probably will not help in this case.
es: Si no hay ningún PR pendiente, el siguiente paso es enviar un correo electrónico al mantenedor del port, como muestra `make maintainer`. Esa persona puede estar ya trabajando en una actualización, o tener una razón para no actualizar el port ahora mismo (debido, por ejemplo, a problemas de estabilidad de la nueva versión), y no hay necesidad de duplicar su trabajo. Tenga en cuenta que los ports no mantenidos se listan con un mantenedor de `ports@FreeBSD.org`, que es sólo la lista de correo general de ports, por lo que enviar correo allí probablemente no ayudará en este caso.

source: If the maintainer asks you to do the upgrade or there is no maintainer, then help out FreeBSD by preparing the update! Please do this by using the man:diff[1] command in the base system.
es: Si el mantenedor le pide que haga la actualización o no hay mantenedor, ¡ayude a FreeBSD preparando la actualización! Por favor, hágalo usando el comando man:diff[1] en el sistema base.

source: To create a suitable `diff` for a single patch, copy the file that needs patching to [.filename]#something.orig#, save the changes to [.filename]#something# and then create the patch:
es: Para crear un `diff` adecuado para un único parche, copie el archivo que necesita parche en [.filename]#something.orig#, guarde los cambios en [.filename]#something# y, a continuación, cree el parche:

source: Otherwise, either use the `git diff` method (crossref:upgrading[git-diff, Using Git to Make Patches]) or copy the contents of the port to an entire different directory and use the result of the recursive man:diff[1] output of the new and old ports directories (for example, if the modified port directory is called [.filename]#superedit# and the original is in our tree as [.filename]#superedit.bak#, then save the result of `diff -ruN superedit.bak superedit`). Either unified or context diff is fine, but port committers generally prefer unified diffs. Note the use of the `-N` option-this is the accepted way to force diff to properly deal with the case of new files being added or old files being deleted. Before sending us the diff, please examine the output to make sure all the changes make sense. (In particular, make sure to first clean out the work directories with `make clean`).
es: De lo contrario, utilice el método `git diff` (crossref:upgrading[git-diff, Usando Git para crear parches]) o copie el contenido del port a un directorio completamente diferente y utilice el resultado de la salida recursiva man:diff[1] de los directorios de ports nuevo y antiguo (por ejemplo, si el directorio del port modificado se llama [.filename]#superedit# y el original está en nuestro árbol como [.filename]#superedit.bak#, entonces guarde el resultado de `diff -ruN superedit.bak superedit`). Cualquier diff unificado o contextual está bien, pero los committers de port generalmente prefieren diffs unificados. Tenga en cuenta el uso de la opción `-N`: es la forma aceptada de forzar a diff a tratar adecuadamente el caso de que se añadan nuevos archivos o se eliminen archivos antiguos. Antes de enviarnos el diff, examine la salida para asegurarse de que todos los cambios tienen sentido. (En particular, asegúrese de limpiar primero los directorios de trabajo con `make clean`).

source: If some files have been added, copied, moved, or removed, add this information to the problem report so that the committer picking up the patch will know what man:git[1] commands to run.
es: Si se han añadido, copiado, movido o eliminado algunos archivos, añada esta información al informe del problema para que el committer que recoja el parche sepa qué comandos man:git[1] debe ejecutar.

source: To simplify common operations with patch files, use `make makepatch` as described in crossref:slow-porting[slow-patch,Patching]. Other tools exists, like [.filename]#/usr/ports/Tools/scripts/patchtool.py#. Before using it, please read [.filename]#/usr/ports/Tools/scripts/README.patchtool#.
es: Para simplificar las operaciones comunes con archivos de parche, utilice `make makepatch` como se describe en crossref:slow-porting[slow-patch,Patching]. Existen otras herramientas, como [.filename]#/usr/ports/Tools/scripts/patchtool.py#. Antes de usarla, por favor lea [.filename]#/usr/ports/Tools/scripts/README.patchtool#.

source: To submit the diff, use the https://bugs.freebsd.org/submit/[bug submit form] (product `Ports & Packages`, component `Individual Port(s)`). Always include the category with the port name, followed by colon, and brief description of the issue. Examples: `_category/portname_: _add FOO option_`; `_category/portname_: _Update to X.Y_`. Please mention any added or deleted files in the message, as they have to be explicitly specified to man:git[1] when doing a commit. Do not compress or encode the diff.
es: Para enviar el diff, utilice https://bugs.freebsd.org/submit/[bug submit form] (producto `Ports & Packages`, componente `Individual Port(s)`). Incluya siempre la categoría con el nombre del puerto, seguido de dos puntos, y una breve descripción del problema. Ejemplos: `_category/portname_: _add FOO option_`; `_category/portname_: _Actualizar a X.Y_`. Por favor, mencione cualquier archivo añadido o eliminado en el mensaje, ya que tienen que ser especificados explícitamente a man:git[1] al hacer un commit. No comprima ni codifique el diff.

source: Before submitting the bug, review the extref:{problem-reports}[Writing the problem report, pr-writing] section in the Problem Reports article. It contains far more information about how to write useful problem reports.
es: Antes de enviar el fallo, revisa la sección extref:{informes-de-problemas}[Escribiendo el informe de problemas, pr-writing] en el artículo Informes de problemas. Contiene mucha más información sobre cómo escribir informes de problemas útiles.

source: If the upgrade is motivated by security concerns or a serious fault in the currently committed port, please notify the {portmgr} to request immediate rebuilding and redistribution of the port's package. Unsuspecting users of `pkg` will otherwise continue to install the old version via `pkg install` for several weeks.
es: Si la actualización está motivada por problemas de seguridad o un fallo grave en el port actualmente comprometido, por favor notifíquelo al {portmgr} para solicitar la reconstrucción y redistribución inmediata del paquete del port. De lo contrario, los usuarios desprevenidos de `pkg` seguirán instalando la versión antigua a través de `pkg install` durante varias semanas.

source: Please use man:diff[1] or `git diff` to create updates to existing ports. Other formats include the whole file and make it impossible to see just what has changed. When diffs are not included, the entire update might be ignored.
es: Por favor, use man:diff[1] o `git diff` para crear actualizaciones de ports existentes. Otros formatos incluyen todo el fichero y hacen imposible ver sólo lo que ha cambiado. Cuando no se incluyen los diffs, la actualización completa puede ser ignorada.

source: Now that all of that is done, read about how to keep up-to-date in crossref:keeping-up[keeping-up,Keeping Up].
es: Una vez hecho esto, lea cómo mantenerse al día en crossref:keeping-up[keeping-up,Mantenerse al día].

source: Using Git to Make Patches
es: Uso de Git para crear parches

source: When possible, please submit a man:git[1] patch or diff. They are easier to handle than diffs between "new and old" directories. It is easier to see what has changed, and to update the diff if something was modified in the Ports Collection since the work on it began, or if the committer asks for something to be fixed. Also, a patch generated with man:git-format-patch[1] or man:git-diff[1] can be easily applied with man:git-am[1] or man:git-apply[1] and will save some time for the committer. Finally, the git patch generated by man:git-format-patch[1] includes your author information and commit messages. These will be recorded in the log of the repository and this is the recommended way to submit your changes.
es: Cuando sea posible, envíe un parche o diff man:git[1]. Son más fáciles de manejar que los diffs entre directorios "nuevos y viejos". Es más fácil ver qué ha cambiado, y actualizar el diff si algo se ha modificado en la Colección de Ports desde que se empezó a trabajar en ella, o si el committer pide que se arregle algo. Además, un parche generado con man:git-format-patch[1] o man:git-diff[1] puede aplicarse fácilmente con man:git-am[1] o man:git-apply[1] y ahorrará algo de tiempo al committer. Por último, el parche git generado por man:git-format-patch[1] incluye tu información de autor y los mensajes de confirmación. Estos se registrarán en el log del repositorio y esta es la forma recomendada de enviar tus cambios.

source: This can be anywhere, of course. Building ports is not limited to within [.filename]#/usr/ports/#.
es: Esto puede ser en cualquier lugar, por supuesto. Construir ports no está limitado a dentro de [.filename]#/usr/ports/#.

source: https://git.FreeBSD.org/[git.FreeBSD.org] is the FreeBSD public Git server. See extref:{handbook}mirrors[FreeBSD Git Repository URL Table, git-url-table] for more information.
es: https://git.FreeBSD.org/[git.FreeBSD.org] es el servidor público de Git de FreeBSD. Consulte extref:{handbook}mirrors[Tabla de URLs del repositorio Git de FreeBSD, git-url-table] para más información.

source: While in the port directory, make any changes that are needed. If adding, moving, or removing a file, use `git` to track these changes:
es: Mientras estés en el directorio del puerto, haz los cambios que sean necesarios. Si añades, mueves o eliminas un archivo, utiliza `git` para rastrear estos cambios:

source: Make sure to check the port using the checklist in crossref:quick-porting[porting-testing,Testing the Port] and crossref:quick-porting[porting-portlint,Checking the Port with `portlint`].
es: Asegúrese de comprobar el puerto utilizando la lista de comprobación en crossref:quick-porting[porting-testing,Probando el puerto] y crossref:quick-porting[porting-portlint,Comprobando el puerto con `portlint`].

source: Also, update the checksum reference in distinfo with `make makesum`.
es: Además, actualiza la referencia de la checksum en distinfo con `make makesum`.

source: Before making the patch, fetch the latest repository and rebase the changes on top of it. Watch and follow the output carefully. If any of the files failed to rebase, it means that the upstream files changed while you were editing the same file, and the conflicts need to be resolved manually.
es: Antes de hacer el parche, obtenga el último repositorio y vuelva a basar los cambios sobre él. Observa y sigue la salida cuidadosamente. Si alguno de los archivos no se basa, significa que los archivos upstream cambiaron mientras estabas editando el mismo archivo, y los conflictos necesitan ser resueltos manualmente.

source: Check the changes staged for the patch:
es: Compruebe los cambios preparados para el parche:

source: The last step is to make an unified diff or patch of the changes:
es: El último paso es hacer un diff o parche unificado de los cambios:

source: To generate a patch with man:git-format-patch[1]:
es: Para generar un parche con man:git-format-patch[1]:

source: This will generate a patch named like `0001-foo.patch`. This is the preferred way as it would include author identity, and it is also easier when you are making a series of changes that are not meant to be squashed together.
es: Esto generará un parche llamado `0001-foo.patch`. Esta es la forma preferida, ya que incluiría la identidad del autor, y también es más fácil cuando usted está haciendo una serie de cambios que no están destinados a ser aplastados juntos.

source: Alternatively, to generate an unified diff with man:git-diff[1]:
es: Alternativamente, para generar un diff unificado con man:git-diff[1]:

source: This will generate a diff named like `foo-1.2.3.diff`. Where `foo` is replaced with the first line of the commit message, i.e., the subject of the commit message.
es: Esto generará un diff llamado `foo-1.2.3.diff`. Donde `foo` se sustituye por la primera línea del mensaje de confirmación, es decir, el asunto del mensaje de confirmación.

source: After patch has been created, you can switch to the main branch for starting other developments.
es: Una vez creado el parche, puede pasar a la rama principal para iniciar otros desarrollos.

source: Once the patch is accepted and merged, you can delete the local development branch if you want:
es: Una vez aceptado y fusionado el parche, puede eliminar la rama de desarrollo local si lo desea:

source: If files have been added, moved, or removed, include the man:git[1] `add`, `mv`, and `rm` commands that were used. `git mv` must be run before the patch can be applied. `git add` or `git rm` must be run after the patch is applied.
es: Si se han añadido, movido o eliminado archivos, incluye los comandos man:git[1] `add`, `mv` y `rm` que se hayan utilizado. `git mv` debe ejecutarse antes de aplicar el parche. `git add` o `git rm` deben ejecutarse después de aplicar el parche.

source: Send the patch following the extref:{problem-reports}[problem report submission guidelines, pr-writing].
es: Envíe el parche siguiendo las directrices extref:{problem-reports}[directrices para el envío de informes de problemas, pr-writing].

source: UPDATING and MOVED
es: UPDATING y MOVED

source: If upgrading the port requires special steps like changing configuration files or running a specific program, it must be documented in this file. The format of an entry in this file is:
es: Si la actualización del puerto requiere pasos especiales, como cambiar los archivos de configuración o ejecutar un programa específico, debe documentarse en este archivo. El formato de una entrada en este archivo es:

source: YYYYMMDD: AFFECTS: users of portcategory/portname AUTHOR: Your name <Your email address>
es: YYYYMMDD: AFFECTS: usuarios de portcategory/portname AUTHOR: Su nombre <Su dirección de correo electrónico>

source: Special instructions
es: Instrucciones especiales

source: When including exact portmaster, portupgrade, and/or pkg instructions, please make sure to get the shell escaping right. For example, do _not_ use:
es: Cuando incluya instrucciones exactas de portmaster, portupgrade y/o pkg, por favor asegúrese de usar correctamente el escape del shell. Por ejemplo, _no_ use:

source: As shown, the command will only work with bourne shells. Instead, use the form shown below, which will work with both bourne shell and c-shell:
es: Como se muestra, el comando sólo funcionará con bourne shells. En su lugar, utilice la forma que se muestra a continuación, que funcionará tanto con bourne shell como con c-shell:

source: It is recommended that the AFFECTS line contains a glob matching all the ports affected by the entry so that automated tools can parse it as easily as possible. If an update concerns all the existing BIND 9 versions the `AFFECTS` content must be `users of dns/bind9*`, it must _not_ be `users of BIND 9`
es: Se recomienda que la línea AFFECTS contenga un glob que coincida con todos los puertos afectados por la entrada para que las herramientas automatizadas puedan analizarla lo más fácilmente posible. Si una actualización afecta a todas las versiones existentes de BIND 9 el contenido de `AFFECTS` debe ser `users of dns/bind9*`, no debe ser `users of BIND 9`

source: This file is used to list moved or removed ports. Each line in the file is made up of the name of the port, where the port was moved, when, and why. If the port was removed, the section detailing where it was moved can be left blank. Each section must be separated by the `|` (pipe) character, like so:
es: Este fichero se utiliza para listar los puertos movidos o eliminados. Cada línea del fichero se compone del nombre del puerto, dónde se movió, cuándo y por qué. Si el puerto fue eliminado, la sección que detalla dónde fue movido puede dejarse en blanco. Cada sección debe estar separada por el carácter `|` (pipe), así:

source: old name|new name (blank for deleted)|date of move|reason
es: antiguo nombre|nuevo nombre (en blanco para borrado)|fecha de traslado|motivo

source: The date must be entered in the form `YYYY-MM-DD`. New entries are added to the end of the list to keep it in chronological order, with the oldest entry at the top of the list.
es: La fecha debe introducirse en la forma `YYYY-MM-DD`. Las nuevas entradas se añaden al final de la lista para mantenerla en orden cronológico, con la entrada más antigua al principio de la lista.

source: If a port was removed but has since been restored, delete the line in this file that states that it was removed.
es: Si se eliminó un puerto, pero desde entonces se ha restaurado, elimine la línea de este archivo que indica que se eliminó.

source: If a port was renamed and then renamed back to its original name, add a new one with the intermediate name to the old name, and remove the old entry as to not create a loop.
es: Si se renombró un puerto y luego se le cambió el nombre a su nombre original, agregue uno nuevo con el nombre intermedio al nombre anterior y elimine la entrada anterior para no crear un bucle.

source: Any changes must be validated with `Tools/scripts/MOVEDlint.awk`.
es: Cualquier cambio debe ser validado con `Tools/scripts/MOVEDlint.awk`.

source: If using a ports directory other than [.filename]#/usr/ports#, use:
es: Si utiliza un directorio de puertos distinto de [.filename]#/usr/ports#, utilice:
