Repository: freebsd/freebsd-doc-translate
Catalog: documentation/content/*/books/fdp-primer/po-translations/_index.po
Languages: it_it

source: How to work with PO translation in the FreeBSD Documentation Project
it_it: Come lavorare con le traduzioni in formato PO nel FreeBSD Documentation Project

source: Chapter 9. PO Translations
it_it: Capitolo 9. Traduzioni in formato PO

source: PO Translations
it_it: Traduzioni in formato PO

source: Introduction
it_it: Introduzione

source: The http://www.gnu.org/software/gettext/[GNU gettext] system offers translators an easy way to create and maintain translations of documents. Translatable strings are extracted from the original document into a PO (Portable Object) file. Translated versions of the strings are entered with a separate editor. The strings can be used directly or built into a complete translated version of the original document.
it_it: Il sistema http://www.gnu.org/software/gettext/[GNU gettext] offre ai traduttori un metodo semplice per creare e mantenere aggiornate traduzioni. Le stringhe traducibili sono estratte dal documento originale in un file PO (Portable Object). Le versioni tradotte delle stringhe sono inserite con un editor separato. Le stringhe possono essere usare direttamente o unite in una versione tradotta e completa del documento originale.

source: Quick Start
it_it: Procedura rapida

source: The procedure shown in crossref:overview[overview-quick-start,Quick Start] is assumed to have already been performed. The `TRANSLATOR` option is required and already enabled by default in the package:textproc/docproj[] port.
it_it: Si suppone che la procedura illustrata in crossref:overview[overview-quick-start,Partenza Veloce] sia già stata seguita. È necessaria l'opzione `TRANSLATOR`, che è attivata di default nel port package:textproc/docproj[].

source: This example shows the creation of a Spanish translation of the short extref:{leap-seconds}[Leap Seconds] article.
it_it: Questo esempio mostra la creazione di una traduzione spagnola del breve articolo extref:{leap-seconds}[Secondi intercalari].

source: Procedure: Install a PO Editor
it_it: Procedura: Installare un Editor PO

source: A PO editor is needed to edit translation files. This example uses package:editors/poedit[].
it_it: È necessario un editor PO per modificare file di traduzione. Questo esempio usa package:editors/poedit[].

source: Procedure: Initial Setup
it_it: Procedura: Configurazione iniziale

source: When a new translation is first created, the directory structure must be created or copied from the English original:
it_it: Quando si crea una nuova traduzione, la struttura delle directory deve essere creata o copiata dall'originale inglese:

source: Create a directory for the new translation. The English article source is in [.filename]#~/doc/documentation/content/en/articles/leap-seconds/#. The Spanish translation will go in [.filename]#~/doc/documentation/content/es/articles/leap-seconds/#. The path is the same except for the name of the language directory. The English article source is in [.filename]#~/doc/en/articles/leap-seconds/#. The Spanish translation will go in [.filename]#~/doc/es/articles/leap-seconds/#. The path is the same except for the name of the language directory.
it_it: Creare una directory per la nuova traduzione. Il sorgente dell'articolo inglese è in [.filename]#~/doc/documentation/content/en/articles/leap-seconds/#. La traduzione spagnola andrà in [.filename]#~/doc/documentation/content/es/articles/leap-seconds/#. Il percorso è lo stesso tranne che per il nome della directory della lingua. Il sorgente dell'articolo inglese è in [.filename]#~/doc/en/articles/leap-seconds/#. La traduzione spagnola andrà in [.filename]#~/doc/es/articles/leap-seconds/#. Il percorso è lo stesso tranne che per il nome della directory della lingua.

source: Procedure: Translation
it_it: Procedura: Traduzione

source: Procedure: Generating a Translated Document
it_it: Procedura: Generare un documento tradotto

source: Generate the translated document:
it_it: Generare il documento tradotto:

source: The name of the generated document matches the name of the English original, usually [.filename]#_index.adoc#.
it_it: Il nome del documento generato è lo stesso dell'originale inglese, solitamente [.filename]#_index.adoc#.

source: Check the generated file by rendering it to HTML and viewing it with a web browser:
it_it: Controllare il file generato convertendolo in HTML e visualizzandolo con un browser web:

source: Creating New Translations
it_it: Creare Nuove Traduzioni

source: The first step to creating a new translated document is locating or creating a directory to hold it. FreeBSD puts translated documents in a subdirectory named for their language and region in the format [.filename]#lang#. _lang_ is a two-character lowercase code.
it_it: Il primo passo per tradurre un nuovo documento è localizzare o creare una directory per conservarlo. FreeBSD pone i documenti tradotti in sottodirectory chiamate secondo la loro lingua e regione nel formato [.filename]#lang#. _lang_ è un codice di due caratteri minuscoli.

source: Language Names
it_it: Nomi delle Lingue

source: Language
it_it: Lingua

source: Region
it_it: Regione

source: Translated Directory Name
it_it: Nome della Directory di Traduzione

source: English
it_it: Inglese

source: United States
it_it: Stati Uniti

source: Danish
it_it: Danese

source: Denmark
it_it: Danimarca

source: German
it_it: Tedesco

source: Germany
it_it: Germania

source: Greek
it_it: Greco

source: Greece
it_it: Grecia

source: Spanish
it_it: Spagnolo

source: Spain
it_it: Spagna

source: French
it_it: Francese

source: France
it_it: Francia

source: Hungarian
it_it: Ungherese

source: Hungary
it_it: Ungheria

source: Italian
it_it: Italiano

source: Italy
it_it: Italia

source: Japanese
it_it: Giapponese

source: Japan
it_it: Giappone

source: Korean
it_it: Coreano

source: Korea
it_it: Corea

source: Mongolian
it_it: Mongolo

source: Dutch
it_it: Olandese

source: Netherlands
it_it: Paesi Bassi

source: Polish
it_it: Polacco

source: Poland
it_it: Polonia

source: Portuguese
it_it: Portoghese

source: Brazil
it_it: Brasile

source: Russian
it_it: Russo

source: Turkish
it_it: Turco

source: Turkey
it_it: Turchia

source: Chinese
it_it: Cinese

source: China
it_it: Cina

source: The translations are in subdirectories of the main documentation directory, here assumed to be [.filename]#~/doc/documentation/# as shown in crossref:overview[overview-quick-start, Quick Start]. For example, German translations are located in [.filename]#~/doc/documentation/content/de/#, and French translations are in [.filename]#~/doc/documentation/content/fr/#.
it_it: Le traduzioni sono in sottodirectory della directory principale della documentazione, che qui supponiamo essere [.filename]#~/doc/documentation/# come illustrato in crossref:overview[overview-quick-start, Partenza Veloce]. Per esempio, le traduzioni tedesche si trovano in [.filename]#~/doc/documentation/content/de/# e quelle francesi in [.filename]#~/doc/documentation/content/fr/#.

source: Each language directory contains separate subdirectories named for the type of documents, usually [.filename]#articles/# and [.filename]#books/#.
it_it: La directory di ogni lingua contiene sottodirectory distinte che prendono il nome dal tipo di documenti che esse contengono, di solito [.filename]#articles/# e [.filename]#books/#.

source: Combining these directory names gives the complete path to an article or book. For example, the French translation of the NanoBSD article is in [.filename]#~/doc/documentation/content/fr/articles/nanobsd/#, and the Mongolian translation of the Handbook is in [.filename]#~/doc/documentation/content/mn/books/handbook/#.
it_it: Combinando i nomi di queste directory si ottengiene il percorso completo di un articolo o di un libro. Per esempio, la traduzione francese dell'articolo su NanoBSD è in [.filename]#~/doc/documentation/content/fr/articles/nanobsd/# e la traduzione mongola del Manuale è in [.filename]#~/doc/documentation/content/mn/books/handbook/#.

source: A new language directory must be created when translating a document to a new language. If the language directory already exists, only a subdirectory in the [.filename]#articles/# or [.filename]#books/# directory is needed.
it_it: Quando si traduce un documento in una nuova lingua, è necessario creare una nuova directory per quella lingua. Se la directory per la lingua esiste già, è sufficiente creare solo una sottodirectory in [.filename]#articles/# o [.filename]#books/#.

source: Creating a Spanish Translation of the Porter's Handbook
it_it: Creare una Traduzione Spagnola del Manuale del Porter

source: Create a new Spanish translation of the extref:{porters-handbook}[Porter's Handbook]. The original is a book in [.filename]#~/doc/documentation/content/en/books/porters-handbook/#.
it_it: Creare una traduzione spagnola del extref:{porters-handbook}[Manuale del Porter]. L'originale è un libro che si trova in [.filename]#~/doc/documentation/content/en/books/porters-handbook/#.

source: The Spanish language books directory [.filename]#~/doc/documentation/content/es/books/# already exists, so only a new subdirectory for the Porter's Handbook is needed:
it_it: La directory [.filename]#~/doc/documentation/content/es/books/# dei libri in lingua spagnola esiste già, dunque manca solo una sottodirectory per il Manuale del Porter:

source: Copy the content from the original book:
it_it: Copiare il contenuto del libro originale:

source: Now the document structure is ready for the translator to begin translating with `po4a` command.
it_it: Ora la struttura del documento è pronta affinché il traduttore possa cominciare a lavorare col comando `po4a`.

source: Translating
it_it: Tradurre

source: The gettext system greatly reduces the number of things that must be tracked by a translator. Strings to be translated are extracted from the original document into a PO file. Then a PO editor is used to enter the translated versions of each string.
it_it: Il sistema gettext riduce molto il numero di cose a cui il traduttore deve porre attenzione. Le stringhe da tradurre sono estratte dal documento originale in un file PO. Dunque viene utilizzato un editor PO per inserire le versioni tradotte di ogni stringa.

source: The FreeBSD PO translation system does not overwrite PO files, so the extraction step can be run at any time to update the PO file.
it_it: Il sistema di traduzione PO di FreeBSD non sovrascrive i file PO, dunque il passo di estrazione può essere eseguito in qualsiasi momento per aggiornare il file PO.

source: A PO editor is used to edit the file. package:editors/poedit[] is shown in these examples because it is simple and has minimal requirements. Other PO editors offer features to make the job of translating easier. The Ports Collection offers several of these editors, including package:devel/gtranslator[].
it_it: Viene utilizzato un editor PO per modificare il file. Questi esempi mostrano l'uso di package:editors/poedit[] perché è semplice e i suoi requisiti sono minimi. Altri editor PO offrono caratteristiche che rendono il lavoro di traduzione più facile. La Raccolta dei Port offre molti di questi editor, incluso package:devel/gtranslator[].

source: It is important to preserve the PO file. It contains all of the work that translators have done.
it_it: È importante conservare il file PO. Contiene tutto il lavoro svolto dai traduttori.

source: Tips for Translators
it_it: Suggerimenti per Traduttori

source: Preserving AsciiDoc macros
it_it: Conservare le macro AsciiDoc

source: Preserve AsciiDoc macros that are shown in the English original.
it_it: Conservare le macro AsciiDoc usate nell'originale inglese.

source: English original:
it_it: Originale inglese:

source: Spanish translation:
it_it: Traduzione spagnola:

source: Preserving Spaces
it_it: Conservare gli Spazi

source: Preserve existing spaces at the beginning and end of strings to be translated. The translated version must have these spaces also.
it_it: Conservare gli spazi esistenti all'inizio e alla fine delle stringhe da tradurre. La version tradotta deve avere questi stessi spazi.

source: Verbatim Tags
it_it: Tag da Copiare alla Lettera

source: The contents of some tags should be copied verbatim, not translated:
it_it: Il contenuto di alcuni tag deve essere copiato alla lettera, non tradotto:

source: `Admonitions`
it_it: `Ammonizioni`

source: `id's`
it_it: `Identificativi`

source: `Heading tags`
it_it: `Tag di intestazione`

source: Building a Translated Document
it_it: Compilare un Documento Tradotto

source: A translated version of the original document can be created at any time. Any untranslated portions of the original will be included in English in the resulting document. Most PO editors have an indicator that shows how much of the translation has been completed. This makes it easy for the translator to see when enough strings have been translated to make building the final document worthwhile.
it_it: È possibile creare una version tradotta del documento originale in qualsiasi momento. Qualsiasi porzione non tradotta dell'originale verrà mantenuta in inglese nel documento risultate. La maggior parte degli editor PO hanno un indicatore che mostra quanto lavoro è stato completato. Ciò consente al traduttore di capire quando sono state tradotte abbastanza stringhe perché valga la pena compilare il documento finale.

source: Submitting the New Translation
it_it: Proporre la Nuova Traduzione

source: Prepare the new translation files for submission. This includes adding the files to the version control system, setting additional properties on them, then creating a diff for submission.
it_it: Prepare i file della nuova traduzione da proporre. Ciò include aggiunge i file al sistema di controllo versione, impostare proprietà aggiuntive su di essi, dunque creare la patch da inviare in formato diff.

source: The diff files created by these examples can be attached to a https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation[documentation bug report] or https://reviews.freebsd.org/[code review].
it_it: I file diff creati da questi esempi possono essere allegati a https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation[un bug report di documentazione] o a https://reviews.freebsd.org/[una code review].

source: Spanish Translation of the NanoBSD Article
it_it: Traduzione Spagnola dell'articolo su NanoBSD

source: Create a diff of the new files from the [.filename]#~/doc/# base directory so the full path is shown with the filenames. This helps committers identify the target language directory.
it_it: Creare una patch dei nuovi file in formato diff a partire dalla directory di base [.filename]#~/doc/# cosicché appia il percorso completo coi nomi dei file. Questo aiuta i committer ad identificare la directory di lingua prevista.
